{
  "rule_id": "b55d23e5-6821-44ff-8a6e-67218891e49f",
  "risk_score": 73,
  "description": "Rule to detect the Hybrid Connection Manager service running on an endpoint.",
  "name": "HybridConnectionManager Service Running",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Microsoft\\-ServiceBus\\-Client AND ((event.code:(40300 OR 40301 OR 40302)) AND (*HybridConnection* OR *sb\\:\\/\\/* OR *servicebus.windows.net* OR *HybridConnectionManage*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1554"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"
  ],
  "false_positives": [
    "Legitimate use of Hybrid Connection Manager via Azure function apps."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}