id: 07fb3603-f9ec-415e-ab5f-dddb3a5b86db
status: test
description: Detects suspicious rundll32 network connections
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Image|endswith: \rundll32.exe
    Initiated: 'true'
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious rundll32 network connections'
