{
  "rule_id": "fc014922-5def-4da9-a0fc-28c973f41bfb",
  "risk_score": 73,
  "description": "This rule detects that the path to the DLL written in the registry is different from the default one. Launched WAB.exe tries to load the DLL from Registry.",
  "name": "Execution DLL of Choice Using WAB.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*\\\\Software\\\\Microsoft\\\\WAB\\\\DLLPath AND (NOT winlog.event_data.Details:%CommonProgramFiles%\\\\System\\\\wab32.dll)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "oscd.community, Natalia Shornikova"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}