{
  "rule_id": "a982fc9c-6333-4ffb-a51d-addb04e8b529",
  "risk_score": 47,
  "description": "Detects the Setting of Windows Defender Exclusions",
  "name": "Windows Defender Exclusions Added - Registry",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christian Burkard (Nextron Systems)"
  ],
  "false_positives": [
    "Administrator actions"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}