{
  "rule_id": "3f6b7b62-61aa-45db-96bd-9c31b36b653c",
  "risk_score": 73,
  "description": "Detects tampering of RDP Terminal Service/Server sensitive settings.\nSuch as allowing unauthorized users access to a system via the 'fAllowUnsolicited' or enabling RDP via 'fDenyTSConnections'...etc\n",
  "name": "RDP Sensitive Settings Changed",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((winlog.event_data.Details:(DWORD\\ \\(0x00000001\\) OR DWORD\\ \\(0x00000002\\) OR DWORD\\ \\(0x00000003\\) OR DWORD\\ \\(0x00000004\\))) AND (registry.path:(*\\\\Control\\\\Terminal\\ Server\\\\* OR *\\\\Windows\\ NT\\\\Terminal\\ Services\\\\*)) AND registry.path:*\\\\Shadow) OR (winlog.event_data.Details:DWORD\\ \\(0x00000001\\) AND (registry.path:(*\\\\Control\\\\Terminal\\ Server\\\\* OR *\\\\Windows\\ NT\\\\Terminal\\ Services\\\\*)) AND (registry.path:(*\\\\DisableRemoteDesktopAntiAlias OR *\\\\DisableSecuritySettings OR *\\\\fAllowUnsolicited OR *\\\\fAllowUnsolicitedFullControl))) OR (registry.path:(*\\\\Control\\\\Terminal\\ Server\\\\InitialProgram* OR *\\\\Control\\\\Terminal\\ Server\\\\WinStations\\\\RDP\\-Tcp\\\\InitialProgram* OR *\\\\services\\\\TermService\\\\Parameters\\\\ServiceDll* OR *\\\\Windows\\ NT\\\\Terminal\\ Services\\\\InitialProgram*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.persistence",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Samir Bousseaden, David ANDRE, Roberto Rodriguez @Cyb3rWard0g, Nasreddine Bencherchali"
  ],
  "false_positives": [
    "Some of the keys mentioned here could be modified by an administrator while setting group policy (it should be investigated either way)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}