{
  "rule_id": "2ff692c2-4594-41ec-8fcb-46587de769e0",
  "risk_score": 47,
  "description": "Detects disabling the CrashDump per registry (as used by HermeticWiper)",
  "name": "CrashControl CrashDump Disabled",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.Details:DWORD\\ \\(0x00000000\\) AND registry.path:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1564",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Tobias Michalski (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate disabling of crashdumps"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}