{
  "rule_id": "ddd171b5-2cc6-4975-9e78-f0eccd08cc76",
  "risk_score": 73,
  "description": "Detects potential persistence activity via outlook home page.\nAn attacker can set a home page to achieve code execution and persistence by editing the WebView registry keys.\n",
  "name": "Potential Persistence Via Outlook Home Page",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(registry.path:*\\\\Software\\\\Microsoft\\\\Office\\\\* AND registry.path:*\\\\Outlook\\\\WebView\\\\*) AND registry.path:*\\\\URL",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Tobias Michalski (Nextron Systems), David Bertho (@dbertho) & Eirik Sveen (@0xSV1), Storebrand"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}