{
  "rule_id": "e3b50fa5-3c3f-444e-937b-0a99d33731cd",
  "risk_score": 73,
  "description": "Detects the modification of Outlook security setting to allow unprompted execution of macros.",
  "name": "Outlook Macro Execution Without Warning Setting Enabled",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.Details:*0x00000001* AND registry.path:*\\\\Outlook\\\\Security\\\\Level",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.command-and-control",
    "attack.t1137",
    "attack.t1008",
    "attack.t1546"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@ScoubiMtl"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}