{
  "rule_id": "0442defa-b4a2-41c9-ae2c-ea7042fc4701",
  "risk_score": 47,
  "description": "Detects when an attacker tries to add a new network provider in order to dump clear text credentials, similar to how the NPPSpy tool does it",
  "name": "Potential Credential Dumping Attempt Using New NetworkProvider - REG",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(registry.path:*\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND registry.path:*\\\\NetworkProvider*) AND (NOT ((registry.path:(*\\\\System\\\\CurrentControlSet\\\\Services\\\\WebClient\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\LanmanWorkstation\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\RDPNP\\\\NetworkProvider*)) OR process.executable:C\\:\\\\Windows\\\\System32\\\\poqexec.exe))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Other legitimate network providers used and not filtred in this rule"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}