{
  "rule_id": "b110ebaf-697f-4da1-afd5-b536fa27a2c1",
  "risk_score": 73,
  "description": "Detects when the enablement of developer features such as \"Developer Mode\" or \"Application Sideloading\". Which allows the user to install untrusted packages.",
  "name": "Potential Signing Bypass Via Windows Developer Features - Registry",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.Details:DWORD\\ \\(0x00000001\\) AND (registry.path:(*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\AppModelUnlock* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\Appx\\\\*)) AND (registry.path:(*\\\\AllowAllTrustedApps OR *\\\\AllowDevelopmentWithoutDevLicense))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}