{
  "rule_id": "4a5f5a5e-ac01-474b-9b4e-d61298c9df1d",
  "risk_score": 73,
  "description": "Detects that a powershell code is written to the registry as a service.",
  "name": "PowerShell as a Service in Registry",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(winlog.event_data.Details:(*powershell* OR *pwsh*)) AND registry.path:*\\\\Services\\\\* AND registry.path:*\\\\ImagePath",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1569.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "oscd.community, Natalia Shornikova"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}