{
  "rule_id": "092af964-4233-4373-b4ba-d86ea2890288",
  "risk_score": 47,
  "description": "Detects when an attacker adds a new \"Debugger\" value to the \"AeDebug\" key in order to achieve persistence which will get invoked when an application crashes",
  "name": "Add Debugger Entry To AeDebug For Persistence",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(winlog.event_data.Details:*.dll AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AeDebug\\\\Debugger*) AND (NOT winlog.event_data.Details:\\\"C\\:\\\\WINDOWS\\\\system32\\\\vsjitdebugger.exe\\\"\\ \\-p\\ %ld\\ \\-e\\ %ld\\ \\-j\\ 0x%p)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate use of the key to setup a debugger. Which is often the case on developers machines"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}