{
  "rule_id": "cbf93e5d-ca6c-4722-8bea-e9119007c248",
  "risk_score": 47,
  "description": "Detects modification of autostart extensibility point (ASEP) in registry.",
  "name": "CurrentVersion NT Autorun Keys Modification",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND (registry.path:(*\\\\Winlogon\\\\VmApplet* OR *\\\\Winlogon\\\\Userinit* OR *\\\\Winlogon\\\\Taskman* OR *\\\\Winlogon\\\\Shell* OR *\\\\Winlogon\\\\GpExtensions* OR *\\\\Winlogon\\\\AppSetup* OR *\\\\Winlogon\\\\AlternateShells\\\\AvailableShells* OR *\\\\Windows\\\\IconServiceLib* OR *\\\\Windows\\\\Appinit_Dlls* OR *\\\\Image\\ File\\ Execution\\ Options* OR *\\\\Font\\ Drivers* OR *\\\\Drivers32* OR *\\\\Windows\\\\Run* OR *\\\\Windows\\\\Load*)) AND (NOT ((process.executable:*\\\\MicrosoftEdgeUpdate.exe AND process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Temp\\\\*) OR winlog.event_data.Details:\\(Empty\\) OR (registry.path:*\\\\Image\\ File\\ Execution\\ Options\\\\* AND (registry.path:(*\\\\DisableExceptionChainValidation OR *\\\\MitigationOptions))) OR ((registry.path:(*\\\\ClickToRunStore\\\\HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\* OR *\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\*)) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe))) OR (process.executable:*\\\\ngen.exe AND process.executable:C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework*) OR (process.executable:*\\\\OfficeClickToRun.exe AND (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*))) OR (winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe\\\" AND winlog.event_data.Details:C\\:\\\\Windows\\\\system32\\\\cmd.exe\\ \\/q\\ \\/c\\ del\\ \\/q\\ \\\"C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe AND registry.path:*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\Delete\\ Cached\\ Update\\ Binary) OR ((winlog.event_data.Details:(DWORD\\ \\(0x00000009\\) OR DWORD\\ \\(0x000003c0\\))) AND process.executable:C\\:\\\\Windows\\\\system32\\\\svchost.exe AND (registry.path:(*\\\\Winlogon\\\\GPExtensions\\\\\\{827D319E\\-6EAC\\-11D2\\-A4EA\\-00C04F79F83A\\}\\\\PreviousPolicyAreas* OR *\\\\Winlogon\\\\GPExtensions\\\\\\{827D319E\\-6EAC\\-11D2\\-A4EA\\-00C04F79F83A\\}\\\\MaxNoGPOListChangesInterval*)))))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)"
  ],
  "false_positives": [
    "Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason",
    "Legitimate administrator sets up autorun keys for legitimate reason"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}