{
  "rule_id": "992dd79f-dde8-4bb0-9085-6350ba97cfb3",
  "risk_score": 47,
  "description": "Detects setting of a new registry value related to BgInfo configuration, which can be abused to execute custom VBScript via \"BgInfo.exe\"",
  "name": "New BgInfo.EXE Custom VBScript Registry Configuration",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.Details:4* AND winlog.event_data.EventType:SetValue AND registry.path:*\\\\Software\\\\Winternals\\\\BGInfo\\\\UserFields\\\\*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate VBScript"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}