{
  "rule_id": "480421f9-417f-4d3b-9552-fd2728443ec8",
  "risk_score": 47,
  "description": "Detects modification of autostart extensibility point (ASEP) in registry.",
  "name": "Wow6432Node Windows NT CurrentVersion Autorun Keys Modification",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND (registry.path:(*\\\\Windows\\\\Appinit_Dlls* OR *\\\\Image\\ File\\ Execution\\ Options* OR *\\\\Drivers32*)) AND (NOT (winlog.event_data.Details:(\\(Empty\\) OR \\\\REGISTRY\\\\MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options)))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)"
  ],
  "false_positives": [
    "Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason",
    "Legitimate administrator sets up autorun keys for legitimate reason"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}