id: 55b0511e-1f67-46d4-aa59-c4caf5e2148d
status: test
description: Detects the creation of a WMI subscription for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.persistence
- attack.t1053.005
logsource:
  product: windows
  service: security
  definition: 'The "Microsoft-Windows-Kernel-General/Operational" event log must be
    enabled and collect a minimum of the following data field: EventID, Activity,
    TargetSid, LogonGuid, LogonType, WorkstationName, UserName, ComputerName, DomainName,
    TargetLogonId, TargetPid, TargetName, TargetParentName, TargetParentPid, TargetParentName_Pid,
    TargetParentName_Name, TargetParentName_Sid, TargetParentName_Type, TargetParentName_LogonType,
    TargetParentName_WorkstationName, TargetParentName_DomainName, TargetParentName_UserName,
    TargetParentName_ComputerName, TargetParentName_SidType, TargetParentName_SidDomain,
    TargetParentName_SidName, TargetParentName_SidRev, TargetParentName_SidAuth, TargetParentName_SidAuthType,
    TargetParentName_SidAuthDomain, TargetParentName_SidAuthName, TargetParentName_SidAuthRev,
    TargetParentName_SidAuthTypeRev'
detection:
  selection:
    EventID: 30
    TargetName|contains: WmiConsumer
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a WMI subscription for persistence'
