{
  "rule_id": "aaa5b30d-f418-420b-83a0-299cb6024885",
  "risk_score": 47,
  "description": "Detect suspicious error on protocol RDP, potential CVE-2019-0708",
  "name": "Potential RDP Exploit CVE-2019-0708",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:System AND ((event.code:(56 OR 50)) AND winlog.provider_name:TermDD)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.lateral-movement",
    "attack.t1210",
    "car.2013-07-002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Lionel PRAT, Christophe BROCAS, @atc_project (improvements)"
  ],
  "false_positives": [
    "Bad connections or network interruptions"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}