id: 3e8bc9a6-351b-4c43-a997-e9779f052fa0
status: test
description: Identify a file with timestamps set far in the past (possible timestomping
  to evade detection)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-01
tags:
- attack.defense-evasion
- attack.t1070.001
logsource:
  category: file_event
  product: linux
detection:
  keywords:
  - Tue Jan 01 00:00:01 2000
  - Tue Jan 01 00:00:01 2001
  - Tue Jan 01 00:00:01 2002
  - Tue Jan 01 00:00:01 2003
  - Tue Jan 01 00:00:01 2004
  - Tue Jan 01 00:00:01 2005
  - Tue Jan 01 00:00:01 2006
  - Tue Jan 01 00:00:01 2007
  - Tue Jan 01 00:00:01 2008
  - Tue Jan 01 00:00:01 2009
  - Tue Jan 01 00:00:01 2010
  - Tue Jan 01 00:00:01 2011
  - Tue Jan 01 00:00:01 2012
  - Tue Jan 01 00:00:01 2013
  - Tue Jan 01 00:00:01 2014
  - Tue Jan 01 00:00:01 2015
  - Tue Jan 01 00:00:01 2016
  - Tue Jan 01 00:00:01 2017
  - Tue Jan 01 00:00:01 2018
  - Tue Jan 01 00:00:01 2019
  - Tue Jan 01 00:00:01 2020
  condition: keywords
falsepositives:
- Unknown
level: medium
title: '[AUTO] Identify a file with timestamps set far in the past (possible timestomping
  to evade detection)'
