id: eba9cc95-1a26-4f56-be39-3e6e891ecc43
status: test
description: 'Detects the creation of unusually large archive files in user directories.

  This could be a sign of data exfiltration preparation.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.exfiltration
- attack.t1567.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \7z.exe
    - \rar.exe
    - \zip.exe
    TargetFilename|contains:
    - \Desktop\
    - \Downloads\
    TargetFilename|endswith:
    - .7z
    - .rar
    - .zip
    TargetFilename|re: \\[0-9]{4}-[0-9]{2}-[0-9]{2}]\\
  filter_main_legit_paths:
    TargetFilename|contains:
    - :\Program Files (x86)\
    - :\Program Files\
    - :\Windows\Temp\
    - :\Windows\System32\
    - :\Windows\SysWOW64\
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of unusually large archive files in user directories.

  This could be a sign of data exfiltration preparation.'
