{
  "rule_id": "23ceaf5c-b6f1-4a32-8559-f2ff734be516",
  "risk_score": 47,
  "description": "Detects process dump via legitimate sqldumper.exe binary",
  "name": "Dumping Process via Sqldumper.exe",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*0x0110* OR *0x01100\\:40*)) AND process.executable:*\\\\sqldumper.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Kirill Kiryanov, oscd.community"
  ],
  "false_positives": [
    "Legitimate MSSQL Server actions"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}