{
  "rule_id": "6345b048-8441-43a7-9bed-541133633d7a",
  "risk_score": 73,
  "description": "Detects the execution of \"dctask64.exe\", a signed binary by ZOHO Corporation part of ManageEngine Endpoint Central.\nThis binary can be abused for DLL injection, arbitrary command and process execution.\n",
  "name": "ManageEngine Endpoint Central Dctask64.EXE Potential Abuse",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\ executecmd64\\ * OR *\\ invokeexe\\ * OR *\\ injectDll\\ *)) AND (process.executable:*\\\\dctask64.exe OR (winlog.event_data.Hashes:(*IMPHASH\\=6834B1B94E49701D77CCB3C0895E1AFD* OR *IMPHASH\\=1BB6F93B129F398C7C4A76BB97450BBA* OR *IMPHASH\\=FAA2AC19875FADE461C8D89DCF2710A3* OR *IMPHASH\\=F1039CED4B91572AB7847D26032E6BBF*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1055.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}