{
  "rule_id": "3c05e90d-7eba-4324-9972-5d7f711a60a8",
  "risk_score": 73,
  "description": "Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)",
  "name": "UAC Bypass Tools Using ComputerDefaults",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:C\\:\\\\Windows\\\\System32\\\\ComputerDefaults.exe AND (winlog.event_data.IntegrityLevel:(High OR System OR S\\-1\\-16\\-16384 OR S\\-1\\-16\\-12288))) AND (NOT (process.parent.executable:(*\\:\\\\Windows\\\\System32* OR *\\:\\\\Program\\ Files*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1548.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christian Burkard (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}