{
  "rule_id": "c6fb44c6-71f5-49e6-9462-1425d328aee3",
  "risk_score": 73,
  "description": "Detects base64 encoded \"MpPreference\" PowerShell cmdlet code that tries to modifies or tamper with Windows Defender AV",
  "name": "Powershell Base64 Encoded MpPreference Cmdlet",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*QWRkLU1wUHJlZmVyZW5jZS* OR *FkZC1NcFByZWZlcmVuY2Ug* OR *BZGQtTXBQcmVmZXJlbmNlI*) OR process.command_line:(*U2V0LU1wUHJlZmVyZW5jZS* OR *NldC1NcFByZWZlcmVuY2Ug* OR *TZXQtTXBQcmVmZXJlbmNlI*) OR process.command_line:(*YWRkLW1wcHJlZmVyZW5jZS* OR *FkZC1tcHByZWZlcmVuY2Ug* OR *hZGQtbXBwcmVmZXJlbmNlI*) OR process.command_line:(*c2V0LW1wcHJlZmVyZW5jZS* OR *NldC1tcHByZWZlcmVuY2Ug* OR *zZXQtbXBwcmVmZXJlbmNlI*)) OR (process.command_line:(*QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *EAZABkAC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *BAGQAZAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *MAZQB0AC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *TAGUAdAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *YQBkAGQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *EAZABkAC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *hAGQAZAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *cwBlAHQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *MAZQB0AC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *zAGUAdAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}