{
  "rule_id": "550bbb84-ce5d-4e61-84ad-e590f0024dcd",
  "risk_score": 47,
  "description": "Detects usage of Gpg4win to encrypt files",
  "name": "File Encryption Using Gpg4win",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*\\ \\-c\\ * AND process.command_line:*passphrase*) AND ((process.executable:(*\\\\gpg.exe OR *\\\\gpg2.exe)) OR process.pe.description:GnuPG’s\\ OpenPGP\\ tool)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}