{
  "rule_id": "5bb68627-3198-40ca-b458-49f973db8752",
  "risk_score": 73,
  "description": "Detects rundll32 execution without parameters as observed when running Metasploit windows/smb/psexec exploit module",
  "name": "Rundll32 Execution Without Parameters",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(rundll32.exe OR rundll32)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.lateral-movement",
    "attack.t1021.002",
    "attack.t1570",
    "attack.execution",
    "attack.t1569.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Bartlomiej Czyz, Relativity"
  ],
  "false_positives": [
    "False positives may occur if a user called rundll32 from CLI with no options"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}