{
  "rule_id": "a4824fca-976f-4964-b334-0621379e84c4",
  "risk_score": 73,
  "description": "Detects the use of SDelete to erase a file not the free space",
  "name": "Potential File Overwrite Via Sysinternals SDelete",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.pe.original_file_name:sdelete.exe AND (NOT (process.command_line:(*\\ \\-h* OR *\\ \\-c* OR *\\ \\-z* OR *\\ \\/\\?*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.t1485"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}