{
  "rule_id": "e32d4572-9826-4738-b651-95fa63747e8a",
  "risk_score": 73,
  "description": "Detects usage of the \"FromBase64String\" function in the commandline which is used to decode a base64 encoded string",
  "name": "Base64 Encoded PowerShell Command Detected",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\:\\:FromBase64String\\(*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1027",
    "attack.defense-evasion",
    "attack.t1140",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Administrative script libraries"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}