{
  "rule_id": "fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4",
  "risk_score": 73,
  "description": "This rule detects execution of PowerShell scripts located in the \"C:\\Users\\Public\" folder",
  "name": "Execution of Powershell Script in Public Folder",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\-f\\ C\\:\\\\Users\\\\Public* OR *\\-f\\ \\\"C\\:\\\\Users\\\\Public* OR *\\-f\\ %Public%* OR *\\-fi\\ C\\:\\\\Users\\\\Public* OR *\\-fi\\ \\\"C\\:\\\\Users\\\\Public* OR *\\-fi\\ %Public%* OR *\\-fil\\ C\\:\\\\Users\\\\Public* OR *\\-fil\\ \\\"C\\:\\\\Users\\\\Public* OR *\\-fil\\ %Public%* OR *\\-file\\ C\\:\\\\Users\\\\Public* OR *\\-file\\ \\\"C\\:\\\\Users\\\\Public* OR *\\-file\\ %Public%*)) AND (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Max Altgelt (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}