{
  "rule_id": "867356ee-9352-41c9-a8f2-1be690d78216",
  "risk_score": 47,
  "description": "Detects regsvr32 execution to download/install/register new DLLs that are hosted on Web or FTP servers.",
  "name": "Potentially Suspicious Regsvr32 HTTP/FTP Pattern",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\ \\/i* OR *\\ \\-i*)) AND (process.executable:*\\\\regsvr32.exe OR process.pe.original_file_name:REGSVR32.EXE) AND (process.command_line:(*ftp* OR *http*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218.010"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}