{
  "rule_id": "21dd6d38-2b18-4453-9404-a0fe4a0cc288",
  "risk_score": 73,
  "description": "Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.",
  "name": "Curl Download And Execute Combination",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*curl\\ * AND process.command_line:*http* AND process.command_line:*\\-o* AND process.command_line:*\\&*) AND process.command_line:(*\\ \\-c\\ * OR *\\ \\/c\\ * OR *\\ –c\\ * OR *\\ —c\\ * OR *\\ ―c\\ *)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218",
    "attack.command-and-control",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Sreeman, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}