{
  "rule_id": "264982dc-dbad-4dce-b707-1e0d3e0f73d9",
  "risk_score": 73,
  "description": "Detects the execution of a renamed \"NirCmd.exe\" binary based on the PE metadata fields.",
  "name": "Renamed NirCmd.EXE Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.pe.original_file_name:NirCmd.exe AND (NOT (process.executable:(*\\\\nircmd.exe OR *\\\\nircmdc.exe)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059",
    "attack.defense-evasion",
    "attack.t1202"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "X__Junior (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}