{
  "rule_id": "1e0e1a81-e79b-44bc-935b-ddb9c8006b3d",
  "risk_score": 47,
  "description": "Detects the use of the Microsoft signed script \"CL_mutexverifiers\" to proxy the execution of additional PowerShell script commands",
  "name": "Potential Script Proxy Execution Via CL_Mutexverifiers.ps1",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*\\ \\-nologo\\ \\-windowstyle\\ minimized\\ \\-file\\ * AND process.executable:*\\\\powershell.exe AND (process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe))) AND (process.command_line:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1216"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems), oscd.community, Natalia Shornikova, frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}