{
  "rule_id": "27ee9438-90dc-4bef-904b-d3ef927f5e7e",
  "risk_score": 47,
  "description": "Detects execution of the Windows Kernel Debugger \"kd.exe\".",
  "name": "Windows Kernel Debugger Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\kd.exe OR process.pe.original_file_name:kd.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Rare occasions of legitimate cases where kernel debugging is necessary in production. Investigation is required"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}