{
  "rule_id": "932fb0d8-692b-4b0f-a26e-5643a50fe7d6",
  "risk_score": 47,
  "description": "Detects audio capture via PowerShell Cmdlet.",
  "name": "Audio Capture via PowerShell",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*WindowsAudioDevice\\-Powershell\\-Cmdlet* OR *Toggle\\-AudioDevice* OR *Get\\-AudioDevice\\ * OR *Set\\-AudioDevice\\ * OR *Write\\-AudioDevice\\ *)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.collection",
    "attack.t1123"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate audio capture by legitimate user."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}