{
  "rule_id": "d937b75f-a665-4480-88a5-2f20e9f9b22a",
  "risk_score": 73,
  "description": "Detection of sc.exe utility spawning by user with Medium integrity level to change service ImagePath or FailureCommand",
  "name": "Possible Privilege Escalation via Weak Service Permissions",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:*\\\\sc.exe AND (winlog.event_data.IntegrityLevel:(Medium OR S\\-1\\-16\\-8192))) AND ((process.command_line:*config* AND process.command_line:*binPath*) OR (process.command_line:*failure* AND process.command_line:*command*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1574.011"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Teymur Kheirkhabarov"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}