{
  "rule_id": "646ea171-dded-4578-8a4d-65e9822892e3",
  "risk_score": 73,
  "description": "Detects a process memory dump via \"comsvcs.dll\" using rundll32, covering multiple different techniques (ordinal, minidump function, etc.)",
  "name": "Process Memory Dump Via Comsvcs.DLL",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.executable:*\\\\rundll32.exe OR process.pe.original_file_name:RUNDLL32.EXE OR process.command_line:*rundll32*) AND ((process.command_line:(*#\\-* OR *#\\+* OR *#24* OR *24\\ * OR *MiniDump* OR *#65560*)) AND (process.command_line:*comsvcs* AND process.command_line:*full*))) OR ((process.command_line:(*\\ #* OR *,#* OR *,\\ #* OR *\\\"#*)) AND (process.command_line:*24* AND process.command_line:*comsvcs* AND process.command_line:*full*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.credential-access",
    "attack.t1036",
    "attack.t1003.001",
    "car.2013-05-009"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), Modexp, Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}