{
  "rule_id": "d557dc06-62e8-4468-a8e8-7984124908ce",
  "risk_score": 73,
  "description": "Detects commandline keywords indicative of potential usge of the tool WinPwn. A tool for Windows and Active Directory reconnaissance and exploitation.\n",
  "name": "HackTool - WinPwn Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*Offline_Winpwn* OR *WinPwn\\ * OR *WinPwn.exe* OR *WinPwn.ps1*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.defense-evasion",
    "attack.discovery",
    "attack.execution",
    "attack.privilege-escalation",
    "attack.t1046",
    "attack.t1082",
    "attack.t1106",
    "attack.t1518",
    "attack.t1548.002",
    "attack.t1552.001",
    "attack.t1555",
    "attack.t1555.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Swachchhanda Shrawan Poudel"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}