{
  "rule_id": "e92a4287-e072-4a40-9739-370c106bb750",
  "risk_score": 73,
  "description": "Detects the execution of SOAPHound, a .NET tool for collecting Active Directory data, using specific command-line arguments that may indicate an attempt to extract sensitive AD information.\n",
  "name": "HackTool - SOAPHound Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\ \\-\\-buildcache\\ * OR *\\ \\-\\-bhdump\\ * OR *\\ \\-\\-certdump\\ * OR *\\ \\-\\-dnsdump\\ *)) AND (process.command_line:(*\\ \\-c\\ * OR *\\ \\-\\-cachefilename\\ * OR *\\ \\-o\\ * OR *\\ \\-\\-outputdirectory*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1087"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@kostastsale"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}