{
  "rule_id": "0c92f2e6-f08f-4b73-9216-ecb0ca634689",
  "risk_score": 47,
  "description": "Detects the use of rcedit to potentially alter executable PE metadata properties, which could conceal efforts to rename system utilities for defense evasion.",
  "name": "PUA - Potential PE Metadata Tamper Using Rcedit",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*OriginalFileName* OR *CompanyName* OR *FileDescription* OR *ProductName* OR *ProductVersion* OR *LegalCopyright*)) AND process.command_line:*\\-\\-set\\-* AND ((process.executable:(*\\\\rcedit\\-x64.exe OR *\\\\rcedit\\-x86.exe)) OR process.pe.description:Edit\\ resources\\ of\\ exe OR process.pe.product:rcedit)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1036.003",
    "attack.t1036",
    "attack.t1027.005",
    "attack.t1027"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Micah Babinski"
  ],
  "false_positives": [
    "Legitimate use of the tool by administrators or users to update metadata of a binary"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}