{
  "rule_id": "551d9c1f-816c-445b-a7a6-7a3864720d60",
  "risk_score": 73,
  "description": "Detects suspicious child processes of Excel which could be an indicator of lateral movement leveraging the \"ActivateMicrosoftApp\" Excel DCOM object.\n",
  "name": "Potential Excel.EXE DCOM Lateral Movement Via ActivateMicrosoftApp",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.pe.original_file_name:(foxprow.exe OR schdplus.exe OR winproj.exe)) OR (process.executable:(*\\\\foxprow.exe OR *\\\\schdplus.exe OR *\\\\winproj.exe))) AND process.parent.executable:*\\\\excel.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1021.003",
    "attack.lateral-movement"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Aaron Stratton"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}