{
  "rule_id": "734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8",
  "risk_score": 47,
  "description": "Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM host process) as a parent or child process (sign of an active PowerShell remote session).",
  "name": "Remote PowerShell Session Host Process (WinRM)",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\wsmprovhost.exe OR process.parent.executable:*\\\\wsmprovhost.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001",
    "attack.t1021.006"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Roberto Rodriguez @Cyb3rWard0g"
  ],
  "false_positives": [
    "Legitimate usage of remote Powershell, e.g. for monitoring purposes."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}