{
  "rule_id": "455b9d50-15a1-4b99-853f-8d37655a4c1b",
  "risk_score": 73,
  "description": "Detects active directory enumeration activity using known AdFind CLI flags",
  "name": "PUA - Suspicious ActiveDirectory Enumeration Via AdFind.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\-sc\\ admincountdmp* OR process.command_line:*\\-sc\\ exchaddresses* OR (process.command_line:(*lockoutduration* OR *lockoutthreshold* OR *lockoutobservationwindow* OR *maxpwdage* OR *minpwdage* OR *minpwdlength* OR *pwdhistorylength* OR *pwdproperties*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1087.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Authorized administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}