{
  "rule_id": "90d6bd71-dffb-4989-8d86-a827fedd6624",
  "risk_score": 47,
  "description": "Detects Visual Studio Code tunnel execution. Attackers can abuse this functionality to establish a C2 channel",
  "name": "Visual Studio Code Tunnel Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*.exe\\ tunnel AND (NOT _exists_:process.pe.original_file_name)) OR ((process.command_line:*\\/d\\ \\/c\\ * AND process.command_line:*\\\\servers\\\\Stable\\-* AND process.command_line:*code\\-server.cmd*) AND process.executable:*\\\\cmd.exe AND process.parent.command_line:*\\ tunnel) OR (process.command_line:*.exe\\ tunnel* AND process.command_line:*\\-\\-name\\ * AND process.command_line:*\\-\\-accept\\-server\\-license\\-terms*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1071.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems), citron_ninja"
  ],
  "false_positives": [
    "Legitimate use of Visual Studio Code tunnel"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}