{
  "rule_id": "d2b749ee-4225-417e-b20e-a8d2193cbb84",
  "risk_score": 47,
  "description": "Detects the execution of AdvancedRun utility",
  "name": "PUA - AdvancedRun Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.pe.original_file_name:AdvancedRun.exe OR (process.command_line:*\\ \\/EXEFilename\\ * AND process.command_line:*\\ \\/Run*) OR (process.command_line:*\\ \\/WindowState\\ 0* AND process.command_line:*\\ \\/RunAs\\ * AND process.command_line:*\\ \\/CommandLine\\ *)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1564.003",
    "attack.t1134.002",
    "attack.t1059.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}