{
  "rule_id": "6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca",
  "risk_score": 73,
  "description": "Detects potentially suspicious child processes of \"regsvr32.exe\".",
  "name": "Potentially Suspicious Child Process Of Regsvr32",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.executable:(*\\\\calc.exe OR *\\\\cscript.exe OR *\\\\explorer.exe OR *\\\\mshta.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\nltest.exe OR *\\\\notepad.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\reg.exe OR *\\\\schtasks.exe OR *\\\\werfault.exe OR *\\\\wscript.exe)) AND process.parent.executable:*\\\\regsvr32.exe) AND (NOT (process.command_line:*\\ \\-u\\ \\-p\\ * AND process.executable:*\\\\werfault.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218.010"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "elhoim, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely, but can rarely occur. Apply additional filters accordingly."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}