{
  "rule_id": "deb9b646-a508-44ee-b7c9-d8965921c6b6",
  "risk_score": 73,
  "description": "Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation",
  "name": "Powershell Token Obfuscation - Process Creation",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:/\\w+`(\\w+|-|.)`[\\w+|\\s]/ OR process.command_line:/\"(\\{\\d\\})+\"\\s*-f/ OR process.command_line:/(?i)\\$\\{`?e`?n`?v`?:`?p`?a`?t`?h`?\\}/) AND (NOT process.command_line:*$\\{env\\:path\\}*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1027.009"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}