{
  "rule_id": "43e32da2-fdd0-4156-90de-50dfd62636f9",
  "risk_score": 47,
  "description": "Deployment Image Servicing and Management tool. DISM is used to enumerate, install, uninstall, configure, and update features and packages in Windows images",
  "name": "Dism Remove Online Package",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*\\/Online* AND process.command_line:*\\/Disable\\-Feature*) AND process.executable:*\\\\Dism.exe) OR (process.executable:*\\\\DismHost.exe AND (process.parent.command_line:*\\/Online* AND process.parent.command_line:*\\/Disable\\-Feature*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate script"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}