{
  "rule_id": "87a476dc-0079-4583-a985-dee7a20a03de",
  "risk_score": 47,
  "description": "Detects processes that query known 3rd party registry keys that holds credentials via commandline",
  "name": "Enumeration for 3rd Party Creds From CLI",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions* OR *\\\\Software\\\\SimonTatham\\\\PuTTY\\\\SshHostKeys\\\\* OR *\\\\Software\\\\Mobatek\\\\MobaXterm\\\\* OR *\\\\Software\\\\WOW6432Node\\\\Radmin\\\\v3.0\\\\Server\\\\Parameters\\\\Radmin* OR *\\\\Software\\\\Aerofox\\\\FoxmailPreview* OR *\\\\Software\\\\Aerofox\\\\Foxmail\\\\V3.1* OR *\\\\Software\\\\IncrediMail\\\\Identities* OR *\\\\Software\\\\Qualcomm\\\\Eudora\\\\CommandLine* OR *\\\\Software\\\\RimArts\\\\B2\\\\Settings* OR *\\\\Software\\\\OpenVPN\\-GUI\\\\configs* OR *\\\\Software\\\\Martin\\ Prikryl\\\\WinSCP\\ 2\\\\Sessions* OR *\\\\Software\\\\FTPWare\\\\COREFTP\\\\Sites* OR *\\\\Software\\\\DownloadManager\\\\Passwords* OR *\\\\Software\\\\OpenSSH\\\\Agent\\\\Keys* OR *\\\\Software\\\\TightVNC\\\\Server* OR *\\\\Software\\\\ORL\\\\WinVNC3\\\\Password* OR *\\\\Software\\\\RealVNC\\\\WinVNC4*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1552.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}