{
  "rule_id": "696bfb54-227e-4602-ac5b-30d9d2053312",
  "risk_score": 47,
  "description": "Detects potentially suspicious SQL queries using SQLCmd targeting the Veeam backup databases in order to steal information.",
  "name": "Veeam Backup Database Suspicious Query",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*BackupRepositories* OR *Backups* OR *Credentials* OR *HostCreds* OR *SmbFileShares* OR *Ssh_creds* OR *VSphereInfo*)) AND ((process.command_line:*VeeamBackup* AND process.command_line:*From\\ *) AND process.executable:*\\\\sqlcmd.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.collection",
    "attack.t1005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}