{
  "rule_id": "a96970af-f126-420d-90e1-d37bf25e50e1",
  "risk_score": 47,
  "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image detection",
  "name": "Use Short Name Path in Image",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:(*\\~1\\\\* OR *\\~2\\\\*)) AND (NOT (((process.parent.executable:(C\\:\\\\Windows\\\\System32\\\\Dism.exe OR C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe)) OR (process.parent.executable:(*\\\\WebEx\\\\WebexHost.exe OR *\\\\thor\\\\thor64.exe)) OR process.pe.product:InstallShield\\ \\(R\\) OR process.pe.description:InstallShield\\ \\(R\\)\\ Setup\\ Engine OR process.pe.company:InstallShield\\ Software\\ Corporation) OR ((process.executable:*\\\\AppData\\\\* AND process.executable:*\\\\Temp\\\\*) OR (process.executable:(*\\~1\\\\unzip.exe OR *\\~1\\\\7zG.exe)))))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1564.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali"
  ],
  "false_positives": [
    "Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}