{
  "rule_id": "01c42d3c-242d-4655-85b2-34f1739632f7",
  "risk_score": 47,
  "description": "Detects usage of Dsacls to grant over permissive permissions",
  "name": "Potentially Over Permissive Permissions Granted Using Dsacls.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\ \\/G\\ * AND (process.executable:*\\\\dsacls.exe OR process.pe.original_file_name:DSACLS.EXE) AND (process.command_line:(*GR* OR *GE* OR *GW* OR *GA* OR *WP* OR *WD*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate administrators granting over permissive permissions to users"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}