{
  "rule_id": "138d3531-8793-4f50-a2cd-f291b2863d78",
  "risk_score": 73,
  "description": "Detects service path modification via the \"sc\" binary to a suspicious command or path",
  "name": "Suspicious Service Path Modification",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*powershell* OR *cmd\\ * OR *mshta* OR *wscript* OR *cscript* OR *rundll32* OR *svchost* OR *dllhost* OR *cmd.exe\\ \\/c* OR *cmd.exe\\ \\/k* OR *cmd.exe\\ \\/r* OR *cmd\\ \\/c* OR *cmd\\ \\/k* OR *cmd\\ \\/r* OR *C\\:\\\\Users\\\\Public* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*)) AND (process.command_line:*config* AND process.command_line:*binPath*) AND process.executable:*\\\\sc.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.t1543.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Victor Sergeev, oscd.community, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}