{
  "rule_id": "396f6630-f3ac-44e3-bfc8-1b161bc00c4e",
  "risk_score": 73,
  "description": "Detects suspicious Windows Error Reporting manager (wermgr.exe) child process",
  "name": "Suspicious Child Process Of Wermgr.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.executable:(*\\\\cmd.exe OR *\\\\cscript.exe OR *\\\\ipconfig.exe OR *\\\\mshta.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\netstat.exe OR *\\\\nslookup.exe OR *\\\\powershell_ise.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\systeminfo.exe OR *\\\\whoami.exe OR *\\\\wscript.exe)) AND process.parent.executable:*\\\\wermgr.exe) AND (NOT ((process.command_line:(*\\-queuereporting* OR *\\-responsepester*)) AND (process.command_line:*C\\:\\\\Windows\\\\system32\\\\WerConCpl.dll* AND process.command_line:*LaunchErcApp\\ *) AND process.executable:*\\\\rundll32.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1055",
    "attack.t1036"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}