{
  "rule_id": "5afee48e-67dd-4e03-a783-f74259dcf998",
  "risk_score": 73,
  "description": "Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process.\nThis way we are also able to catch cases in which the attacker has renamed the procdump executable.\n",
  "name": "Potential LSASS Process Dump Via Procdump",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*\\ \\-ma\\ * OR *\\ \\/ma\\ * OR *\\ –ma\\ * OR *\\ —ma\\ * OR *\\ ―ma\\ *) AND process.command_line:*\\ ls*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1036",
    "attack.credential-access",
    "attack.t1003.001",
    "car.2013-05-009"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely, because no one should dump an lsass process memory",
    "Another tool that uses command line flags similar to ProcDump"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}