{
  "rule_id": "e13f668e-7f95-443d-98d2-1816a7648a7b",
  "risk_score": 47,
  "description": "Adversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable.",
  "name": "Detected Windows Software Discovery",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*query* AND process.command_line:*\\\\software\\\\* AND process.command_line:*\\/v* AND process.command_line:*svcversion*) AND process.executable:*\\\\reg.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1518"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nikita Nazarov, oscd.community"
  ],
  "false_positives": [
    "Legitimate administration activities"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}