{
  "rule_id": "91edcfb1-2529-4ac2-9ecc-7617f895c7e4",
  "risk_score": 47,
  "description": "Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI.\nAn example would be a threat actor creating a new user via the net command and providing the password inline\n",
  "name": "Weak or Abused Passwords In CLI",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*123456789* OR *123123qwE* OR *Asd123.aaaa* OR *Decryptme* OR *P@ssw0rd\\!* OR *Pass8080* OR *password123* OR *test@202*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.execution"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate usage of the passwords by users via commandline (should be discouraged)",
    "Other currently unknown false positives"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}