{
  "rule_id": "6b65c28e-11f3-46cb-902a-68f2cafaf474",
  "risk_score": 73,
  "description": "Detects execution of \"odbcconf\" where the path of the DLL being registered is located in a potentially suspicious location.",
  "name": "Odbcconf.EXE Suspicious DLL Location",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\:\\\\PerfLogs\\\\* OR *\\:\\\\ProgramData\\\\* OR *\\:\\\\Temp\\\\* OR *\\:\\\\Users\\\\Public\\\\* OR *\\:\\\\Windows\\\\Registration\\\\CRMLog* OR *\\:\\\\Windows\\\\System32\\\\com\\\\dmp\\\\* OR *\\:\\\\Windows\\\\System32\\\\FxsTmp\\\\* OR *\\:\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\* OR *\\:\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\* OR *\\:\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\* OR *\\:\\\\Windows\\\\Tasks\\\\* OR *\\:\\\\Windows\\\\Temp\\\\* OR *\\:\\\\Windows\\\\Tracing\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\AppData\\\\Roaming\\\\*)) AND (process.executable:*\\\\odbcconf.exe OR process.pe.original_file_name:odbcconf.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218.008"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}