{
  "rule_id": "3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b",
  "risk_score": 47,
  "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection",
  "name": "Use NTFS Short Name in Image",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:(*\\~1.bat* OR *\\~1.dll* OR *\\~1.exe* OR *\\~1.hta* OR *\\~1.js* OR *\\~1.msi* OR *\\~1.ps1* OR *\\~1.tmp* OR *\\~1.vbe* OR *\\~1.vbs* OR *\\~2.bat* OR *\\~2.dll* OR *\\~2.exe* OR *\\~2.hta* OR *\\~2.js* OR *\\~2.msi* OR *\\~2.ps1* OR *\\~2.tmp* OR *\\~2.vbe* OR *\\~2.vbs*)) AND (NOT process.parent.executable:C\\:\\\\Windows\\\\explorer.exe) AND (NOT (process.parent.executable:*\\\\thor\\\\thor64.exe OR process.executable:*\\\\VCREDI\\~1.EXE OR process.parent.executable:*\\\\WebEx\\\\WebexHost.exe OR process.executable:C\\:\\\\PROGRA\\~1\\\\WinZip\\\\WZPREL\\~1.EXE))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1564.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Software Installers"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}