{
  "rule_id": "c8a180d6-47a3-4345-a609-53f9c3d834fc",
  "risk_score": 47,
  "description": "Detects suspicious reconnaissance command line activity on Windows systems using the PowerShell Get-LocalGroupMember Cmdlet",
  "name": "Suspicious Reconnaissance Activity Using Get-LocalGroupMember Cmdlet",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*Get\\-LocalGroupMember\\ * AND (process.command_line:(*domain\\ admins* OR *\\ administrator* OR *\\ administrateur* OR *enterprise\\ admins* OR *Exchange\\ Trusted\\ Subsystem* OR *Remote\\ Desktop\\ Users* OR *Utilisateurs\\ du\\ Bureau\\ à\\ distance* OR *Usuarios\\ de\\ escritorio\\ remoto*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1087.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}