{
  "rule_id": "bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2",
  "risk_score": 73,
  "description": "Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection. As seen being used in the POC NtdllPipe",
  "name": "NtdllPipe Like Activity Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*type\\ %windir%\\\\system32\\\\ntdll.dll* OR *type\\ %systemroot%\\\\system32\\\\ntdll.dll* OR *type\\ c\\:\\\\windows\\\\system32\\\\ntdll.dll* OR *\\\\ntdll.dll\\ \\>\\ \\\\\\\\.\\\\pipe\\\\*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}