{
  "rule_id": "2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25",
  "risk_score": 73,
  "description": "Detects potential abuse of the provisioning registry key for indirect command execution through \"Provlaunch.exe\".",
  "name": "Potential Provisioning Registry Key Abuse For Binary Proxy Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*SOFTWARE\\\\Microsoft\\\\Provisioning\\\\Commands\\\\*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}