{
  "rule_id": "347906f3-e207-4d18-ae5b-a9403d6bcdef",
  "risk_score": 47,
  "description": "Adversaries may modify system firewalls in order to bypass controls limiting network usage",
  "name": "Netsh Allow Group Policy on Microsoft Defender Firewall",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*advfirewall* AND process.command_line:*firewall* AND process.command_line:*set* AND process.command_line:*rule* AND process.command_line:*group\\=* AND process.command_line:*new* AND process.command_line:*enable\\=Yes*) AND (process.executable:*\\\\netsh.exe OR process.pe.original_file_name:netsh.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate administration activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}