{
  "rule_id": "be344333-921d-4c4d-8bb8-e584cf584780",
  "risk_score": 73,
  "description": "Detects uncommon or suspicious child processes of \"eventvwr.exe\" which might indicate a UAC bypass attempt",
  "name": "Potentially Suspicious Event Viewer Child Process",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.parent.executable:*\\\\eventvwr.exe AND (NOT (process.executable:(*\\:\\\\Windows\\\\System32\\\\mmc.exe OR *\\:\\\\Windows\\\\System32\\\\WerFault.exe OR *\\:\\\\Windows\\\\SysWOW64\\\\WerFault.exe)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1548.002",
    "car.2019-04-001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}