{
  "rule_id": "caf201a9-c2ce-4a26-9c3a-2b9525413711",
  "risk_score": 73,
  "description": "Detects usage of the WMI class \"Win32_NTEventlogFile\" in a potentially suspicious way (delete, backup, change permissions, etc.) from a PowerShell script",
  "name": "Potentially Suspicious Call To Win32_NTEventlogFile Class",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*Win32_NTEventlogFile* AND (process.command_line:(*.BackupEventlog\\(* OR *.ChangeSecurityPermissions\\(* OR *.ChangeSecurityPermissionsEx\\(* OR *.ClearEventLog\\(* OR *.Delete\\(* OR *.DeleteEx\\(* OR *.Rename\\(* OR *.TakeOwnerShip\\(* OR *.TakeOwnerShipEx\\(*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}