{
  "rule_id": "0a13e132-651d-11eb-ae93-0242ac130002",
  "risk_score": 73,
  "description": "Threat actors can use auditpol binary to change audit policy configuration to impair detection capability.\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\n",
  "name": "Audit Policy Tampering Via Auditpol",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*disable* OR *clear* OR *remove* OR *restore*)) AND (process.executable:*\\\\auditpol.exe OR process.pe.original_file_name:AUDITPOL.EXE)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Janantha Marasinghe (https://github.com/blueteam0ps)"
  ],
  "false_positives": [
    "Administrator or administrator scripts might leverage the flags mentioned in the detection section. Either way, it should always be monitored"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}