{
  "rule_id": "00d49ed5-4491-4271-a8db-650a4ef6f8c1",
  "risk_score": 73,
  "description": "Detects suspicious ways to download files from Microsoft domains that are used to store attachments in Emails or OneNote documents",
  "name": "Suspicious Download from Office Domain",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*https\\:\\/\\/attachment.outlook.live.net\\/owa\\/* OR *https\\:\\/\\/onenoteonlinesync.onenote.com\\/onenoteonlinesync\\/*)) AND ((process.executable:(*\\\\curl.exe OR *\\\\wget.exe)) OR (process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *curl\\ * OR *wget\\ * OR *Start\\-BitsTransfer* OR *.DownloadFile\\(* OR *.DownloadString\\(*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1105",
    "attack.t1608"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Scripts or tools that download attachments from these domains (OneNote, Outlook 365)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}