{
  "rule_id": "863218bd-c7d0-4c52-80cd-0a96c09f54af",
  "risk_score": 73,
  "description": "Detects usage of \"IMEWDBLD.exe\" to download arbitrary files",
  "name": "Arbitrary File Download Via IMEWDBLD.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*http\\:\\/\\/* OR *https\\:\\/\\/*)) AND (process.executable:*\\\\IMEWDBLD.exe OR process.pe.original_file_name:imewdbld.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.execution",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Swachchhanda Shrawan Poudel"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}