{
  "rule_id": "fff9d2b7-e11c-4a69-93d3-40ef66189767",
  "risk_score": 47,
  "description": "Detects a suspicious copy operation that tries to copy a program from system (System32, SysWOW64, WinSxS) directories to another on disk.\nOften used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations.\n",
  "name": "Suspicious Copy From or To System Directory",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*copy\\ * AND process.executable:*\\\\cmd.exe) OR ((process.executable:(*\\\\robocopy.exe OR *\\\\xcopy.exe)) OR (process.pe.original_file_name:(robocopy.exe OR XCOPY.EXE))) OR ((process.command_line:(*copy\\-item* OR *\\ copy\\ * OR *cpi\\ * OR *\\ cp\\ *)) AND (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe)))) AND (process.command_line:(*\\\\System32* OR *\\\\SysWOW64* OR *\\\\WinSxS*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1036.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), Markus Neis, Tim Shelton (HAWK.IO), Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Depend on scripts and administrative tools used in the monitored environment (For example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)",
    "When cmd.exe and xcopy.exe are called directly",
    "When the command contains the keywords but not in the correct order"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}