{
  "rule_id": "185d7418-f250-42d0-b72e-0c8b70661e93",
  "risk_score": 47,
  "description": "Download and compress a remote file and store it in a cab file on local machine.",
  "name": "Suspicious Diantz Download and Compress Into a CAB File",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*diantz.exe* AND process.command_line:*\\ \\\\\\\\* AND process.command_line:*.cab*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}