{
  "rule_id": "d08a2711-ee8b-4323-bdec-b7d85e892b31",
  "risk_score": 73,
  "description": "Detects the use of the lesser known remote execution tool named CsExec a PsExec alternative",
  "name": "PUA - CsExec Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\csexec.exe OR process.pe.description:csexec",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.resource-development",
    "attack.t1587.001",
    "attack.execution",
    "attack.t1569.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}