{
  "rule_id": "fbd7c32d-db2a-4418-b92c-566eb8911133",
  "risk_score": 47,
  "description": "Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.",
  "name": "SyncAppvPublishingServer Execute Arbitrary PowerShell Code",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\\"n;\\ * AND (process.executable:*\\\\SyncAppvPublishingServer.exe OR process.pe.original_file_name:syncappvpublishingserver.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "App-V clients"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}