{
  "rule_id": "8a7e90c5-fe6e-45dc-889e-057fe4378bd9",
  "risk_score": 99,
  "description": "Detects the execution of the PoC that can be used to exploit Sysmon CVE-2022-41120",
  "name": "HackTool - SysmonEOP Execution",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "(winlog.event_data.Hashes:(*IMPHASH\\=22F4089EB8ABA31E1BB162C6D9BF72E5* OR *IMPHASH\\=5123FA4C4384D431CD0D893EEB49BBEC*)) OR process.executable:*\\\\SysmonEOP.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "cve.2022-41120",
    "attack.t1068",
    "attack.privilege-escalation"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}