{
  "rule_id": "114de787-4eb2-48cc-abdb-c0b449f93ea4",
  "risk_score": 47,
  "description": "Detect use of X509Enrollment",
  "name": "Suspicious X509Enrollment - Process Creation",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*X509Enrollment.CBinaryConverter* OR *884e2002\\-217d\\-11da\\-b2a4\\-000e7bbb2b09*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1553.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate administrative script"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}