{
  "rule_id": "9386d78a-7207-4048-9c9f-a93a7c2d1c05",
  "risk_score": 47,
  "description": "Detects launch of executable by calling the LaunchApplication function from pcwutl.dll library.",
  "name": "Code Execution via Pcwutl.dll",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*pcwutl* AND process.command_line:*LaunchApplication*) AND (process.executable:*\\\\rundll32.exe OR process.pe.original_file_name:RUNDLL32.EXE)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218.011"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Julia Fomina, oscd.community"
  ],
  "false_positives": [
    "Use of Program Compatibility Troubleshooter Helper"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}