{
  "rule_id": "05f3c945-dcc8-4393-9f3d-af65077a8f86",
  "risk_score": 47,
  "description": "Detects Access to Domain Group Policies stored in SYSVOL",
  "name": "Suspicious SYSVOL Domain Group Policy Access",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\\\SYSVOL\\\\* AND process.command_line:*\\\\policies\\\\*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1552.006"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Markus Neis, Jonhnathan Ribeiro, oscd.community"
  ],
  "false_positives": [
    "Administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}