{
  "rule_id": "75bfe6e6-cd8e-429e-91d3-03921e1d7962",
  "risk_score": 47,
  "description": "Detects ScreenConnect program starts that establish a remote access to a system.",
  "name": "Remote Access Tool - ScreenConnect Installation Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*e\\=Access\\&* AND process.command_line:*y\\=Guest\\&* AND process.command_line:*\\&p\\=* AND process.command_line:*\\&c\\=* AND process.command_line:*\\&k\\=*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.initial-access",
    "attack.t1133"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate use by administrative staff"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}