{
  "rule_id": "ac20ae82-8758-4f38-958e-b44a3140ca88",
  "risk_score": 73,
  "description": "Detects Obfuscated Powershell via use MSHTA in Scripts",
  "name": "Invoke-Obfuscation Via Use MSHTA",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*set* AND process.command_line:*\\&\\&* AND process.command_line:*mshta* AND process.command_line:*vbscript\\:createobject* AND process.command_line:*.run* AND process.command_line:*\\(window.close\\)*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1027",
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nikita Nazarov, oscd.community"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}