{
  "rule_id": "aa0b3a82-eacc-4ec3-9150-b5a9a3e3f82f",
  "risk_score": 47,
  "description": "Detects usage of the \"type\" command to download/upload data from WebDAV server",
  "name": "Potential Download/Upload Activity Using Type Command",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*type\\ \\\\\\\\* AND process.command_line:*\\ \\>\\ *) OR (process.command_line:*type\\ * AND process.command_line:*\\ \\>\\ \\\\\\\\*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}