{
  "rule_id": "60fc936d-2eb0-4543-8a13-911c750a1dfc",
  "risk_score": 73,
  "description": "Detects an interactive AT job, which may be used as a form of privilege escalation.",
  "name": "Interactive AT Job",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*interactive* AND process.executable:*\\\\at.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation",
    "attack.t1053.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community"
  ],
  "false_positives": [
    "Unlikely (at.exe deprecated as of Windows 8)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}