{
  "rule_id": "a2ea3ae7-d3d0-40a0-a55c-25a45c87cac1",
  "risk_score": 47,
  "description": "Detects when a possible suspicious driver is being installed via pnputil.exe lolbin",
  "name": "Suspicious Driver Install by pnputil.exe",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\-i* OR *\\/install* OR *\\-a* OR *\\/add\\-driver* OR *.inf*)) AND process.executable:*\\\\pnputil.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Hai Vaknin @LuxNoBulIshit, Avihay eldad  @aloneliassaf, Austin Songer @austinsonger"
  ],
  "false_positives": [
    "Pnputil.exe being used may be performed by a system administrator.",
    "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.",
    "Pnputil.exe being executed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}