{
  "rule_id": "a70dcb37-3bee-453a-99df-d0c683151be6",
  "risk_score": 47,
  "description": "Detects execution of netsh with the \"advfirewall\" and the \"set\" option in order to set new values for properties of a existing rule",
  "name": "Firewall Rule Update Via Netsh.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*\\ firewall\\ * AND process.command_line:*\\ set\\ *) AND (process.executable:*\\\\netsh.exe OR process.pe.original_file_name:netsh.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "X__Junior (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate administration activity",
    "Software installations and removal"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}