{
  "rule_id": "a537cfc3-4297-4789-92b5-345bfd845ad0",
  "risk_score": 73,
  "description": "Detects usage of the \"sc.exe\" utility adding a new service with special permission seen used by threat actors which makes the service hidden and unremovable.",
  "name": "Service DACL Abuse To Hide Services Via Sc.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*sdset* AND process.command_line:*DCLCWPDTSD*) AND (process.executable:*\\\\sc.exe OR process.pe.original_file_name:sc.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1574.011"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Andreas Hunkeler (@Karneades)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}