{
  "rule_id": "f44800ac-38ec-471f-936e-3fa7d9c53100",
  "risk_score": 73,
  "description": "Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.",
  "name": "PUA - CleanWipe Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\SepRemovalToolNative_x64.exe OR (process.command_line:*\\-\\-uninstall* AND process.executable:*\\\\CATClean.exe) OR (process.command_line:*\\-r* AND process.executable:*\\\\NetInstaller.exe) OR ((process.command_line:*\\/uninstall* AND process.command_line:*\\/enterprise*) AND process.executable:*\\\\WFPUnins.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate administrative use (Should be investigated either way)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}