{
  "rule_id": "f38a82d2-fba3-4781-b549-525efbec8506",
  "risk_score": 73,
  "description": "Detects the use of 3proxy, a tiny free proxy server",
  "name": "PUA - 3Proxy Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\3proxy.exe OR process.command_line:*.exe\\ \\-i127.0.0.1\\ \\-p* OR process.pe.description:3proxy\\ \\-\\ tiny\\ proxy\\ server",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1572"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}