{
  "rule_id": "faa48cae-6b25-4f00-a094-08947fef582f",
  "risk_score": 73,
  "description": "Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions.",
  "name": "Rar Usage with Password and Compression Level",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\ \\-hp* AND (process.command_line:(*\\ \\-m* OR *\\ a\\ *))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.collection",
    "attack.t1560.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@ROxPinTeddy"
  ],
  "false_positives": [
    "Legitimate use of Winrar command line version",
    "Other command line tools, that use these flags"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}