{
  "rule_id": "514e7e3e-b3b4-4a67-af60-be20f139198b",
  "risk_score": 47,
  "description": "Detects execution of Adfind.exe utility, which can be used for reconnaissance in an Active Directory environment",
  "name": "PUA - AdFind.EXE Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\AdFind.exe OR process.pe.original_file_name:AdFind.exe OR (winlog.event_data.Hashes:(*IMPHASH\\=d144de8117df2beceaba2201ad304764* OR *IMPHASH\\=12ce1c0f3f5837ecc18a3782408fa975* OR *IMPHASH\\=bca5675746d13a1f246e2da3c2217492* OR *IMPHASH\\=4fbf3f084fbbb2470b80b2013134df35* OR *IMPHASH\\=49b639b4acbecc49d72a01f357aa4930* OR *IMPHASH\\=53e117a96057eaf19c41380d0e87f1c2* OR *IMPHASH\\=680dad9e300346e05a85023965867201* OR *IMPHASH\\=21aa085d54992511b9f115355e468782*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1087.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Swachchhanda Shrawan Poudel (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}