{
  "rule_id": "42b1a5b8-353f-4f10-b256-39de4467faff",
  "risk_score": 47,
  "description": "Detect the harvesting of wifi credentials using netsh.exe",
  "name": "Harvesting Of Wifi Credentials Via Netsh.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*wlan* AND process.command_line:*\\ s* AND process.command_line:*\\ p* AND process.command_line:*\\ k* AND process.command_line:*\\=clear*) AND (process.executable:*\\\\netsh.exe OR process.pe.original_file_name:netsh.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.credential-access",
    "attack.t1040"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Andreas Hunkeler (@Karneades), oscd.community"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}