{
  "rule_id": "8f70ac5f-1f6f-4f8e-b454-db19561216c5",
  "risk_score": 73,
  "description": "Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line",
  "name": "PowerShell DownloadFile",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*powershell* AND process.command_line:*.DownloadFile* AND process.command_line:*System.Net.WebClient*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001",
    "attack.command-and-control",
    "attack.t1104",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}