{
  "rule_id": "1444443e-6757-43e4-9ea4-c8fc705f79a2",
  "risk_score": 73,
  "description": "Detects the use of the bcdedit command to tamper with the boot configuration data. This technique is often times used by malware or attackers as a destructive way before launching ransomware.",
  "name": "Boot Configuration Tampering Via Bcdedit.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*bootstatuspolicy* AND process.command_line:*ignoreallfailures*) OR (process.command_line:*recoveryenabled* AND process.command_line:*no*)) AND (process.executable:*\\\\bcdedit.exe OR process.pe.original_file_name:bcdedit.exe) AND process.command_line:*set*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.t1490"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}