{
  "rule_id": "5a6e1e16-07de-48d8-8aae-faa766c05e88",
  "risk_score": 47,
  "description": "Detects execution of \"curl.exe\" with the \"-c\" flag in order to save cookie data.",
  "name": "Potential Cookies Session Hijacking",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:/\\s-c\\s/ OR process.command_line:*\\-\\-cookie\\-jar*) AND (process.executable:*\\\\curl.exe OR process.pe.original_file_name:curl.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}