{
  "rule_id": "0f0450f3-8b47-441e-a31b-15a91dc243e2",
  "risk_score": 47,
  "description": "Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest cmdlet",
  "name": "Potential DLL File Download Via PowerShell Invoke-WebRequest",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*Invoke\\-WebRequest\\ * OR *IWR\\ *)) AND (process.command_line:*http* AND process.command_line:*OutFile* AND process.command_line:*.dll*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.execution",
    "attack.t1059.001",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), Hieu Tran"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}