{
  "rule_id": "48bbc537-b652-4b4e-bd1d-281172df448f",
  "risk_score": 47,
  "description": "Detects usage of Sysinternals PsSuspend which can be abused to suspend critical processes",
  "name": "Sysinternals PsSuspend Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.pe.original_file_name:pssuspend.exe OR (process.executable:(*\\\\pssuspend.exe OR *\\\\pssuspend64.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.persistence",
    "attack.t1543.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}