{
  "rule_id": "93671f99-04eb-4ab4-a161-70d446a84003",
  "risk_score": 47,
  "description": "Detects using Rpcping.exe to send a RPC test connection to the target server (-s) and force the NTLM hash to be sent in the process.",
  "name": "Capture Credentials with Rpcping.exe",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\rpcping.exe AND process.command_line:(*\\-s* OR *\\/s* OR *–s* OR *—s* OR *―s*) AND ((process.command_line:(*\\-u* OR *\\/u* OR *–u* OR *—u* OR *―u*) AND process.command_line:(*NTLM*)) OR (process.command_line:(*\\-t* OR *\\/t* OR *–t* OR *—t* OR *―t*) AND process.command_line:(*ncacn_np*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Julia Fomina, oscd.community"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}