{
  "rule_id": "9a019ffc-3580-4c9d-8d87-079f7e8d3fd4",
  "risk_score": 47,
  "description": "Detects execution of the \"cloudflared\" tool to connect back to a tunnel. This was seen used by threat actors to maintain persistence and remote access to compromised networks.",
  "name": "Cloudflared Tunnel Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\-config\\ * OR *\\-credentials\\-contents\\ * OR *\\-credentials\\-file\\ * OR *\\-token\\ *)) AND (process.command_line:*\\ tunnel\\ * AND process.command_line:*\\ run\\ *)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1102",
    "attack.t1090",
    "attack.t1572"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Janantha Marasinghe, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate usage of Cloudflared tunnel."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}