{
  "rule_id": "4d7cda18-1b12-4e52-b45c-d28653210df8",
  "risk_score": 73,
  "description": "Detects possible Sysmon filter driver unloaded via fltmc.exe",
  "name": "Sysmon Driver Unloaded Via Fltmc.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*unload* AND process.command_line:*sysmon*) AND (process.executable:*\\\\fltMC.exe OR process.pe.original_file_name:fltMC.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1070",
    "attack.t1562",
    "attack.t1562.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Kirill Kiryanov, oscd.community"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}