{
  "rule_id": "3c1b5fb0-c72f-45ba-abd1-4d4c353144ab",
  "risk_score": 47,
  "description": "Detects process creation events that use the Sysnative folder (common for CobaltStrike spawns)",
  "name": "Process Creation Using Sysnative Folder",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\:\\\\Windows\\\\Sysnative\\\\* OR process.executable:*\\:\\\\Windows\\\\Sysnative\\\\*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1055"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Max Altgelt (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}