{
  "rule_id": "6120ac2a-a34b-42c0-a9bd-1fb9f459f348",
  "risk_score": 47,
  "description": "Detects execution of the Add-In deployment cache updating utility (AddInutil.exe) from a non-standard directory.",
  "name": "AddinUtil.EXE Execution From Uncommon Directory",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:*\\\\addinutil.exe OR process.pe.original_file_name:AddInUtil.exe) AND (NOT (process.executable:(*\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\* OR *\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\* OR *\\:\\\\Windows\\\\WinSxS\\\\*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}