{
  "rule_id": "30e92f50-bb5a-4884-98b5-d20aa80f3d7a",
  "risk_score": 47,
  "description": "Detects events that appear when a user click on a link file with a powershell command in it",
  "name": "Hidden Powershell in Link File Pattern",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*powershell* AND process.command_line:*.lnk*) AND process.executable:C\\:\\\\Windows\\\\System32\\\\cmd.exe AND process.parent.executable:C\\:\\\\Windows\\\\explorer.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate commands in .lnk files"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}