{
  "rule_id": "114e7f1c-f137-48c8-8f54-3088c24ce4b9",
  "risk_score": 73,
  "description": "Detects AnyDesk Remote Desktop silent installation. Which can be used by attackers to gain remote access.",
  "name": "Remote Access Tool - AnyDesk Silent Installation",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\-\\-install* AND process.command_line:*\\-\\-start\\-with\\-win* AND process.command_line:*\\-\\-silent*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1219"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Ján Trenčanský"
  ],
  "false_positives": [
    "Legitimate deployment of AnyDesk"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}