{
  "rule_id": "82a6714f-4899-4f16-9c1e-9a333544d4c3",
  "risk_score": 73,
  "description": "Detects the execution of certutil with the \"encode\" flag to encode a file to base64 where the files are located in potentially suspicious locations",
  "name": "File In Suspicious Location Encoded To Base64 Via Certutil.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*\\-encode* OR *\\/encode* OR *–encode* OR *—encode* OR *―encode*) AND (process.command_line:(*\\\\AppData\\\\Roaming\\\\* OR *\\\\Desktop\\\\* OR *\\\\Local\\\\Temp\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *$Recycle.Bin*)) AND (process.executable:*\\\\certutil.exe OR process.pe.original_file_name:CertUtil.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1027"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}