{
  "rule_id": "b7e2a8d4-74bb-4b78-adc9-3f92af2d4829",
  "risk_score": 73,
  "description": "Detects when an adversary uses the reg.exe utility to add or modify new keys or subkeys",
  "name": "Reg Add Suspicious Paths",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE* OR *\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\Currentversion\\\\Winlogon* OR *\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest* OR *\\\\Microsoft\\\\Windows\\ Defender\\\\*)) AND (process.executable:*\\\\reg.exe OR process.pe.original_file_name:reg.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1112",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Rare legitimate add to registry via cli (to these locations)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}