{
  "rule_id": "9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60",
  "risk_score": 73,
  "description": "Detects the execution of format.com with an uncommon filesystem selection that could indicate a defense evasion activity in which \"format.com\" is used to load malicious DLL files or other programs.\n",
  "name": "Uncommon FileSystem Load Attempt By Format.com",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*\\/fs\\:* AND process.executable:*\\\\format.com) AND (NOT (process.command_line:(*\\/fs\\:exFAT* OR *\\/fs\\:FAT* OR *\\/fs\\:NTFS* OR *\\/fs\\:ReFS* OR *\\/fs\\:UDF*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}