{
  "rule_id": "44e24481-6202-4c62-9127-5a0ae8e3fe3d",
  "risk_score": 73,
  "description": "Detects the execution of a specific OneLiner to download and execute powershell modules in memory.",
  "name": "Obfuscated PowerShell OneLiner Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*http\\:\\/\\/127.0.0.1* AND process.command_line:*%\\{\\(IRM\\ $_\\)\\}* AND process.command_line:*Invoke*) AND process.executable:*\\\\powershell.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.execution",
    "attack.t1059.001",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@Kostastsale, TheDFIRReport"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}