{
  "rule_id": "b1876533-4ed5-4a83-90f3-b8645840a413",
  "risk_score": 99,
  "description": "Detects the execution of the hacktool SafetyKatz via PE information and default Image name",
  "name": "HackTool - SafetyKatz Execution",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\SafetyKatz.exe OR process.pe.original_file_name:SafetyKatz.exe OR process.pe.description:SafetyKatz",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}