{
  "rule_id": "01aeb693-138d-49d2-9403-c4f52d7d3d62",
  "risk_score": 73,
  "description": "Detects usage of the netsh command to open and allow connections to port 3389 (RDP). As seen used by Sarwent Malware",
  "name": "RDP Connection Allowed Via Netsh.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:(*portopening* OR *allow*)) AND (process.command_line:*firewall\\ * AND process.command_line:*add\\ * AND process.command_line:*tcp\\ * AND process.command_line:*3389*)) AND (process.executable:*\\\\netsh.exe OR process.pe.original_file_name:netsh.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Sander Wiebing"
  ],
  "false_positives": [
    "Legitimate administration activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}