{
  "rule_id": "8b0e12da-d3c3-49db-bb4f-256703f380e5",
  "risk_score": 73,
  "description": "Detects usage of the Chisel tunneling tool via the commandline arguments",
  "name": "PUA - Chisel Tunneling Tool Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\chisel.exe OR ((process.command_line:(*exe\\ client\\ * OR *exe\\ server\\ *)) AND (process.command_line:(*\\-socks5* OR *\\-reverse* OR *\\ r\\:* OR *\\:127.0.0.1\\:* OR *\\-tls\\-skip\\-verify\\ * OR *\\:socks*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1090.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Some false positives may occur with other tools with similar commandlines"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}