{
  "rule_id": "48a61b29-389f-4032-b317-b30de6b95314",
  "risk_score": 73,
  "description": "Detects suspicious Plink tunnel port forwarding to a local port",
  "name": "Suspicious Plink Port Forwarding",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*\\ \\-R\\ * AND process.pe.description:Command\\-line\\ SSH,\\ Telnet,\\ and\\ Rlogin\\ client",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1572",
    "attack.lateral-movement",
    "attack.t1021.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Administrative activity using a remote port forwarding to a local port"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}