{
  "rule_id": "ee218c12-627a-4d27-9e30-d6fb2fe22ed2",
  "risk_score": 47,
  "description": "Detects inline execution of PowerShell code from a file",
  "name": "Powershell Inline Execution From A File",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*iex\\ * OR *Invoke\\-Expression\\ * OR *Invoke\\-Command\\ * OR *icm\\ *)) AND process.command_line:*\\ \\-raw* AND (process.command_line:(*cat\\ * OR *get\\-content\\ * OR *type\\ *))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}