{
  "rule_id": "aef9d1f1-7396-4e92-a927-4567c7a495c1",
  "risk_score": 47,
  "description": "Detects execution of \"git\" in order to clone a remote repository that contain suspicious keywords which might be suspicious",
  "name": "Suspicious Git Clone",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\ clone\\ * OR *git\\-remote\\-https\\ *)) AND ((process.executable:(*\\\\git.exe OR *\\\\git\\-remote\\-https.exe)) OR process.pe.original_file_name:git.exe) AND (process.command_line:(*exploit* OR *Vulns* OR *vulnerability* OR *RemoteCodeExecution* OR *Invoke\\-* OR *CVE\\-* OR *poc\\-* OR *ProofOfConcept* OR *proxyshell* OR *log4shell* OR *eternalblue* OR *eternal\\-blue* OR *MS17\\-*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.reconnaissance",
    "attack.t1593.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}