{
  "rule_id": "9fbf5927-5261-4284-a71d-f681029ea574",
  "risk_score": 47,
  "description": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities",
  "name": "Compress Data and Lock With Password for Exfiltration With 7-ZIP",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:(*\\ a\\ * OR *\\ u\\ *)) AND (process.pe.description:*7\\-Zip* OR (process.executable:(*\\\\7z.exe OR *\\\\7zr.exe OR *\\\\7za.exe)) OR (process.pe.original_file_name:(7z.exe OR 7za.exe))) AND process.command_line:*\\ \\-p*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.collection",
    "attack.t1560.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate activity is expected since compressing files with a password is common."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}