{
  "rule_id": "77df53a5-1d78-4f32-bc5a-0e7465bd8f41",
  "risk_score": 47,
  "description": "Detects the execution of \"gpg.exe\" from uncommon location. Often used by ransomware and loaders to decrypt/encrypt data.",
  "name": "Portable Gpg.EXE Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.executable:(*\\\\gpg.exe OR *\\\\gpg2.exe)) OR process.pe.original_file_name:gpg.exe OR process.pe.description:GnuPG’s\\ OpenPGP\\ tool) AND (NOT (process.executable:(*\\:\\\\Program\\ Files\\ \\(x86\\)\\\\GNU\\\\GnuPG\\\\bin\\\\* OR *\\:\\\\Program\\ Files\\ \\(x86\\)\\\\GnuPG\\ VS\\-Desktop\\\\* OR *\\:\\\\Program\\ Files\\ \\(x86\\)\\\\GnuPG\\\\bin\\\\* OR *\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Gpg4win\\\\bin\\\\*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.t1486"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}