{
  "rule_id": "7530cd3d-7671-43e3-b209-976966f6ea48",
  "risk_score": 47,
  "description": "Detects the execution of a renamed \"CURL.exe\" binary based on the PE metadata fields",
  "name": "Renamed CURL.EXE Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.pe.original_file_name:curl.exe OR process.pe.description:The\\ curl\\ executable) AND (NOT process.executable:*\\\\curl*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059",
    "attack.defense-evasion",
    "attack.t1202"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "X__Junior (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}