{
  "rule_id": "d4498716-1d52-438f-8084-4a603157d131",
  "risk_score": 47,
  "description": "Detects a when net.exe is called with a password in the command line",
  "name": "Password Provided In Command Line Of Net.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*\\ use\\ * AND process.command_line:*\\:*\\\\* AND process.command_line:*\\/USER\\:*\\ *) AND ((process.executable:(*\\\\net.exe OR *\\\\net1.exe)) OR (process.pe.original_file_name:(net.exe OR net1.exe)))) AND (NOT process.command_line:*\\ )",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.initial-access",
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.lateral-movement",
    "attack.t1021.002",
    "attack.t1078"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Tim Shelton (HAWK.IO)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}