{
  "rule_id": "67f113fa-e23d-4271-befa-30113b3e08b1",
  "risk_score": 73,
  "description": "Detects execution of javascript code using \"mshta.exe\".",
  "name": "Suspicious JavaScript Execution Via Mshta.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*javascript* AND (process.executable:*\\\\mshta.exe OR process.pe.original_file_name:MSHTA.EXE)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218.005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}