{
  "rule_id": "d2125259-ddea-4c1c-9c22-977eb5b29cf0",
  "risk_score": 47,
  "description": "Detects execution of \"certutil\" with the \"addstore\" flag in order to install a new certificate on the system.\nAdversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.\n",
  "name": "New Root Certificate Installed Via Certutil.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:(*\\-addstore* OR *\\/addstore* OR *–addstore* OR *—addstore* OR *―addstore*) AND process.command_line:*root* AND (process.executable:*\\\\certutil.exe OR process.pe.original_file_name:CertUtil.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1553.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "oscd.community, @redcanary, Zach Stanford @svch0st"
  ],
  "false_positives": [
    "Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to test if GPO push doesn't trigger FP"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}