{
  "rule_id": "89f75308-5b1b-4390-b2d8-d6b2340efaf8",
  "risk_score": 47,
  "description": "Detects the deletion of backups or system state backups via \"wbadmin.exe\".\nThis technique is used by numerous ransomware families and actors.\nThis may only be successful on server platforms that have Windows Backup enabled.\n",
  "name": "Windows Backup Deleted Via Wbadmin.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*delete\\ * AND process.command_line:*backup*) AND (process.executable:*\\\\wbadmin.exe OR process.pe.original_file_name:WBADMIN.EXE)) AND (NOT process.command_line:*keepVersions\\:0*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.t1490"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate backup activity from administration scripts and software."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}