{
  "rule_id": "40b19fa6-d835-400c-b301-41f3a2baacaf",
  "risk_score": 73,
  "description": "Shadow Copies storage symbolic link creation using operating systems utilities",
  "name": "VolumeShadowCopy Symlink Creation Via Mklink",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.command_line:*mklink* AND process.command_line:*HarddiskVolumeShadowCopy*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.002",
    "attack.t1003.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Teymur Kheirkhabarov, oscd.community"
  ],
  "false_positives": [
    "Legitimate administrator working with shadow copies, access for backup purposes"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}