{
  "rule_id": "178e615d-e666-498b-9630-9ed363038101",
  "risk_score": 47,
  "description": "Detects when a shell program such as the Windows command prompt or PowerShell is launched with system privileges from a uncommon parent location.",
  "name": "Elevated System Shell Spawned From Uncommon Parent Location",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(((process.executable:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe)) OR (process.pe.original_file_name:(PowerShell.EXE OR powershell_ise.EXE OR pwsh.dll OR Cmd.Exe))) AND (winlog.event_data.LogonId:0x3e7 AND (user.name:(*AUTHORI* OR *AUTORI*)))) AND (NOT ((process.parent.executable:(*\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR *\\:\\\\Program\\ Files\\\\* OR *\\:\\\\ProgramData\\\\* OR *\\:\\\\Windows\\\\System32\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\* OR *\\:\\\\Windows\\\\Temp\\\\* OR *\\:\\\\Windows\\\\WinSxS\\\\*)) OR (process.parent.executable:(\"\" OR \\-)) OR (NOT _exists_:process.parent.executable))) AND (NOT ((process.command_line:*\\:\\\\WINDOWS\\\\system32\\\\cmd.exe\\ \\/c\\ \\\"* AND process.working_directory:*\\:\\\\WINDOWS\\\\Temp\\\\asgard2\\-agent\\\\*) OR (process.command_line:*\\:\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\* AND process.parent.executable:*\\:\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\*) OR (process.executable:*\\\\cmd.exe AND process.parent.executable:*\\:\\\\ManageEngine\\\\ADManager\\ Plus\\\\pgsql\\\\bin\\\\postgres.exe)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation",
    "attack.defense-evasion",
    "attack.execution",
    "attack.t1059"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Tim Shelton (update fp)"
  ],
  "false_positives": [
    "Some legitimate applications may spawn shells from uncommon parent locations. Apply additional filters and perform an initial baseline before deploying."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}