{
  "rule_id": "b53317a0-8acf-4fd1-8de8-a5401e776b96",
  "risk_score": 47,
  "description": "Detects the removal or uninstallation of an application via \"Wmic.EXE\".",
  "name": "Application Removed Via Wmic.EXE",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*call* AND process.command_line:*uninstall*) AND (process.executable:*\\\\WMIC.exe OR process.pe.original_file_name:wmic.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1047"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}