{
  "rule_id": "12f6b752-042d-483e-bf9c-915a6d06ad75",
  "risk_score": 47,
  "description": "Detects attempts to disable the Windows Firewall using PowerShell",
  "name": "Windows Firewall Disabled via PowerShell",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*Set\\-NetFirewallProfile\\ * AND process.command_line:*\\ \\-Enabled\\ * AND process.command_line:*\\ False*) AND ((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe)) OR (process.pe.original_file_name:(PowerShell.EXE OR pwsh.dll))) AND (process.command_line:(*\\ \\-All\\ * OR *Public* OR *Domain* OR *Private*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1562"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Tim Rauch, Elastic (idea)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}