{
  "rule_id": "883835a7-df45-43e4-bf1d-4268768afda4",
  "risk_score": 73,
  "description": "Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe",
  "name": "Regedit as Trusted Installer",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\regedit.exe AND (process.parent.executable:(*\\\\TrustedInstaller.exe OR *\\\\ProcessHacker.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation",
    "attack.t1548"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}