{
  "rule_id": "b0524451-19af-4efa-a46f-562a977f792e",
  "risk_score": 73,
  "description": "Detects actions that clear the local ShimCache and remove forensic evidence",
  "name": "ShimCache Flush",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "((process.command_line:*rundll32* AND process.command_line:*apphelp.dll*) AND (process.command_line:(*ShimFlushCache* OR *#250*))) OR ((process.command_line:*rundll32* AND process.command_line:*kernel32.dll*) AND (process.command_line:(*BaseFlushAppcompatCache* OR *#46*)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}