{
  "rule_id": "39019a4e-317f-4ce3-ae63-309a8c6b53c5",
  "risk_score": 73,
  "description": "Detects the creation of scheduled tasks that involves a temporary folder and runs only once",
  "name": "Suspicious Scheduled Task Creation Involving Temp Folder",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*\\ \\/create\\ * AND process.command_line:*\\ \\/sc\\ once\\ * AND process.command_line:*\\\\Temp\\\\*) AND process.executable:*\\\\schtasks.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.persistence",
    "attack.t1053.005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Administrative activity",
    "Software installation"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}