{
  "rule_id": "b7b19cb6-9b32-4fc4-a108-73f19acfe262",
  "risk_score": 47,
  "description": "Detect VBoxDrvInst.exe run with parameters allowing processing INF file.\nThis allows to create values in the registry and install drivers.\nFor example one could use this technique to obtain persistence via modifying one of Run or RunOnce registry keys\n",
  "name": "Suspicious VBoxDrvInst.exe Parameters",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.command_line:*driver* AND process.command_line:*executeinf*) AND process.executable:*\\\\VBoxDrvInst.exe",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Process Create (rule: ProcessCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1112"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Konstantin Grishchenko, oscd.community"
  ],
  "false_positives": [
    "Legitimate use of VBoxDrvInst.exe utility by VirtualBox Guest Additions installation process"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}