{
  "rule_id": "fe3ac066-98bb-432a-b1e7-a5229cb39d4a",
  "risk_score": 99,
  "description": "Detects the creation of a named pipe seen used by known APTs or malware.",
  "name": "Malicious Named Pipe Created",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "file.name:(\\\\46a676ab7f179e511e30dd2dc41bd388 OR \\\\583da945\\-62af\\-10e8\\-4902\\-a8f205c72b2e OR \\\\6e7645c4\\-32c5\\-4fe3\\-aabf\\-e94c2f4370e7 OR \\\\9f81f59bc58452127884ce513865ed20 OR \\\\adschemerpc OR \\\\ahexec OR \\\\AnonymousPipe OR \\\\bc31a7 OR \\\\bc367 OR \\\\bizkaz OR \\\\csexecsvc OR \\\\dce_3d OR \\\\e710f28d59aa529d6792ca6ff0ca1b34 OR \\\\gruntsvc OR \\\\isapi_dg OR \\\\isapi_dg2 OR \\\\isapi_http OR \\\\jaccdpqnvbrrxlaf OR \\\\lsassw OR \\\\NamePipe_MoreWindows OR \\\\pcheap_reuse OR \\\\Posh* OR \\\\rpchlp_3 OR \\\\sdlrpc OR \\\\svcctl OR \\\\testPipe OR \\\\winsession)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1055"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems), blueteam0ps, elhoim"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}