id: 5ed9d03b-d51b-4f84-a75a-b86640720f85
status: test
description: Detects the execution of remote assistance tools by non-IT personnel.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.command-and-control
- attack.t1219.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \assist.exe
    - \msra.exe
  - OriginalFileName:
    - Assist.exe
    - MSRA.exe
  selection_user:
    User|contains:
    - Guest
    - Anonymous
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of remote assistance tools by non-IT personnel.'
