id: a0a04764-eb72-4123-b830-7697248a9ad9
status: test
description: Detects schtasks creating new scheduled tasks with suspicious names or
  commands
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.execution
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains:
    - ' /create '
    - ' /change '
    - ' /ru '
    - ' /sc '
    - ' /st '
    - ' /tn '
    - ' /tr '
  selection_susp_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  selection_susp_commands:
    CommandLine|contains:
    - cmd.exe /c
    - cmd.exe /k
    - cmd.exe /r
    - powershell.exe -nop -w hidden -c
    - powershell.exe -nop -w hidden -sta -m
    - powershell.exe -nop -w hidden -w hidden -m
    - powershell.exe -nop -w hidden -w hidden -sta -m
    - powershell.exe -nop -w hidden -w hidden -sta -c
    - powershell.exe -nop -w hidden -w hidden -sta -c
    - pwsh.exe -nop -w hidden -c
    - pwsh.exe -nop -w hidden -w hidden -c
    - pwsh.exe -nop -w hidden -w hidden -c
    - pwsh.exe -nop -w hidden -w hidden -sta -c
    - pwsh.exe -nop -w hidden -w hidden -sta -c
    - 'wscript.exe '
    - 'cscript.exe '
  condition: all of selection_*
falsepositives:
- Un
level: medium
title: '[AUTO] Detects schtasks creating new scheduled tasks with suspicious names
  or commands'
