id: e737c006-8454-46eb-99b1-a6827dee079c
status: test
description: Detects suspicious use of MS SQL xp_cmdshell for remote code execution
  via database
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.execution
- attack.t1059
- attack.t1106
- attack.initial-access
- attack.t1190
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sqlservr.exe
  - OriginalFileName: sqlservr.exe
  selection_cli:
    CommandLine|contains|all:
    - xp_cmdshell
    - exec
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of MS SQL xp_cmdshell for remote code execution
  via database'
