id: 4a4d3aa0-47a5-4ca3-b4f9-04946cf109d2
status: test
description: Detects encoded cscript commands
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cscript.exe
  - OriginalFileName: cscript.exe
  selection_cli:
    CommandLine|contains: ' -'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects encoded cscript commands'
