id: 8b3d33f9-bcbe-44b3-ab50-0295a81ce231
status: test
description: Detects the execution of odbcconf.exe with a malicious DLL
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-16
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \odbcconf.exe
  - OriginalFileName: odbcconf.exe
  selection_cli:
    CommandLine|contains:
    - ' -d '
    - ' -f '
  selection_dll:
    CommandLine|contains: .dll
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of odbcconf.exe with a malicious DLL'
