id: 31a63ff7-7b39-4480-9429-c731386c2f5f
status: test
description: Detects the execution of rclone with the "copy" flag and the "google-drive"
  remote. This could be a sign of exfiltration.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rclone.exe
  - OriginalFileName: rclone.exe
  selection_cli:
    CommandLine|contains|all:
    - copy
    - google-drive
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of rclone with the "copy" flag and the "google-drive"
  remote. This could be a sign of exfiltration.'
