id: b77979a3-6d6b-401f-8ef7-70e1024ce5ae
status: test
description: Detects suspicious use of Volume Shadow Copy to steal Active Directory
  database
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \vssadmin.exe
  - OriginalFileName: vssadmin.exe
  selection_cli:
    CommandLine|contains|all:
    - list shadows
    - shadowtype=all
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of Volume Shadow Copy to steal Active Directory
  database'
