id: 897e5163-ed65-4ee8-a70b-17dfe47cbd82
status: test
description: Detects PowerShell download cradle usage
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains:
    - IEX
    - Invoke-WebRequest
    - Invoke-Expression
    - Invoke-Command
    - ipmo
    - Import-Module
  selection_web:
    CommandLine|contains:
    - http
    - https
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell download cradle usage'
