author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - Add-Type
    - System.Reflection.Assembly
    - Assembly.Load
    - Invoke
  condition: all of selection_*
falsepositives:
- Unknown
level: high
id: e39734dd-ee0f-438d-bb9c-6988ac757566
title: '[AUTO] User: Generate a detection rule for Detect reflective PE injection
  via PowerShell.'
status: experimental
description: 'User: Generate a detection rule for Detect reflective PE injection via
  PowerShell.'
