id: bcd2f154-83d5-4c18-ae01-a1aed97bd42a
status: test
description: 'Detects the creation of a new scheduled task.

  Attackers can use this to execute malicious code or persistence.

  This rule is looking for the creation of a new scheduled task with the "schtasks"
  command.

  '
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1053.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains:
    - /create
    - /change
  selection_suspicious_paths:
    CommandLine|contains:
    - :\Perflogs
    - :\Users\Public
    - :\Windows\Temp
    - \AppData\Local\Temp
    - \Desktop
    - \Downloads
    - \Temporary Internet
    - \Windows\System32\Tasks
    - \Windows\SysWOW64\Tasks
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a new scheduled task.

  Attackers can use this to execute malicious code or persistence.

  This rule is looking for the creation of a new scheduled task with the "schtasks"
  command.'
