author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains:
    - ' -'
    - ' /'
  selection_dll:
    CommandLine|contains:
    - :\ProgramData\
    - :\Temp\
    - :\Tmp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: high
id: 5dff15b1-48a2-4fd5-a0b2-f02967532471
title: '[AUTO] User: Generate a detection rule for Detect rundll32 LOLBins execution.'
status: experimental
description: 'User: Generate a detection rule for Detect rundll32 LOLBins execution.'
