id: c545798f-6555-4a8e-9182-ecfee4e06f6f
status: test
description: Detects bitsadmin creating a persistent job with download commands
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cli:
    CommandLine|contains|all:
    - ' /transfer '
    - ' /create '
    - ' /y '
    - ' /url '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects bitsadmin creating a persistent job with download commands'
