id: 9ad1ae49-13b5-4886-8c25-578e08dc0076
status: test
description: Detects the execution of "Regasm" or "Regsvcs" with the "/codebase" flag
  to execute a DLL
author: AutoGenerated
date: '2025-07-12'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \regasm.exe
    - \regsvcs.exe
  - OriginalFileName:
    - RegAsm.exe
    - RegSvcs.exe
  selection_cli:
    CommandLine|contains:
    - ' /codebase '
    - ' /codebase: '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of "Regasm" or "Regsvcs" with the "/codebase"
  flag to execute a DLL'
