id: 0e2a5d3d-c3ef-432a-8109-b9c681d2b3d0
status: test
description: Detects suspicious use of 7zip to archive data for exfiltration
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.exfiltration
- attack.t1567.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \7z.exe
  - OriginalFileName: 7z.exe
  selection_cli:
    CommandLine|contains|all:
    - ' a '
    - ' -tzip '
    - ' -r '
  selection_paths:
    CommandLine|contains:
    - :\PerfLogs
    - :\Temp
    - :\Users\Public
    - :\Windows\Temp
    - \AppData\Local\Temp
    - \Desktop
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of 7zip to archive data for exfiltration'
