id: 5e16da66-448d-4350-8024-87b54d5c97a4
status: test
description: Detects suspicious use of Plink (PuTTY) or SSH client for port forwarding
  tunnels
author: AutoGenerated
date: '2025-07-12'
modified: 2024-03-13
tags:
- attack.command-and-control
- attack.t1090.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \plink.exe
    - \OpenSSH\ssh.exe
  - OriginalFileName:
    - plink.exe
    - ssh
  selection_cli:
    CommandLine|contains:
    - ' -L '
    - ' -R '
    - ' -J '
    - ' -f '
    - ' -N '
  filter_main_generic:
    CommandLine|contains:
    - ' -P '
    - ' -i '
    - ' -t '
    - ' -o '
    - ' -c '
    - ' -v '
    - ' -q '
    - ' -f '
    - ' -T '
    - ' -C '
    - ' -E '
    - ' -k '
    - ' -W '
    - ' -g '
    - ' -J '
    - ' -N '
    - ' -y '
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of Plink (PuTTY) or SSH client for port forwarding
  tunnels'
