id: 7e92f50d-de79-4542-9647-06704ee59b30
status: test
description: Detects the spawning of PowerShell or cmd.exe by Microsoft Word. This
  could be a sign of a malicious macro execution attempt.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.execution
- attack.t1204.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \WINWORD.EXE
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the spawning of PowerShell or cmd.exe by Microsoft Word. This
  could be a sign of a malicious macro execution attempt.'
