id: c450de23-0705-42e6-99f1-f87d5c2370b3
status: test
description: Detects suspicious PowerShell Add-Type commands
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: Add-Type
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious PowerShell Add-Type commands'
