id: c259cf74-f783-4e61-9c96-7f184ab1ebde
status: test
description: Detects the use of CrackMapExec or similar tool for lateral movement
  within the network
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \crackmapexec.exe
  - OriginalFileName: CrackMapExec.exe
  selection_cli:
    CommandLine|contains:
    - ' -smb2u '
    - ' -smb2p '
    - ' -smb2n '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of CrackMapExec or similar tool for lateral movement
  within the network'
