id: ea14feaa-0b50-4222-842d-febcd8210688
status: test
description: Detects the creation of a new Windows service
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains:
    - ' create '
    - ' config '
  selection_flags:
    CommandLine|contains:
    - ' binPath= '
    - ' type= '
    - ' start= '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a new Windows service'
