id: 3708767d-9fbc-4a58-854c-de43b5c88d09
status: test
description: Detects the use of an alternate command interpreter such as PowerShell
  version 2 or WScript. This could be used to evade modern logging.
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell_host.exe
    - \pwsh.exe
    - \wscript.exe
    - \mshta.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell_Host.EXE
    - pwsh.dll
    - wscript.exe
    - mshta.exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of an alternate command interpreter such as PowerShell
  version 2 or WScript. This could be used to evade modern logging.'
