id: f9d65640-d627-422f-9982-a1c11a7d79b2
status: test
description: Detects suspicious WMIC process call create
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1047
- attack.defense-evasion
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \wmic.exe
  selection_img:
  - Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - OriginalFileName:
    - Cmd.Exe
    - cscript.exe
    - mshta.exe
    - PowerShell.EXE
    - pwsh.dll
    - regsvr32.exe
    - RUNDLL32.EXE
    - wscript.exe
  selection_cli:
    CommandLine|contains: ' /call '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious WMIC process call create'
