id: f89a03eb-3411-4154-8297-373954a34bc8
status: test
description: Detects suspicious PowerShell IEX encoded commands
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains:
    - ' -EncodedCommand'
    - ' -w hidden -EncodedCommand'
    - ' -w 1 -EncodedCommand'
    - ' -w 2 -EncodedCommand'
    - ' -w 3 -EncodedCommand'
    - ' -w 4 -EncodedCommand'
    - ' -w 5 -EncodedCommand'
    - ' -w h -EncodedCommand'
  selection_iex:
    CommandLine|contains: IEX
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell IEX encoded commands'
