id: 51a75d1a-cfbe-4fdd-bb2e-3abeb01a7791
status: test
description: Detects PowerShell commands that disable Windows Defender
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: Set-MpPreference
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell commands that disable Windows Defender'
