id: 2d7f585b-5ec0-4e43-b49a-23562910ebb7
status: test
description: Detects the usage of bcdedit to disable security features
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bcdedit.exe
  - OriginalFileName: bcdedit.exe
  selection_cli:
    CommandLine|contains|all:
    - 'set '
    - bootstatuspolicy
    - ignoreallfailures
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the usage of bcdedit to disable security features'
