id: d2df1f1c-dfe3-4b80-8ad9-2def6c3b5dae
status: test
description: Detects the use of wevtutil to clear logs
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.defense-evasion
- attack.t1070
- attack.t1562
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wevtutil.exe
  - OriginalFileName: wevtutil.exe
  selection_cli:
    CommandLine|contains: ' clear-log'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of wevtutil to clear logs'
