id: 3d63e566-3c69-4f6b-9efc-0d2a9f8e0ca1
status: test
description: Detects PowerShell AMSI bypass via reflection
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains:
    - System.Management.Automation.Interpreter.Ast.CallSiteArray
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+1
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+2
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+3
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+4
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+5
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+6
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+7
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+8
    - System.Management.Automation.Interpreter.Ast.CallSiteArray+9
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell AMSI bypass via reflection'
