id: 1060890f-e89b-4343-bcb8-fe9d8e0f2965
status: test
description: Detects suspicious use of sc.exe used to create a service on a remote
  system for lateral movement
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - create
    - service
    CommandLine|contains:
    - '//displayname:'
    - '//description:'
    - '//binPath:'
    - //start=
  selection_remote:
    CommandLine|contains:
    - //computer=
    - //serviceobjname=
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of sc.exe used to create a service on a remote
  system for lateral movement'
