id: b0fb902c-8f5b-476d-9ce8-0c22a93acf15
status: test
description: Detects changes to event log retention or maximum size settings. This
  could be a potential attempt to tamper with logs.
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.defense-evasion
- attack.t1070
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wevtutil.exe
  - OriginalFileName: wevtutil.exe
  selection_cli:
    CommandLine|contains:
    - ' set-logfile '
    - ' cl '
  selection_flags:
    CommandLine|contains:
    - ' -maxsize '
    - ' -retention '
  condition: all of selection_*
falsepositives:
- Legitimate administration activities
level: medium
title: '[AUTO] Detects changes to event log retention or maximum size settings. This
  could be a potential attempt to tamper with logs.'
