id: 6227f1ef-af91-444d-9c0f-f66d1b517669
status: test
description: Detects suspicious wmic process call create remote execution
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1047
- attack.defense-evasion
- attack.t1202
- attack.lateral-movement
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - call
    - create
    - remote
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious wmic process call create remote execution'
