id: 4b069a6a-d4af-42ee-91fe-f9ff4552062c
status: test
description: Detects the creation of a new job using the "bitsadmin" utility with
  suspicious download/upload commands
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cli:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
  selection_download:
    CommandLine|contains:
    - http
    - https
  selection_upload:
    CommandLine|contains:
    - ftp
    - smb
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a new job using the "bitsadmin" utility with
  suspicious download/upload commands'
