id: 830575d5-5cc1-4b8f-a3a1-e6ce72af7ff2
status: test
description: Detects usage of sc.exe to create services for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - create
    - binPath=
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects usage of sc.exe to create services for persistence'
