id: 3915110d-ae98-4c6f-8c35-b16a80b79efd
status: test
description: Detects the creation of a Volume Shadow Copy by a non-backup process.
  This could be a sign of potential data theft preparation.
author: AutoGenerated
date: '2025-07-12'
modified: 2022-11-29
tags:
- attack.collection
- attack.t1003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \vssadmin.exe
    CommandLine|contains: ' create '
  filter_main_backup_tools:
    CommandLine|contains:
    - ' /BackupSet:'
    - ' /For:C:'
    - ' /For:D:'
    - ' /For:E:'
    - ' /For:F:'
    - ' /For:G:'
    - ' /For:H:'
    - ' /For:I:'
    - ' /For:J:'
    - ' /For:K:'
    - ' /For:L:'
    - ' /For:M:'
    - ' /For:N:'
    - ' /For:O:'
    - ' /For:P:'
    - ' /For:Q:'
    - ' /For:R:'
    - ' /For:S:'
    - ' /For:T:'
    - ' /For:U:'
    - ' /For:V:'
    - ' /For:W:'
    - ' /For:X:'
    - ' /For:Y:'
    - ' /For:Z:'
    - ' /For:1:'
    - ' /For:2:'
    - ' /For:3:'
    - ' /For:4:'
    - ' /For:5:'
    - ' /For:6:'
    - ' /For:7:'
    - ' /For:8:'
    - ' /For:9:'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a Volume Shadow Copy by a non-backup process.
  This could be a sign of potential data theft preparation.'
