id: 2e75c359-9d0a-48d2-9c5e-af40dfb370b1
status: test
description: Detects suspicious use of sc.exe to configure a service for persistence
  (service hijack attempt)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - config
    - binPath=
    - start=auto
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of sc.exe to configure a service for persistence
  (service hijack attempt)'
