id: 237cd536-6208-47bc-85db-ab1b0468d1d6
status: test
description: 'Detects the spawning of a script interpreter or shell process by PowerPoint.exe.

  This could be a sign of a malicious macro in a slideshow.

  '
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.execution
- attack.t1204.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: \POWERPNT.EXE
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the spawning of a script interpreter or shell process by PowerPoint.exe.

  This could be a sign of a malicious macro in a slideshow.'
