id: 5538e28b-e578-4779-9f4e-6449f9fe090c
status: test
description: Detects a system service that is normally disabled being enabled. This
  could be a sign of malicious activity or an unusual configuration change.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
    Image|endswith: \sc.exe
    CommandLine|contains: enable
  selection_service:
    CommandLine|contains:
    - Terminal Services - Remote
    - Terminal Services - Remote (Display Driver)
    - Terminal Services - Remote (RDP-Tcp)
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects a system service that is normally disabled being enabled. This
  could be a sign of malicious activity or an unusual configuration change.'
