id: 9f7ae75f-053f-4da4-ba9a-3161ec4053e0
status: test
description: Detects the use of sdbinst.exe to install application shim databases.
  This could be a sign of potential persistence or privilege escalation.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-19
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1546.007
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sdbinst.exe
  - OriginalFileName: sdbinst.exe
  selection_cli:
    CommandLine|contains: ' /install '
  filter_main_generic:
    ParentImage|endswith:
    - \AppVLP.exe
    - \AppVLP64.exe
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of sdbinst.exe to install application shim databases.
  This could be a sign of potential persistence or privilege escalation.'
