id: 3e26631b-c8d4-4bf0-8186-1264cb52ea4b
status: test
description: Detects a suspicious pattern of a process enumerating
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \find.exe
  - OriginalFileName: FIND.EXE
  selection_cli:
    CommandLine|contains|all:
    - ' /C '
    - findstr.exe
    - ' /R '
    - C:\Windows\
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects a suspicious pattern of a process enumerating'
