id: 165ebcd1-3bcc-476a-ab23-dbaef9211050
status: test
description: Detects suspicious schtasks.exe /create commands
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.execution
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains: ' /create '
  selection_susp_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  selection_susp_extensions:
    CommandLine|contains:
    - .hta
    - .ps1
    - .psm1
    - .vbe
    - .vbs
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious schtasks.exe /create commands'
