id: 5b098d43-fb90-4f0a-8103-772ba3ad6b13
status: test
description: Detects the execution of a program from the Recycle Bin path.
author: AutoGenerated
date: '2025-07-12'
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains: \Recycler Bin\
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of a program from the Recycle Bin path.'
