id: c61166bd-59f9-4036-950e-b3b282ddfeef
status: test
description: Detects suspicious usage of wevtutil for log clearing
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.defense-evasion
- attack.t1070
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wevtutil.exe
  - OriginalFileName: wevtutil.exe
  selection_cli:
    CommandLine|contains:
    - ' delete-'
    - ' cl'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of wevtutil for log clearing'
