id: f9a27c2d-b37c-435c-a5e0-278698c8c21c
status: test
description: Detects the execution of the "wmic.exe" utility with the "product" flag
  to query the "Windows Defender" product and disabling the real-time monitoring feature
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - product
    - Windows Defender
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of the "wmic.exe" utility with the "product"
  flag to query the "Windows Defender" product and disabling the real-time monitoring
  feature'
