id: e469e3b4-6f50-4cd6-b61e-3a3c110cdb82
status: test
description: 'Detects the use of the "netsh" utility to disable the Windows Defender
  or firewall services.

  Adversaries may attempt to disable security services in order to evade detection.

  '
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli:
    CommandLine|contains|all:
    - firewall
    - show
    - rule
    - name=Windows Defender Firewall
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "netsh" utility to disable the Windows Defender
  or firewall services.

  Adversaries may attempt to disable security services in order to evade detection.'
