id: 2dfb0067-8fb7-45c0-b964-88508f809cce
status: test
description: Detects suspicious PowerShell command modifying Defender preferences
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - Set-MpPreference
    - -DisableAntiSpyware
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell command modifying Defender preferences'
