id: e81e177c-0562-4eac-9193-64bb25f4f0f0
status: test
description: Detects the use of the "net localgroup" command to add users to the "Administrators"
  group.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.privilege-escalation
- attack.t1078.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - localgroup
    - administrators
    - /add
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "net localgroup" command to add users to the
  "Administrators" group.'
