id: b829ebb8-5360-4c3a-93bb-4d1e17a2b0ff
status: test
description: Detects the use of the "sc.exe" utility to stop or disable security related
  services such as Windows Defender or Windows Firewall
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains:
    - ' stop '
    - ' pause '
    - 'config '
    - 'query config '
  selection_service:
    CommandLine|contains:
    - ' Windows Defender Firewall'
    - ' Windows Defender'
    - ' Windows Firewall'
    - ' antivirus'
    - ' antimalware'
    - ' antispyware'
    - ' defender'
    - ' firewall'
    - ' mpsvc'
    - ' nisvc'
    - ' wdefend'
    - ' wdfilter'
    - ' wdproxy'
    - ' wdscan'
    - ' wdwin'
    - ' WinDefend'
    - ' WinFirewall'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of the "sc.exe" utility to stop or disable security
  related services such as Windows Defender or Windows Firewall'
