id: 3293e7d3-aa8c-45fa-adc4-f81ca70af032
status: test
description: Detects suspicious usage of wmic process call create for remote execution
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - call
    - create
  filter_main_generic:
    CommandLine|contains:
    - ' CREATE PROCESS '
    - ' CREATE PROCESS:WIN32_'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of wmic process call create for remote execution'
