id: c172a4b2-a7f3-41a1-8c98-228a4cdebd96
status: test
description: Detects suspicious usage of sc.exe to create services for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2021-11-27
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains:
    - create
    - config
  selection_service_name:
    CommandLine|contains:
    - svc
    - service
  selection_service_path:
    CommandLine|contains:
    - C:\Windows\Temp\
    - C:\Perflogs\
    - C:\Users\Public\
    - C:\Users\All Users\
    - C:\Users\Default\
    - C:\Users\Contacts\
    - C:\Users\Favorites\
    - C:\Users\Start Menu\
    - C:\Users\Searches\
    - C:\Users\Templates\
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of sc.exe to create services for persistence'
