id: f929e863-f5e9-4336-81cc-1f3a17f6caa6
status: test
description: Detects suspicious usage of mshta.exe for LOLBins execution
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mshta.exe
  - OriginalFileName: MSHTA.EXE
  selection_cli:
    CommandLine|contains:
    - file:///
    - http://
    - https://
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of mshta.exe for LOLBins execution'
