id: ac48c073-3895-4aab-af9c-bbe264bc8639
status: test
description: Detects suspicious PowerShell command disabling Defender features
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: Set-MpPreference
  selection_flags:
    CommandLine|contains:
    - DisableAntiSpyware
    - DisableRealtimeMonitoring
    - DisableVirusScanning
    - DisableWindowsDefender
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell command disabling Defender features'
