id: b4d47ec5-368c-41d9-a817-4c012bb49216
status: test
description: Detects the execution of "bitsadmin" with suspicious download commands
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1197
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cli:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
  selection_http:
    CommandLine|contains:
    - http
    - https
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of "bitsadmin" with suspicious download commands'
