id: 542f564e-7576-4b0e-a383-389a07c14e15
status: test
description: Detects suspicious reg.exe commands modifying Run registry keys
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_cli:
    CommandLine|contains: add
  selection_key:
    CommandLine|contains:
    - HKCU\Software\Microsoft\Windows\CurrentVersion\Run
    - HKCU\Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious reg.exe commands modifying Run registry keys'
