id: af7d7d4c-4a7b-4d90-af70-9f9001d103fc
status: test
description: Detects the use of the "net localgroup" command to add users to the administrators
  group.
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.execution
- attack.t1059.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \net.exe
  - OriginalFileName: net.exe
  selection_cli:
    CommandLine|contains|all:
    - localgroup
    - administrators
    - add
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "net localgroup" command to add users to the
  administrators group.'
