id: 31e7a3e9-4772-4f1d-b5ee-c7f32451b178
status: test
description: Detects the execution of "SharpLDAP.dll" with suspicious command line
  flags
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.discovery
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains: SharpLDAP.dll
  filter_main_generic:
    CommandLine|contains:
    - ' -Server '
    - ' -UserName '
    - ' -Password '
    - ' -Port '
    - ' -Encryption '
    - ' -Trust '
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of "SharpLDAP.dll" with suspicious command line
  flags'
