id: b5b9b11f-395f-4e05-bc04-0ef023405009
status: test
description: Detects suspicious usage of sdelete64.exe for secure deletion
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1070
- attack.t1027
- attack.s0006
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sdelete64.exe
  - OriginalFileName: sdelete.exe
  selection_cli:
    CommandLine|contains:
    - ' -z '
    - ' -c '
    - ' -p '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of sdelete64.exe for secure deletion'
