id: 2c8609c3-06f6-4db7-ad29-bacc3301edbd
status: test
description: Detects suspicious use of PowerShell PSReflect to call Win32 APIs
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \powershell.exe
  - OriginalFileName: PowerShell.EXE
  selection_cli:
    CommandLine|contains|all:
    - '::'
    - kernel32
    - CreateRemoteThread
    - VirtualAlloc
    - VirtualProtect
    - WriteProcessMemory
    - CreateThread
    - CloseHandle
    - GetModuleHandle
    - GetProcAddress
    - CreateThread
    - GetThreadHandle
    - GetThreadContext
    - SetThreadContext
    - VirtualFree
    - ExitProcess
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of PowerShell PSReflect to call Win32 APIs'
