id: c867f672-f264-4bce-81b6-cba684b9032b
status: test
description: Detects the use of netdom.exe to enumerate domain trusts
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netdom.exe
  - OriginalFileName: netdom.exe
  selection_cli:
    CommandLine|contains|all:
    - trust
    - query
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of netdom.exe to enumerate domain trusts'
