id: 0ae65045-9c78-4bc4-82d9-7d5380f4f988
status: test
description: Detects suspicious use of sc.exe to create services with SYSTEM privileges
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.execution
- attack.t1569.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - create
    - binPath
    - SYSTEM
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of sc.exe to create services with SYSTEM privileges'
