id: 304a5da3-df4c-4800-be3e-233733a1bd4d
status: test
description: Detects the execution of "adidnsdump" with suspicious subdomain patterns.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.discovery
- attack.t1012
- attack.t1087.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \adidnsdump.exe
  - OriginalFileName: adidnsdump.exe
  selection_cli:
    CommandLine|contains:
    - ' -s '
    - ' -t '
  selection_subdomain:
    CommandLine|contains:
    - .localdomain
    - .test
    - .com
    - .org
    - .net
    - .edu
    - .gov
    - .mil
    - .int
    - .info
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of "adidnsdump" with suspicious subdomain patterns.'
