id: 73ccaf21-c0a7-4bcf-bb5a-16d45eb51d2b
status: test
description: Detects suspicious use of PowerShell for SID history injection
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1003.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - Get-ADObject
    - Get-ADReplicationGroupMember
    - Get-ADReplicationGroupMember -Filter *
    - Get-ADReplicationGroupMember -Properties *
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of PowerShell for SID history injection'
