id: 7734eea0-508a-43a8-8777-527c78bfa3c2
status: test
description: Detects suspicious usage of PowerShell DownloadString for fileless execution
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: DownloadString
  selection_web:
    CommandLine|contains:
    - http
    - https
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of PowerShell DownloadString for fileless
  execution'
