id: 70a79fd0-c8d4-46ee-9528-2e2579e3632d
status: test
description: Detects suspicious use of msiexec to install unsigned MSI with elevated
  privileges
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: msiexec.exe
  selection_cli:
    CommandLine|contains|all:
    - ' /i '
    - ' /qn '
  selection_signed:
    CommandLine|contains: ' /qn'
  filter_main_signed:
    CommandLine|contains:
    - ' /norestart '
    - ' /quiet '
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of msiexec to install unsigned MSI with elevated
  privileges'
