id: c17db34e-04fc-41b6-a7c7-a0130324456e
status: test
description: Detects suspicious use of cscript with encoded VBScript for execution
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1140
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cscript.exe
  - OriginalFileName: cscript.exe
  selection_cli:
    CommandLine|contains: vbscript:Encode
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of cscript with encoded VBScript for execution'
