id: bbfb6ed0-054f-4d19-979c-6ebf2f52a568
status: test
description: Detects suspicious use of rundll32 to load Control_RunDLL exported functions
author: AutoGenerated
date: '2025-07-10'
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains: Control_RunDLL
  filter_main_generic:
    CommandLine|contains:
    - :\Program Files (x86)\
    - :\Program Files\
    - :\Windows\System32\
    - :\Windows\SysWOW64\
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of rundll32 to load Control_RunDLL exported
  functions'
