id: a1f60eb9-fc3a-4200-8e08-8e5d57c0b18b
status: test
description: Detects suspicious usage of Mimikatz kerberos::list for ticket enumeration
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.credential-access
- attack.t1057.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mimikatz.exe
  - OriginalFileName: mimikatz.exe
  selection_cli:
    CommandLine|contains|all:
    - kerberos::list
    - dcsync
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of Mimikatz kerberos::list for ticket enumeration'
