id: da006f3c-1f57-4ec6-8611-5eaf6dbb88ed
status: test
description: Detects usage of sc.exe to query service configurations. This technique
  was used by threat actors to get information about existing services and their configurations.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.discovery
- attack.t1082
- attack.t1087.001
- attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains: ' qc '
  filter_main_generic:
    CommandLine|contains:
    - ' -d '
    - ' -f '
    - ' -t '
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects usage of sc.exe to query service configurations. This technique
  was used by threat actors to get information about existing services and their configurations.'
