id: b9c2b28f-e5ac-48b2-9edd-6cc3bbf639ad
status: test
description: Detects the execution of secedit with the "export" flag. This can be
  used to extract security policies from the registry.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \secedit.exe
  - OriginalFileName: secedit.exe
  selection_cli:
    CommandLine|contains: ' /export'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of secedit with the "export" flag. This can be
  used to extract security policies from the registry.'
