id: 8962a6aa-f176-495a-a8ca-72d0253bdec6
status: test
description: Detects usage of sc.exe to delete security services
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - delete
    - Security
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects usage of sc.exe to delete security services'
