{
  "rule_id": "8384bd26-bde6-4da9-8e5d-4174a7a47ca2",
  "risk_score": 73,
  "description": "Detects DNS resolution of an .onion address related to Tor routing networks",
  "name": "Query Tor Onion Address - DNS Client",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Microsoft\\-Windows\\-DNS\\ Client\\ Events\\/Operational AND (event.code:3008 AND dns.question.name:*.onion*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1090.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}