id: defde1bd-e5d4-43bf-a5f2-7465103217e8
status: test
description: Detects modification of the registry RunOnce key
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects modification of the registry RunOnce key'
