tag: attack.persistence
tactics:
- persistence
- defense_evasion
- execution
- attack.t1574.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_DLLs
  condition: selection
falsepositives:
- Unknown
level: high
id: d4890aa6-c46c-4dcd-b0ab-7e73c412fca2
author: AutoGenerated
date: '2025-07-10'
title: '[AUTO] User: Generate a detection rule for Detect persistence via AppInit_DLLs
  registry.'
status: experimental
description: 'User: Generate a detection rule for Detect persistence via AppInit_DLLs
  registry.'
tags: []
