tag:
- attack.persistence
- attack.t1546.001
date: '2025-07-10'
modified: 2023-02-04
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_DLLs
  condition: selection
falsepositives:
- Unknown
level: high
id: 88bc0f93-0835-4657-9b8b-82ed982a9bc7
author: AutoGenerated
title: '[AUTO] Detect persistence via AppInit_DLLs registry'
status: experimental
description: Detect persistence via AppInit_DLLs registry
tags: []
