id: 37029811-6981-4c80-80d7-5900254c5513
status: test
description: Detects the creation of a new value in the "Run" key by a non-system
  process
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Run
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    Details|contains:
    - (New-Object Net.WebClient).DownloadString
    - (New-Object System.Net.WebClient).DownloadString
    - (New-Object System.Net.WebClient).DownloadFile
    - (New-Object System.Net.WebClient).DownloadFile
    - Invoke-WebRequest
    - Invoke-Expression
    - Invoke-Command
    - IEX
    - regsvr32
    - rundll32
    - mshta
    - cscript
    - wscript
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a new value in the "Run" key by a non-system
  process'
