id: 7d0ee60c-2242-489c-80dc-4dd77d561132
status: test
description: Detects the addition of an Image File Execution Options debugger for
  a system binary
author: AutoGenerated
date: '2025-07-12'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Windows NT\CurrentVersion\Image File Execution
      Options\
    TargetObject|endswith:
    - \lsass.exe
    - \winlogon.exe
    - \csrss.exe
    - \services.exe
    - \smss.exe
    - \wininit.exe
    - \spoolsv.exe
    - \lsass.exe.debugger
    - \winlogon.exe.debugger
    - \csrss.exe.debugger
    - \services.exe.debugger
    - \smss.exe.debugger
    - \wininit.exe.debugger
    - \spoolsv.exe.debugger
    Details|contains:
    - ' -g'
    - ' -u'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the addition of an Image File Execution Options debugger for
  a system binary'
