id: a7a65e64-afc2-419c-b562-c0a4c846a0d0
status: test
description: Detects the creation of autostart run key
author: AutoGenerated
date: '2025-07-13'
modified: 2022-08-23
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Run
  condition: selection
falsepositives:
- Legitimate software installing itself via the Run key
level: medium
title: '[AUTO] Detects the creation of autostart run key'
