id: 5a9d8914-61a6-44d2-8e45-26e7373b6ffb
status: test
description: Detects the modification of the Windows Defender service to disable it
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Microsoft\Windows Defender\Exclusions
    TargetObject|endswith: \Windows Defender
    Details: DWORD (0x00000000)
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the modification of the Windows Defender service to disable
  it'
