id: 19647e7f-ca15-4141-8e9f-08248e57f9bc
status: test
description: 'Detects the creation of a new LSA authentication package registry entry.

  This technique is used by credential access tools such as Mimikatz, PsExec, and
  Cobalt Strike.

  '
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1003.002
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Security\Lsa\Authentication Packages\
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a new LSA authentication package registry entry.

  This technique is used by credential access tools such as Mimikatz, PsExec, and
  Cobalt Strike.'
