id: ef005d72-1214-4b79-9b57-d9edc202d5e0
status: test
description: Detects enabling of remote desktop via registry
author: AutoGenerated
date: '2025-07-13'
modified: 2022-12-25
tags:
- attack.lateral-movement
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Control\Terminal Server\WinStations\RDP-Tcp
    TargetObject|endswith: UserAuthentication
    Details: DWORD (0x00000001)
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects enabling of remote desktop via registry'
