id: a46c7c4f-754e-48fa-a3cc-88629c5b2f33
status: test
description: Detects UAC Protection Disabled via Registry (Defense Evasion)
author: AutoGenerated
date: '2025-07-13'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
    Details: DWORD (0x00000000)
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects UAC Protection Disabled via Registry (Defense Evasion)'
