id: ecdc999f-124d-4798-974e-3e85a9869bdd
status: test
description: Detects registry or policy changes enabling Remote Desktop on a workstation
  (potential unauthorized remote access setup)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.lateral-movement
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection_1:
    TargetObject|contains: \System\CurrentControlSet\Control\Terminal Server
    TargetObject|endswith: fEnableTerminalServices
    Details: DWORD (0x00000001)
  selection_2:
    TargetObject|contains: \Policies\System\TerminalServer
    TargetObject|endswith: fEnableTerminalServices
    Details: DWORD (0x00000001)
  condition: 1 of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects registry or policy changes enabling Remote Desktop on a workstation
  (potential unauthorized remote access setup)'
