id: 8f7d16c9-5702-43b6-bd4d-6932a58faf2b
status: test
description: Detects Windows Safe Mode persistence techniques
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  selection_1:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList
    Details: DWORD (0x00000001)
  selection_2:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Service
    Details: DWORD (0x00000001)
  selection_3:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Service
    Details: DWORD (0x00000002)
  selection_4:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Service
    Details: DWORD (0x00000003)
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects Windows Safe Mode persistence techniques'
