id: c663ce74-0854-4333-a1c8-a73705b50215
status: test
description: 'Detects changes to registry or group policy that enable the insecure
  SMBv1 protocol.

  This could be an attempt to exploit the legacy protocol, which is known to be vulnerable
  to attacks such as WannaCry.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: registry_set
  product: windows
detection:
  selection_smb1:
    TargetObject|contains: \Services\LanmanWorkstation\Parameters\SMB1
    Details: DWORD (0x00000001)
  selection_gpo_smb1:
    TargetObject|contains: \Computer Configuration\Administrative Templates\System\SMB\SMB1
      Protocol
    TargetObject|endswith: Enabled
    Details: DWORD (0x00000001)
  selection_gpo_smb2:
    TargetObject|contains: \Computer Configuration\Administrative Templates\System\SMB\SMB2
      Protocol
    TargetObject|endswith: Enabled
    Details: DWORD (0x00000001)
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects changes to registry or group policy that enable the insecure
  SMBv1 protocol.

  This could be an attempt to exploit the legacy protocol, which is known to be vulnerable
  to attacks such as WannaCry.'
