logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\Shell
  filter:
    Image|endswith: \winlogon.exe
  condition: selection and not filter
falsepositives:
- Unknown
level: high
id: 212a96ed-73b2-4e76-9062-f1225ded007c
author: AutoGenerated
date: '2025-07-10'
title: '[AUTO] Detect suspicious modification of Winlogon Shell registry key'
status: experimental
description: Detect suspicious modification of Winlogon Shell registry key
tags: []
