id: 4368e2c9-023a-43bb-b7ec-1cf1f9b885fa
status: test
description: 'Detects the modification of the "C:\Windows\System32\control.exe" registry
  value in order to change the path of the screensaver executable.

  This technique is used by attackers in order to set a backdoor that is executed
  every time the user logs off.

  The backdoor is a DLL that is loaded by "control.exe" and is executed every time
  the user logs off.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2024-03-13
tags:
- attack.persistence
- attack.t1546.011
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \Control Panel\Desktop
    TargetObject|endswith: \ScreenSaveTimeOut
    Details: '0'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the modification of the "C:\Windows\System32\control.exe" registry
  value in order to change the path of the screensaver executable.

  This technique is used by attackers in order to set a backdoor that is executed
  every time the user logs off.

  The backdoor is a DLL that is loaded by "control.exe" and is executed every time
  the user logs off.'
