id: 52e2f08b-27d4-45ce-a488-ddac86b3d4d8
status: test
description: Detects the modification of the "AlwaysInstallElevated" registry value
  by a suspicious process
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Policies\Microsoft\Windows\Installer\AlwaysInstallElevated
    Details: DWORD (0x00000001)
  filter_main_generic:
    Image|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  filter_optional_msmpeng:
    Image|endswith: \MsMpEng.exe
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the modification of the "AlwaysInstallElevated" registry value
  by a suspicious process'
