{
  "rule_id": "e5b33f7d-eb93-48b6-9851-09e1e610b6d7",
  "risk_score": 73,
  "description": "Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up.",
  "name": "Credential Dumping Attempt Via WerFault",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.GrantedAccess:0x1FFFFF AND process.executable:*\\\\WerFault.exe AND winlog.event_data.TargetImage:*\\\\lsass.exe",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001",
    "attack.s0002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Actual failures in lsass.exe that trigger a crash dump (unlikely)",
    "Unknown cases in which WerFault accesses lsass.exe"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}