{
  "rule_id": "174afcfa-6e40-4ae9-af64-496546389294",
  "risk_score": 73,
  "description": "Detects when a process tries to access the memory of svchost to potentially dump credentials.",
  "name": "Credential Dumping Attempt Via Svchost",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(winlog.event_data.GrantedAccess:0x143a AND winlog.event_data.TargetImage:*\\\\svchost.exe) AND (NOT (process.executable:(*\\\\services.exe OR *\\\\msiexec.exe)))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1548"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florent Labouyrie"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}