id: 05b9687a-88d4-4969-b836-e7537c89f780
status: test
description: Detects process acquiring debug privileges for unauthorized code injection
  (SeDebugPrivilege abuse)
author: AutoGenerated
date: '2025-07-12'
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
- attack.t1548.002
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith:
    - \lsass.exe
    - \winlogon.exe
    - \csrss.exe
    - \services.exe
    - \smss.exe
    - \spoolsv.exe
    - \svchost.exe
    - \wininit.exe
    - \wermgr.exe
    - \wuauclt.exe
    GrantedAccess: '0x1410'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects process acquiring debug privileges for unauthorized code injection
  (SeDebugPrivilege abuse)'
