id: 6f7b7bae-1d94-4f49-bb35-e0c5acba911e
status: test
description: Detects unauthorized process access to lsass.exe
author: AutoGenerated
date: '2025-07-13'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    GrantedAccess|endswith:
    - '0x14D0'
    - '0x14D8'
    - '0x14D9'
    - '0x14DA'
    - '0x14DB'
    - '0x14DC'
    - '0x14DD'
    - '0x14DE'
    - '0x14DF'
    - '0x14E0'
    - '0x14E1'
    - '0x14E2'
    - '0x14E3'
    - '0x14E4'
    - '0x14E5'
    - '0x14E6'
    - '0x14E7'
    - '0x14E8'
    - '0x14E9'
    - '0x14EA'
    - '0x14EB'
    - '0x14EC'
    - '0x14ED'
    - '0x14EE'
    - '0x14EF'
    - '0x14F0'
    - '0x14F1'
    - '0x14F2'
    - '0x14F3'
    - '0x14F4'
    - '0x14F5'
    - '0x14F6'
    - '0x14F7'
    - '0x14F8'
    - '0x14F9'
    - '0x14FA'
    - '0x14FB'
    - '0x14FC'
    - '0x14FD'
    - '0x14FE'
    - '0x14FF'
    SourceImage|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects unauthorized process access to lsass.exe'
