id: d4bde17f-c257-43f2-8de7-4213fe81c5ac
status: test
description: Detects usage of WriteProcessMemory and CreateRemoteThread APIs for code
  injection into web browser process
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1055
- attack.execution
- attack.t1204.002
logsource:
  category: process_access
  product: windows
detection:
  selection_target:
    TargetImage|endswith:
    - \brave.exe
    - \chrome.exe
    - \firefox.exe
    - \iexplore.exe
    - \maxthon.exe
    - \msedge.exe
    - \opera.exe
    - \safari.exe
    - \vivaldi.exe
  selection_source:
    SourceImage|endswith: \explorer.exe
  selection_apis:
  - CallTrace|contains:
    - kernel32.dll
    - kernelbase.dll
  - GrantedAccess|contains:
    - '0x1000'
    - '0x1400'
    - '0x1800'
    - '0x10000'
    - '0x14000'
    - '0x18000'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects usage of WriteProcessMemory and CreateRemoteThread APIs for
  code injection into web browser process'
