id: 9d60c29e-0726-4b83-b07b-541177c79bf5
status: test
description: Detects attempts to access protected processes (PPL Bypass)
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-09
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith:
    - \lsass.exe
    - \winlogon.exe
    - \csrss.exe
    - \services.exe
    - \wermgr.exe
    - \wininit.exe
    - \smss.exe
    - \lsass.exe
    - \csrss.exe
    - \services.exe
    - \wermgr.exe
    - \wininit.exe
    - \smss.exe
    - \winlogon.exe
    GrantedAccess: '0x1410'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects attempts to access protected processes (PPL Bypass)'
