id: f39af842-2919-407f-9a66-1919645be948
status: test
description: Detects the termination of critical system processes
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-16
tags:
- attack.impact
- attack.t1489
logsource:
  category: process_access
  product: windows
detection:
  selection:
    SourceImage|endswith:
    - \lsass.exe
    - \samd.exe
    - \samr.exe
    - \security.exe
    - \svchost.exe
    - \winlogon.exe
  filter_main_svchost:
    TargetImage|endswith: \svchost.exe
  filter_main_samr:
    TargetImage|endswith: \samr.exe
  filter_main_samd:
    TargetImage|endswith: \samd.exe
  filter_main_lsass:
    TargetImage|endswith: \lsass.exe
  filter_main_winlogon:
    TargetImage|endswith: \winlogon.exe
  filter_main_security:
    TargetImage|endswith: \security.exe
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the termination of critical system processes'
