id: f77d0868-7249-4284-9616-2703d80a3ebe
status: test
description: Detects suspicious usage of SeBackupPrivilege for credential extraction
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    CallTrace|contains: kernel32.dll
    CallTrace|endswith: RpcImpersonateClient
    GrantedAccess: '0x1410'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of SeBackupPrivilege for credential extraction'
