{
  "rule_id": "460479f3-80b7-42da-9c43-2cc1d54dbccd",
  "risk_score": 73,
  "description": "Sysmon registry detection of a local hidden user account.",
  "name": "Creation of a Local Hidden User Account by Registry",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\lsass.exe AND registry.path:*\\\\SAM\\\\SAM\\\\Domains\\\\Account\\\\Users\\\\Names\\\\* AND registry.path:*$",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1136.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christian Burkard (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}