{
  "rule_id": "eeb30123-9fbd-4ee8-aaa0-2e545bbed6dc",
  "risk_score": 73,
  "description": "Detects the addition of a SSP to the registry. Upon a reboot or API call, SSP DLLs gain access to encrypted and plaintext passwords stored in Windows.\n",
  "name": "Security Support Provider (SSP) Added to LSA Configuration",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(registry.path:(*\\\\Control\\\\Lsa\\\\Security\\ Packages OR *\\\\Control\\\\Lsa\\\\OSConfig\\\\Security\\ Packages)) AND (NOT (process.executable:(C\\:\\\\Windows\\\\system32\\\\msiexec.exe OR C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe)))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547.005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "iwillkeepwatch"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}