{
  "rule_id": "b98968aa-dbc0-4a9c-ac35-108363cbf8d5",
  "risk_score": 73,
  "description": "Detects potential malicious modification of run keys by winekey or team9 backdoor",
  "name": "WINEKEY Registry Modification",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Backup\\ Mgr",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "omkar72"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}