{
  "rule_id": "55e29995-75e7-451a-bef0-6225e2f13597",
  "risk_score": 99,
  "description": "Detects changes to the Registry in which a monitor program gets registered to dump the memory of the lsass.exe process",
  "name": "Potential Credential Dumping Via LSASS SilentProcessExit Technique",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit\\\\lsass.exe*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}