{
  "rule_id": "a6b33c02-8305-488f-8585-03cb2a7763f2",
  "risk_score": 99,
  "description": "Detects the use of Windows Credential Editor (WCE)",
  "name": "Windows Credential Editor Registry",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "registry.path:*Services\\\\WCESERVICE\\\\Start*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001",
    "attack.s0005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}