id: e3a88022-85df-4d92-94ef-3b24f9c42dae
status: test
description: Detects SMB connections to admin shares followed by service creation
  or file writes
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-03
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationHostname|endswith: \ADMIN$
    Initiated: 'true'
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
    - \wsl.exe
    DestinationPort:
    - 135
    - 139
    - 445
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects SMB connections to admin shares followed by service creation
  or file writes'
