id: 1a1ec34d-53fc-4336-8178-3f9fe7413522
status: test
description: Detects multiple sequential connections to a single port. This could
  be a sign of port scanning activity.
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-09
tags:
- attack.discovery
- attack.t1046
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationPort:
    - 135
    - 139
    - 1433
    - 3389
    - 5985
    - 5986
  filter_main_local_ranges:
    DestinationIp:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fec0::/10
    - fd00::/8
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects multiple sequential connections to a single port. This could
  be a sign of port scanning activity.'
