id: 0e3f3b71-52a7-4632-b712-f25ac5c5eafe
status: test
description: Detects outbound connections to domains with dynamic DNS names.
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-04
tags:
- attack.command-and-control
- attack.t1071.001
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|re: ^[a-zA-Z0-9]{1,32}\.ddns\.net$
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects outbound connections to domains with dynamic DNS names.'
