id: a2fcf427-8e9a-4362-b320-41f479c1c922
status: test
description: Detects the presence of Imminent Monitor Remote Access Trojan on a system
  (unauthorized remote control)
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.command-and-control
- attack.t1219.002
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationPort: 1000
    DestinationIp: 127.0.0.1
  condition: selection
falsepositives:
- Unlikely
level: high
title: '[AUTO] Detects the presence of Imminent Monitor Remote Access Trojan on a
  system (unauthorized remote control)'
