id: e09cb075-f30d-420b-8a30-59868f8f67c2
status: test
description: Detects a process sending an unusually large volume of data to an external
  network location (possible data exfiltration)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.exfiltration
- attack.t1048
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationPort:
    - 80
    - 443
    Image|endswith:
    - \mshta.exe
    - \msiexec.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
    - \wsl.exe
    DestinationHostname|endswith:
    - .com
    - .net
    - .org
    - .ru
    - .uk
    - .us
    DestinationFilename|endswith:
    - .aspx
    - .asp
    - .php
    - .jsp
    - .hta
    - .htm
    - .html
    - .txt
    - .csv
    - .xls
    - .xlsx
    - .doc
    - .docx
    - .pdf
    - .zip
    - .rar
    - .7z
  filter_main_legit_extensions:
    DestinationFilename|endswith:
    - .jpg
    - .jpeg
    - .png
    - .gif
    - .mp3
    - .mp4
    - .avi
    - .mov
    - .wmv
    - .mp4
    - .mpg
    - .docx
    - .xlsx
    - .pdf
    - .zip
    - .rar
    - .7z
    - .exe
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects a process sending an unusually large volume of data to an external
  network location (possible data exfiltration)'
