{
  "rule_id": "c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9",
  "risk_score": 73,
  "description": "Detects a ProcessHacker tool that elevated privileges to a very high level",
  "name": "ProcessHacker Privilege Elevation",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:System AND (user.name:LocalSystem AND event.code:7045 AND winlog.provider_name:Service\\ Control\\ Manager AND winlog.event_data.ServiceName:ProcessHacker*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.privilege-escalation",
    "attack.t1543.003",
    "attack.t1569.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}