{
  "rule_id": "72862bf2-0eb1-11eb-adc1-0242ac120002",
  "risk_score": 73,
  "description": "Detects Obfuscated use of stdin to execute PowerShell",
  "name": "Invoke-Obfuscation STDIN+ Launcher - System",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:System AND ((event.code:7045 AND (winlog.event_data.ImagePath:(*\\/c* OR *\\/r*)) AND (winlog.event_data.ImagePath:*cmd* AND winlog.event_data.ImagePath:*powershell*) AND winlog.provider_name:Service\\ Control\\ Manager) AND (winlog.event_data.ImagePath:*noexit* OR (winlog.event_data.ImagePath:*input* AND winlog.event_data.ImagePath:*$*)))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1027",
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Jonathan Cheong, oscd.community"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}