{
  "rule_id": "1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b",
  "risk_score": 47,
  "description": "Detects DNS query requests to Devtunnels domains. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.\n",
  "name": "DNS Query To Devtunnels Domain",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "dns.question.name:*.devtunnels.ms",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1071.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "citron_ninja"
  ],
  "false_positives": [
    "Legitimate use of Devtunnels will also trigger this."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}