id: 59de7329-488b-46e8-89da-6d625088a801
status: test
description: Detects a ping sweep originating from a host (multiple sequential ICMP
  requests indicative of network scanning)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-03
tags:
- attack.discovery
- attack.t1046
- attack.t1046.001
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Protocol: ICMP
    SourceIp|expand: '%allowed_ips%'
  filter_main_local_computer_name:
    DestinationIp|expand: '%local_computer_ip%'
    DestinationPort: 127
    DestinationHostname|expand: '%local_computer_name%'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects a ping sweep originating from a host (multiple sequential ICMP
  requests indicative of network scanning)'
