id: 4e46c18e-8475-46a7-b0e1-c775eea52e39
status: test
description: Detects a file being copied to a remote host's ADMIN$ share by an unusual
  account (possible malware deployment via SMB)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.lateral-movement
- attack.t1021.002
- attack.t1021.003
- attack.t1021.004
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationHostname|endswith: \ADMIN$
    Initiated: 'true'
    AccountName:
    - ANONYMOUS LOGON
    - SYSTEM
    - Third Party
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects a file being copied to a remote host''s ADMIN$ share by an
  unusual account (possible malware deployment via SMB)'
