{
  "rule_id": "75e33ce3-ae32-4dcc-9aa8-a2a3029d6f84",
  "risk_score": 47,
  "description": "Detects an office application (Word, Excel, PowerPoint)  that initiate a network connection to a non-private IP addresses.\nThis rule aims to detect traffic similar to one seen exploited in CVE-2021-42292.\nThis rule will require an initial baseline and tuning that is specific to your organization.\n",
  "name": "Office Application Initiated Network Connection To Non-Local IP",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "((process.executable:(*\\\\excel.exe OR *\\\\outlook.exe OR *\\\\powerpnt.exe OR *\\\\winword.exe OR *\\\\wordview.exe)) AND network.direction:true) AND (NOT ((destination.ip:127.0.0.0\\/8 OR destination.ip:10.0.0.0\\/8 OR destination.ip:172.16.0.0\\/12 OR destination.ip:192.168.0.0\\/16 OR destination.ip:169.254.0.0\\/16 OR destination.ip:\\:\\:1\\/128 OR destination.ip:fe80\\:\\:\\/10 OR destination.ip:fc00\\:\\:\\/7) OR ((destination.ip:13.107.6.152\\/31 OR destination.ip:13.107.18.10\\/31 OR destination.ip:13.107.128.0\\/22 OR destination.ip:23.103.160.0\\/20 OR destination.ip:40.96.0.0\\/13 OR destination.ip:40.104.0.0\\/15 OR destination.ip:52.96.0.0\\/14 OR destination.ip:131.253.33.215\\/32 OR destination.ip:132.245.0.0\\/16 OR destination.ip:150.171.32.0\\/22 OR destination.ip:204.79.197.215\\/32 OR destination.ip:2603\\:1006\\:\\:\\/40 OR destination.ip:2603\\:1016\\:\\:\\/36 OR destination.ip:2603\\:1026\\:\\:\\/36 OR destination.ip:2603\\:1036\\:\\:\\/36 OR destination.ip:2603\\:1046\\:\\:\\/36 OR destination.ip:2603\\:1056\\:\\:\\/36 OR destination.ip:2620\\:1ec\\:4\\:\\:152\\/128 OR destination.ip:2620\\:1ec\\:4\\:\\:153\\/128 OR destination.ip:2620\\:1ec\\:c\\:\\:10\\/128 OR destination.ip:2620\\:1ec\\:c\\:\\:11\\/128 OR destination.ip:2620\\:1ec\\:d\\:\\:10\\/128 OR destination.ip:2620\\:1ec\\:d\\:\\:11\\/128 OR destination.ip:2620\\:1ec\\:8f0\\:\\:\\/46 OR destination.ip:2620\\:1ec\\:900\\:\\:\\/46 OR destination.ip:2620\\:1ec\\:a92\\:\\:152\\/128 OR destination.ip:2620\\:1ec\\:a92\\:\\:153\\/128) AND (destination.port:(80 OR 443))) OR ((destination.ip:13.107.6.152\\/31 OR destination.ip:13.107.18.10\\/31 OR destination.ip:13.107.128.0\\/22 OR destination.ip:23.103.160.0\\/20 OR destination.ip:40.96.0.0\\/13 OR destination.ip:40.104.0.0\\/15 OR destination.ip:52.96.0.0\\/14 OR destination.ip:131.253.33.215\\/32 OR destination.ip:132.245.0.0\\/16 OR destination.ip:150.171.32.0\\/22 OR destination.ip:204.79.197.215\\/32 OR destination.ip:2603\\:1006\\:\\:\\/40 OR destination.ip:2603\\:1016\\:\\:\\/36 OR destination.ip:2603\\:1026\\:\\:\\/36 OR destination.ip:2603\\:1036\\:\\:\\/36 OR destination.ip:2603\\:1046\\:\\:\\/36 OR destination.ip:2603\\:1056\\:\\:\\/36 OR destination.ip:2620\\:1ec\\:4\\:\\:152\\/128 OR destination.ip:2620\\:1ec\\:4\\:\\:153\\/128 OR destination.ip:2620\\:1ec\\:c\\:\\:10\\/128 OR destination.ip:2620\\:1ec\\:c\\:\\:11\\/128 OR destination.ip:2620\\:1ec\\:d\\:\\:10\\/128 OR destination.ip:2620\\:1ec\\:d\\:\\:11\\/128 OR destination.ip:2620\\:1ec\\:8f0\\:\\:\\/46 OR destination.ip:2620\\:1ec\\:900\\:\\:\\/46 OR destination.ip:2620\\:1ec\\:a92\\:\\:152\\/128 OR destination.ip:2620\\:1ec\\:a92\\:\\:153\\/128) AND (destination.port:(143 OR 587 OR 993 OR 995)) AND network.transport:tcp) OR ((destination.ip:40.92.0.0\\/15 OR destination.ip:40.107.0.0\\/16 OR destination.ip:52.100.0.0\\/14 OR destination.ip:52.238.78.88\\/32 OR destination.ip:104.47.0.0\\/17 OR destination.ip:2a01\\:111\\:f400\\:\\:\\/48 OR destination.ip:2a01\\:111\\:f403\\:\\:\\/48) AND destination.port:443) OR ((destination.ip:40.92.0.0\\/15 OR destination.ip:40.107.0.0\\/16 OR destination.ip:52.100.0.0\\/14 OR destination.ip:52.238.78.88\\/32 OR destination.ip:104.47.0.0\\/17 OR destination.ip:2a01\\:111\\:f400\\:\\:\\/48 OR destination.ip:2a01\\:111\\:f403\\:\\:\\/48) AND destination.port:25) OR (destination.ip:20.184.0.0\\/13 OR destination.ip:20.192.0.0\\/10 OR destination.ip:23.72.0.0\\/13 OR destination.ip:40.76.0.0\\/14 OR destination.ip:51.10.0.0\\/15 OR destination.ip:51.103.0.0\\/16 OR destination.ip:51.104.0.0\\/15 OR destination.ip:51.142.136.0\\/22 OR destination.ip:52.160.0.0\\/11 OR destination.ip:204.79.197.0\\/24) OR ((destination.ip:13.107.6.171\\/32 OR destination.ip:13.107.18.15\\/32 OR destination.ip:13.107.140.6\\/32 OR destination.ip:52.108.0.0\\/14 OR destination.ip:52.244.37.168\\/32 OR destination.ip:2603\\:1006\\:1400\\:\\:\\/40 OR destination.ip:2603\\:1016\\:2400\\:\\:\\/40 OR destination.ip:2603\\:1026\\:2400\\:\\:\\/40 OR destination.ip:2603\\:1036\\:2400\\:\\:\\/40 OR destination.ip:2603\\:1046\\:1400\\:\\:\\/40 OR destination.ip:2603\\:1056\\:1400\\:\\:\\/40 OR destination.ip:2603\\:1063\\:2000\\:\\:\\/38 OR destination.ip:2620\\:1ec\\:c\\:\\:15\\/128 OR destination.ip:2620\\:1ec\\:8fc\\:\\:6\\/128 OR destination.ip:2620\\:1ec\\:a92\\:\\:171\\/128 OR destination.ip:2a01\\:111\\:f100\\:2000\\:\\:a83e\\:3019\\/128 OR destination.ip:2a01\\:111\\:f100\\:2002\\:\\:8975\\:2d79\\/128 OR destination.ip:2a01\\:111\\:f100\\:2002\\:\\:8975\\:2da8\\/128 OR destination.ip:2a01\\:111\\:f100\\:7000\\:\\:6fdd\\:6cd5\\/128 OR destination.ip:2a01\\:111\\:f100\\:a004\\:\\:bfeb\\:88cf\\/128) AND (destination.port:(80 OR 443)) AND network.transport:tcp) OR ((destination.ip:20.20.32.0\\/19 OR destination.ip:20.190.128.0\\/18 OR destination.ip:20.231.128.0\\/19 OR destination.ip:40.126.0.0\\/18 OR destination.ip:2603\\:1006\\:2000\\:\\:\\/48 OR destination.ip:2603\\:1007\\:200\\:\\:\\/48 OR destination.ip:2603\\:1016\\:1400\\:\\:\\/48 OR destination.ip:2603\\:1017\\:\\:\\/48 OR destination.ip:2603\\:1026\\:3000\\:\\:\\/48 OR destination.ip:2603\\:1027\\:1\\:\\:\\/48 OR destination.ip:2603\\:1036\\:3000\\:\\:\\/48 OR destination.ip:2603\\:1037\\:1\\:\\:\\/48 OR destination.ip:2603\\:1046\\:2000\\:\\:\\/48 OR destination.ip:2603\\:1047\\:1\\:\\:\\/48 OR destination.ip:2603\\:1056\\:2000\\:\\:\\/48 OR destination.ip:2603\\:1057\\:2\\:\\:\\/48) AND (destination.port:(80 OR 443)) AND network.transport:tcp) OR ((destination.ip:13.107.6.192\\/32 OR destination.ip:13.107.9.192\\/32 OR destination.ip:52.108.0.0\\/14 OR destination.ip:2620\\:1ec\\:4\\:\\:192\\/128 OR destination.ip:2620\\:1ec\\:a92\\:\\:192\\/128) AND destination.port:443 AND network.transport:tcp) OR ((destination.ip:13.107.136.0\\/22 OR destination.ip:40.108.128.0\\/17 OR destination.ip:52.104.0.0\\/14 OR destination.ip:104.146.128.0\\/17 OR destination.ip:150.171.40.0\\/22 OR destination.ip:2603\\:1061\\:1300\\:\\:\\/40 OR destination.ip:2620\\:1ec\\:8f8\\:\\:\\/46 OR destination.ip:2620\\:1ec\\:908\\:\\:\\/46 OR destination.ip:2a01\\:111\\:f402\\:\\:\\/48) AND (destination.port:(80 OR 443)) AND network.transport:tcp)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "Network connection detected (rule: NetworkConnect)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1203"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Florian Roth (Nextron Systems), Tim Shelton, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "You may have to tune certain domains out that Excel may call out to, such as microsoft or other business use case domains.",
    "Office documents commonly have templates that refer to external addresses, like \"sharepoint.ourcompany.com\" may have to be tuned.",
    "It is highly recommended to baseline your activity and tune out common business use cases."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}