id: 013b415c-2c23-4e38-9a7f-539982e162c2
status: test
description: Detects the execution of the "control.exe" utility with a suspicious
  file as an argument.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \control.exe
  - OriginalFileName: control.exe
  selection_cli:
    CommandLine|contains:
    - .cpl
    - .scr
  filter_main_generic:
    ParentImage|endswith:
    - \control.exe
    - \rundll32.exe
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of the "control.exe" utility with a suspicious
  file as an argument.'
