id: 32f8231f-5cbc-402d-aab3-dcc352a2b3ac
status: test
description: Detects the execution of pnputil with the "install" flag in order to
  install a driver. This technique is often used by attackers to install rootkits.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.defense-evasion
- attack.t1562.001
- attack.t1055
- attack.t1055.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \pnputil.exe
  - OriginalFileName: pnputil.exe
  selection_cli:
    CommandLine|contains: ' install '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of pnputil with the "install" flag in order to
  install a driver. This technique is often used by attackers to install rootkits.'
