id: 0d80a571-6b4d-4fb8-8de8-3b6d9775ba74
status: test
description: Detects the execution of a malicious shortcut (.LNK) file that launches
  PowerShell
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains:
    - ' -w hidden '
    - ' -w 1 '
    - ' -w 11 '
    - ' -w 12 '
    - ' -w 13 '
    - ' -w 14 '
    - ' -w 15 '
    - ' -w 16 '
    - ' -w 17 '
    - ' -w 18 '
    - ' -w 2 '
    - ' -w 21 '
    - ' -w 22 '
    - ' -w 23 '
    - ' -w 24 '
    - ' -w 25 '
    - ' -w 26 '
    - ' -w 3 '
    - ' -w 4 '
    - ' -w 5 '
    - ' -w 6 '
    - ' -w 7 '
    - ' -w 8 '
    - ' -w 9 '
    - ' -windowstyle hidden '
    - ' -windowstyle 1 '
    - ' -windowstyle 11 '
    - ' -windowstyle 12 '
    - ' -windowstyle 13 '
    - ' -windowstyle 14 '
    - ' -windowstyle 15 '
    - ' -windowstyle 16 '
    - ' -windowstyle 17 '
    - ' -windowstyle 18 '
    - ' -windowstyle 2 '
    - ' -windowstyle 21 '
    - ' -windowstyle 22 '
    - ' -windowstyle 23 '
    - ' -windowstyle 24 '
    - ' -windowstyle 25 '
    - ' -windowstyle 26 '
    - ' -windowstyle 3 '
    - ' -windowstyle 4 '
    - ' -windowstyle 5 '
    - ' -windowstyle 6 '
    - ' -windowstyle 7 '
    - ' -windowstyle 8 '
    - ' -windowstyle 9 '
  selection_shortcut:
    CommandLine|contains:
    - C:\Users\
    - C:\ProgramData\
    - \AppData\Local\
    - \AppData\Roaming\
    - \Users\Public\
    - \Windows\Temp\
    - .LNK
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of a malicious shortcut (.LNK) file that launches
  PowerShell'
