id: 06502405-0cf6-4183-9083-473b6cf63863
status: test
description: Detects suspicious use of mavinject.exe for process injection
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mavinject.exe
  - OriginalFileName: mavinject.exe
  selection_cli:
    CommandLine|contains:
    - ' -i '
    - ' -inject '
  filter_main_legit_parent:
    ParentImage|endswith:
    - \mavinject.exe
    - \mavinject64.exe
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of mavinject.exe for process injection'
