id: 3322bf2b-b8f8-4929-ab16-6bc59c3c757f
status: test
description: Detects the execution of msdt.exe by a Microsoft Office process. This
  could be a sign of a Follina exploitation attempt.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.execution
- attack.t1203
- detection.threat-hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - \excel.exe
    - \mspub.exe
    - \onenote.exe
    - \outlook.exe
    - \word.exe
    Image|endswith: \msdt.exe
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of msdt.exe by a Microsoft Office process. This
  could be a sign of a Follina exploitation attempt.'
