id: 5b4d6885-ae66-4963-8d1d-4cd998864610
status: test
description: Detects the use of computerdefaults.exe to bypass UAC and execute arbitrary
  commands
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.privilege-escalation
- attack.defense-evasion
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \computerdefaults.exe
  - OriginalFileName: ComputerDefaults.exe
  selection_cli:
    CommandLine|contains:
    - ' /s '
    - ' /c '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of computerdefaults.exe to bypass UAC and execute arbitrary
  commands'
