id: 71aa0437-579c-47df-8542-4b22d334cd45
status: test
description: Detects suspicious use of BitsAdmin or PowerShell Start-BitsTransfer
  to download files (suspicious BITS activity)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_bits:
    Image|endswith: \bitsadmin.exe
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
  selection_powershell:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains: Start-BitsTransfer
  condition: 1 of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of BitsAdmin or PowerShell Start-BitsTransfer
  to download files (suspicious BITS activity)'
