id: 01098ffa-9bc5-4152-923d-57ea0f15c151
status: test
description: Detects the use of the "netstat" utility by a non-administrative process.
  This could be a sign of potential network reconnaissance.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-08-17
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netstat.exe
  - OriginalFileName: netstat.exe
  selection_user:
    User|contains:
    - AUTHORI
    - AUTORI
  filter_main_sysmon:
    ParentImage|endswith: \Sysmon64.exe
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "netstat" utility by a non-administrative process.
  This could be a sign of potential network reconnaissance.'
