id: 20343413-5c3b-401b-8137-af5f7ea51476
status: test
description: Detects the use of the "tasklist" utility to enumerate running processes.
  This could be a sign of potential reconnaissance activity.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-08-17
tags:
- attack.discovery
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \tasklist.exe
  - OriginalFileName: tasklist.exe
  selection_cli:
    CommandLine|contains:
    - ' /v '
    - ' /fo '
    - ' /fi '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "tasklist" utility to enumerate running processes.
  This could be a sign of potential reconnaissance activity.'
