id: 4bdc507c-8799-4711-81c7-b6b33c7eacd5
status: test
description: Detects the use of the "CreateProcessWithTokenW" API to start a process
  suspended and then modify it in memory before resuming execution.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - CreateProcessWithTokenW
    - suspended
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of the "CreateProcessWithTokenW" API to start a process
  suspended and then modify it in memory before resuming execution.'
