id: 424893e3-fc1d-4a46-86a4-97b5a1db2685
status: test
description: 'Detects the remote registry service being enabled or started on a host.

  This could be a sign of lateral movement preparation.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-13
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - config
    - RemoteRegistry
    CommandLine|contains:
    - start
    - enable
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the remote registry service being enabled or started on a host.

  This could be a sign of lateral movement preparation.'
