id: 13d276cb-53a4-4988-a4c5-d45d0d693352
status: test
description: Detects suspicious usage of DSQuery or dsget by an unprivileged user
  to enumerate AD objects
author: AutoGenerated
date: '2025-07-12'
modified: 2023-08-17
tags:
- attack.discovery
- attack.t1018
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \dsquery.exe
    - \dsget.exe
  - OriginalFileName:
    - dsquery.exe
    - dsget.exe
  selection_user:
    User|contains:
    - AUTHORI
    - AUTORI
  selection_susp_flags:
    CommandLine|contains:
    - ' * '
    - ' -s '
    - ' -u '
  selection_susp_paths:
    CommandLine|contains:
    - '*'
    - ' -s '
    - ' -u '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of DSQuery or dsget by an unprivileged user
  to enumerate AD objects'
