id: c5e970d5-7b77-4bd4-b6ec-58d1bedff519
status: test
description: 'Detects attempts to stop the Windows Event Log service via the "sc.exe"
  utility.

  This could indicate an attempt to tamper with the logs.

  '
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - stop
    - Windows Event Log
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects attempts to stop the Windows Event Log service via the "sc.exe"
  utility.

  This could indicate an attempt to tamper with the logs.'
