id: 0cef645a-5515-476a-aa5d-231807b1ccd9
status: test
description: Detects an unusual ActiveX control registration (regsvr32 registering
  a DLL outside system paths, potential malware)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  selection_cli:
    CommandLine|contains:
    - ' -s '
    - ' -i '
    - ' -u '
  filter_main_system_paths:
    CommandLine|contains:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects an unusual ActiveX control registration (regsvr32 registering
  a DLL outside system paths, potential malware)'
