id: 56e0322b-f9ee-4781-99e8-61e5e7909e41
status: test
description: 'Detects the installation of a password filter DLL in the registry.

  This could be a sign of credential stealing activity.

  The "C:\Windows\System32\rundll32.exe" process is used to install the DLL.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1552.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - regsvr32
    - C:\Windows\System32\ntdsapi.dll
    - /s
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the installation of a password filter DLL in the registry.

  This could be a sign of credential stealing activity.

  The "C:\Windows\System32\rundll32.exe" process is used to install the DLL.'
