id: 2bcd70c8-ba46-4455-90af-919e90e39fc9
status: test
description: Detects suspicious use of atbroker.exe or utilman.exe (Ease of Access)
  outside normal context (potential accessibility backdoor)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \atbroker.exe
    - \utilman.exe
  - OriginalFileName:
    - Atbroker.exe
    - Utilman.exe
  selection_parent:
    ParentImage|endswith:
    - \explorer.exe
    - \winlogon.exe
  filter_main_explorer:
    ParentImage|endswith: \explorer.exe
    CommandLine|contains: Ease of Access
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of atbroker.exe or utilman.exe (Ease of Access)
  outside normal context (potential accessibility backdoor)'
