{
  "rule_id": "caf02a0a-1e1c-4552-9b48-5e070bd88d11",
  "risk_score": 73,
  "description": "Ransomware create txt file in the user Desktop",
  "name": "Suspicious Creation TXT File in User Desktop",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\cmd.exe AND (file.path:*\\\\Users\\\\* AND file.path:*\\\\Desktop\\\\*) AND file.path:*.txt",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.t1486"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}