{
  "rule_id": "fed85bf9-e075-4280-9159-fbe8a023d6fa",
  "risk_score": 47,
  "description": "Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.",
  "name": "Advanced IP Scanner - File Event",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\AppData\\\\Local\\\\Temp\\\\Advanced\\ IP\\ Scanner\\ 2*",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1046"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@ROxPinTeddy"
  ],
  "false_positives": [
    "Legitimate administrative use"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}