{
  "rule_id": "a05baa88-e922-4001-bc4d-8738135f27de",
  "risk_score": 47,
  "description": "Detects creation of the Process Monitor driver by processes other than Process Monitor (procmon) itself.",
  "name": "Process Monitor Driver Creation By Non-Sysinternals Binary",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(file.path:*\\\\procmon* AND file.path:*.sys) AND (NOT (process.executable:(*\\\\procmon.exe OR *\\\\procmon64.exe)))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.t1068"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Some false positives may occur with legitimate renamed process monitor binaries"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}