{
  "rule_id": "e074832a-eada-4fd7-94a1-10642b130e16",
  "risk_score": 73,
  "description": "Detects default lsass dump filename generated by SafetyKatz.",
  "name": "HackTool - SafetyKatz Dump Indicator",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\Temp\\\\debug.bin",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Markus Neis"
  ],
  "false_positives": [
    "Rare legitimate files with similar filename structure"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}