{
  "rule_id": "ee63c85c-6d51-4d12-ad09-04e25877a947",
  "risk_score": 47,
  "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by application shims.\nThe Microsoft Windows Application Compatibility Infrastructure/Framework (Application Shim) was created to allow for backward compatibility of software as the operating system codebase changes over time.\n",
  "name": "New Custom Shim Database Created",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:(*\\:\\\\Windows\\\\apppatch\\\\Custom\\\\* OR *\\:\\\\Windows\\\\apppatch\\\\CustomSDB\\\\*)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547.009"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate custom SHIM installations will also trigger this rule"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}