{
  "rule_id": "4e87b8e2-2ee9-4b2a-a715-4727d297ece0",
  "risk_score": 73,
  "description": "Detects the creation of files that look like exports of the local SAM (Security Account Manager)",
  "name": "Potential SAM Database Dump",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(file.path:(*\\\\Temp\\\\sam OR *\\\\sam.sav OR *\\\\Intel\\\\sam OR *\\\\sam.hive OR *\\\\Perflogs\\\\sam OR *\\\\ProgramData\\\\sam OR *\\\\Users\\\\Public\\\\sam OR *\\\\AppData\\\\Local\\\\sam OR *\\\\AppData\\\\Roaming\\\\sam OR *_ShadowSteal.zip OR *\\\\Documents\\\\SAM.export OR *\\:\\\\sam)) OR (file.path:(*\\\\hive_sam_* OR *\\\\sam.save* OR *\\\\sam.export* OR *\\\\\\~reg_sam.save* OR *\\\\sam_backup* OR *\\\\sam.bck* OR *\\\\sam.backup*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Rare cases of administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}