{
  "rule_id": "2aa0a6b4-a865-495b-ab51-c28249537b75",
  "risk_score": 47,
  "description": "A General detection for files being created in the Windows startup directory. This could be an indicator of persistence.",
  "name": "Startup Folder File Write",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\StartUp* AND (NOT (process.executable:C\\:\\\\Windows\\\\System32\\\\wuauclt.exe OR file.path:C\\:\\\\$WINDOWS.\\~BT\\\\NewOS\\\\*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1547.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"
  ],
  "false_positives": [
    "FP could be caused by legitimate application writing shortcuts for example. This folder should always be inspected to make sure that all the files in there are legitimate"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}