{
  "rule_id": "654fcc6d-840d-4844-9b07-2c3300e54a26",
  "risk_score": 73,
  "description": "Detects programs on a Windows system that should not write an archive to disk",
  "name": "Legitimate Application Dropped Archive",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\eqnedt32.exe OR *\\\\visio.exe OR *\\\\wordpad.exe OR *\\\\wordview.exe OR *\\\\certutil.exe OR *\\\\certoc.exe OR *\\\\CertReq.exe OR *\\\\Desktopimgdownldr.exe OR *\\\\esentutl.exe OR *\\\\finger.exe OR *\\\\notepad.exe OR *\\\\AcroRd32.exe OR *\\\\RdrCEF.exe OR *\\\\mshta.exe OR *\\\\hh.exe)) AND (file.path:(*.zip OR *.rar OR *.7z OR *.diagcab OR *.appx))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1218"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Florian Roth"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}