{
  "rule_id": "5f87308a-0a5b-4623-ae15-d8fa1809bc60",
  "risk_score": 47,
  "description": "Detects the creation of copy of suspicious files (EXE/DLL) to the default GPO storage folder",
  "name": "Suspicious Files in Default GPO Folder",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\Policies\\\\\\{31B2F340\\-016D\\-11D2\\-945F\\-00C04FB984F9\\}\\\\* AND (file.path:(*.dll OR *.exe))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1036.005",
    "attack.defense-evasion"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "elhoim"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}