{
  "rule_id": "16fe46bb-4f64-46aa-817d-ff7bec4a2352",
  "risk_score": 47,
  "description": "Detects the creation of the LiveKD driver, which is used for live kernel debugging",
  "name": "LiveKD Driver Creation",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(process.executable:(*\\\\livekd.exe OR *\\\\livek64.exe)) AND file.path:C\\:\\\\Windows\\\\System32\\\\drivers\\\\LiveKdD.SYS",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate usage of LiveKD for debugging purposes will also trigger this"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}