{
  "rule_id": "dca1b3e8-e043-4ec8-85d7-867f334b5724",
  "risk_score": 47,
  "description": "A general detection for processes creating PFX files. This could be an indicator of an adversary exporting a local certificate to a PFX file.",
  "name": "Suspicious PFX File Creation",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*.pfx AND (NOT (file.path:*\\\\Templates\\\\Windows\\\\Windows_TemporaryKey.pfx* AND file.path:*\\\\CMake\\\\*))",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1552.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)"
  ],
  "false_positives": [
    "System administrators managing certificates."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}