{
  "rule_id": "68578b43-65df-4f81-9a9b-92f32711a951",
  "risk_score": 73,
  "description": "Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)",
  "name": "UAC Bypass Using Windows Media Player - File",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(file.path:*\\\\AppData\\\\Local\\\\Temp\\\\OskSupport.dll AND file.path:C\\:\\\\Users\\\\*) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\DllHost.exe AND file.path:C\\:\\\\Program\\ Files\\\\Windows\\ Media\\ Player\\\\osk.exe)",
  "filters": [
    {
      "query": {
        "match": {
          "event.action": {
            "type": "phrase",
            "query": "File Create (rule: FileCreate)"
          }
        }
      }
    }
  ],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1548.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christian Burkard (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}