id: 3e42a3ad-7913-4c11-bdce-e1216fa845d8
status: test
description: Detects direct DNS queries to external resolver. This could be a sign
  of DNS tunneling.
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-09
tags:
- attack.command-and-control
- attack.t1090.001
logsource:
  category: dns
detection:
  selection:
    query|contains: ://
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects direct DNS queries to external resolver. This could be a sign
  of DNS tunneling.'
