id: 9374f618-d756-4977-bd68-c5d9cf92d450
status: test
description: Detects suspicious memory dump of a web browser process (possible credential
  theft attempt)
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.credential-access
- attack.t1003.001
- attack.t1003.002
- attack.t1003.003
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith:
    - \brave.exe
    - \chrome.exe
    - \firefox.exe
    - \iexplore.exe
    - \maxthon.exe
    - \msedge.exe
    - \msedgewebview2.exe
    - \opera.exe
    - \safari.exe
    - \seamonkey.exe
    - \vivaldi.exe
    SourceImage|endswith: \procdump.exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious memory dump of a web browser process (possible credential
  theft attempt)'
