id: c53d55ae-b906-4c11-baee-09edf38be0f8
status: test
description: Detects the creation of files in system directories by suspicious processes
author: AutoGenerated
date: '2025-07-13'
modified: 2022-11-29
tags:
- attack.persistence
- attack.t1546.006
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \mshta.exe
    - \msiexec.exe
    - \msxsl.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \schtasks.exe
    - \wscript.exe
    - \wsl.exe
    TargetFilename|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    - :\Windows\WinSxS\
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of files in system directories by suspicious processes'
