id: 5bc25cc8-f08f-450a-a64e-a25c74ec253c
status: test
description: 'Detects changes to the hosts file.

  Adversaries may modify the hosts file to redirect network traffic to a different
  IP address.

  This technique is often used to redirect traffic to a different C2 server.

  '
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1579.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename: C:\Windows\System32\drivers\etc\hosts
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects changes to the hosts file.

  Adversaries may modify the hosts file to redirect network traffic to a different
  IP address.

  This technique is often used to redirect traffic to a different C2 server.'
