id: c3bf294b-ca00-48c1-ad61-efc5f6ba0ea2
status: test
description: Detects a suspicious executable dropped to the startup folder
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-02
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\Startup\
    TargetFilename|endswith:
    - .bat
    - .cmd
    - .exe
    - .ps1
    - .vbs
    - .vbe
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects a suspicious executable dropped to the startup folder'
