id: aa9519da-7ac6-45b0-81dc-f0c8b5fad0c5
status: test
description: 'Detects the creation of a new scheduled task file.

  Adversaries may establish persistence by creating a scheduled task.

  Scheduled tasks are programs or scripts set to run automatically on a computer at
  a later time or when a specific event occurs.

  Scheduled tasks can be used to execute malicious code or to carry out malicious
  actions.

  '
author: AutoGenerated
date: '2025-07-13'
modified: 2022-11-29
tags:
- attack.persistence
- attack.t1053.005
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \Tasks\
  filter_main_generic:
    TargetFilename|contains:
    - \AppData\Local\Temp\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
    - \Microsoft\Windows\Start Menu\Programs\Startup (Classic)
    - \Microsoft\Windows\Start Menu\Programs\Startup (Classic)\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
  filter_optional_ms_teams:
    Image|endswith: \AppData\Local\Microsoft\Teams\current\Teams.exe
    TargetFilename|contains: \AppData\Local\Microsoft\Teams\Update\Tasks\
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a new scheduled task file.

  Adversaries may establish persistence by creating a scheduled task.

  Scheduled tasks are programs or scripts set to run automatically on a computer at
  a later time or when a specific event occurs.

  Scheduled tasks can be used to execute malicious code or to carry out malicious
  actions.'
