id: 95a4fb13-c9c7-4b06-9d73-a10c6d97e153
status: test
description: 'Detects the creation of a file with the ".dmp" extension in the current
  directory.

  This could be a sign of a process dumping the contents of the LSASS process memory.

  '
author: AutoGenerated
date: '2025-07-13'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: .dmp
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a file with the ".dmp" extension in the current
  directory.

  This could be a sign of a process dumping the contents of the LSASS process memory.'
