id: 4079d00b-7a6e-4684-8aaa-337b695a3e88
status: test
description: Detects the creation of a rogue service in the "Services" folder.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.privilege-escalation
- attack.t1543.003
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \Services\
    TargetFilename|endswith: .exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a rogue service in the "Services" folder.'
