id: ca054d46-e06b-4597-99eb-7ac9883e1293
status: test
description: 'Detects the creation of a DLL file in a system directory by a non-system
  process.

  This could be a sign of a DLL hijacking attempt.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1574.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
    TargetFilename|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    TargetFilename|endswith: .dll
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a DLL file in a system directory by a non-system
  process.

  This could be a sign of a DLL hijacking attempt.'
