id: ae8186e8-fc30-4a6c-a5d3-6e35139849c6
status: test
description: 'Detects the creation of a shortcut in the startup folder for persistence.

  This technique is used by many malware families to ensure persistence on a compromised
  system.

  '
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup\
    TargetFilename|endswith: .lnk
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a shortcut in the startup folder for persistence.

  This technique is used by many malware families to ensure persistence on a compromised
  system.'
