id: 64cdaa6f-d35b-4468-952c-d5f43baca90c
status: test
description: Detects the creation of a DLL in system32 for hijacking
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.defense-evasion
- attack.t1574.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \Windows\System32\
    TargetFilename|endswith: .dll
  filter_main_generic:
    Image|endswith:
    - \mshta.exe
    - \msiexec.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
    - \cscript.exe
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a DLL in system32 for hijacking'
