title: Simple AND Condition Test
id: simple-and-test-456
description: Test rule for simple AND condition
author: Test Author
date: 2024/01/01
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: 'powershell.exe'
  selection2:
    User: 'admin'
  condition: selection1 and selection2
level: high
tags:
  - test
  - and 