title: Simple OR Condition Test
id: simple-or-test-789
description: Test rule for simple OR condition
author: Test Author
date: 2024/01/01
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: 'powershell.exe'
  selection2:
    CommandLine|contains: 'cmd.exe'
  condition: selection1 or selection2
level: low
tags:
  - test
  - or 