id: f86fe0ec-03ae-403c-b328-384e69b6350e
status: test
description: Detects PowerShell download cradle using Invoke-WebRequest
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1218
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - Invoke-WebRequest
    - IEX
    - DownloadString
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell download cradle using Invoke-WebRequest'
