id: 71a0a99e-4a3d-4027-a261-96afdb351148
status: test
description: Detects suspicious PowerShell download cradle using iex and Net.WebClient
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - iex
    - Net.WebClient
    - Invoke-Expression
    - New-Object
    - Net.WebClient
    - DownloadString
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell download cradle using iex and Net.WebClient'
