id: c35f87bf-9809-49ac-a3ab-f17d3b25a4cb
status: test
description: Detects the execution of the "Get-GPPPassword" cmdlet with the "-Password"
  flag. This cmdlet is used to extract the password of a Group Policy Preference.
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.credential-access
- attack.t1552.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - Get-GPPPassword
    - -Password
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of the "Get-GPPPassword" cmdlet with the "-Password"
  flag. This cmdlet is used to extract the password of a Group Policy Preference.'
