{
  "rule_id": "39698b3f-da92-4bc6-bfb5-645a98386e45",
  "risk_score": 99,
  "description": "Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool",
  "name": "Win Susp Computer Name Containing Samtheadmin",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND ((winlog.event_data.SamAccountName:*$ AND winlog.event_data.SamAccountName:SAMTHEADMIN\\-*) OR (winlog.event_data.TargetUserName:*$ AND winlog.event_data.TargetUserName:SAMTHEADMIN\\-*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "cve.2021-42278",
    "cve.2021-42287",
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.t1078"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "elhoim"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}