{
  "rule_id": "8e5c03fa-b7f0-11ea-b242-07e0576828d9",
  "risk_score": 47,
  "description": "This event is generated when an authenticated user who is not allowed to log on remotely attempts to connect to this computer through Remote Desktop.\nOften, this event can be generated by attackers when searching for available windows servers in the network.\n",
  "name": "Denied Access To Remote Desktop",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND event.code:4825",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.lateral-movement",
    "attack.t1021.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Pushkarev Dmitry"
  ],
  "false_positives": [
    "Valid user was not added to RDP group"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}