{
  "rule_id": "7b449a5e-1db5-4dd0-a2dc-4e3a67282538",
  "risk_score": 73,
  "description": "Detects the creation of a local hidden user account which should not happen for event ID 4720.",
  "name": "Hidden Local User Creation",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND ((event.code:4720 AND winlog.event_data.TargetUserName:*$) AND (NOT winlog.event_data.TargetUserName:HomeGroupUser$))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.t1136.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Christian Burkard (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}