{
  "rule_id": "c4e92a97-a9ff-4392-9d2d-7a4c642768ca",
  "risk_score": 73,
  "description": "Detects a service installed by a client which has PID 0 or whose parent has PID 0",
  "name": "Service Installed By Unusual Client - Security",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND (event.code:4697 AND (winlog.event_data.ClientProcessId:0 OR process.parent.pid:0))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation",
    "attack.t1543"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Tim Rauch (Nextron Systems), Elastic (idea)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}