{
  "rule_id": "12ba6a38-adb3-4d6b-91ba-a7fb248e3199",
  "risk_score": 47,
  "description": "Detects when the password policy is enumerated.",
  "name": "Password Policy Enumerated",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND (winlog.event_data.AccessList:*%%5392* AND event.code:4661 AND winlog.event_data.ObjectServer:Security\\ Account\\ Manager)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.discovery",
    "attack.t1201"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Zach Mathis"
  ],
  "false_positives": [],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}