{
  "rule_id": "941e5c45-cda7-4864-8cea-bbb7458d194a",
  "risk_score": 47,
  "description": "Detects suspicious processes logging on with explicit credentials",
  "name": "Suspicious Remote Logon with Explicit Credentials",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND ((event.code:4648 AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\winrs.exe OR *\\\\wmic.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\reg.exe))) AND (NOT (winlog.event_data.TargetServerName:localhost OR (user.name:*$ AND winlog.event_data.TargetUserName:*$))))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1078",
    "attack.lateral-movement"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st, Tim Shelton"
  ],
  "false_positives": [
    "Administrators that use the RunAS command or scheduled tasks"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}