{
  "rule_id": "0248a7bc-8a9a-4cd8-a57e-3ae8e073a073",
  "risk_score": 47,
  "description": "Detects the mount of an ISO image on an endpoint",
  "name": "ISO Image Mounted",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Security AND ((event.code:4663 AND winlog.event_data.ObjectName:\\\\Device\\\\CdRom* AND winlog.event_data.ObjectServer:Security AND winlog.event_data.ObjectType:File) AND (NOT (winlog.event_data.ObjectName:(\\\\Device\\\\CdRom0\\\\autorun.ico OR \\\\Device\\\\CdRom0\\\\setup.exe OR \\\\Device\\\\CdRom0\\\\setup64.exe))))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.initial-access",
    "attack.t1566.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Syed Hasan (@syedhasan009)"
  ],
  "false_positives": [
    "Software installation ISO files"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}