{
  "rule_id": "aa7a3fce-bef5-4311-9cc1-5f04bb8c308c",
  "risk_score": 47,
  "description": "Detects calls to cmdlets inside of PowerShell scripts that are used to export certificates from the local certificate store. Threat actors were seen abusing this to steal private keys from compromised machines.",
  "name": "Certificate Exported Via PowerShell - ScriptBlock",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(powershell.file.script_block_text:(*Export\\-PfxCertificate* OR *Export\\-Certificate*)) AND (NOT powershell.file.script_block_text:*CmdletsToExport\\ \\=\\ @\\(*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1552.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate certificate exports by administrators. Additional filters might be required."
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}