{
  "rule_id": "976d6e6f-a04b-4900-9713-0134a353e38b",
  "risk_score": 73,
  "description": "Detects execution of a PowerShell script that contains calls to the \"Veeam.Backup\" class, in order to dump stored credentials.",
  "name": "Veeam Backup Servers Credential Dumping Script Execution",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*\\[Credentials\\]* AND powershell.file.script_block_text:*\\[Veeam.Backup.Common.ProtectedStorage\\]\\:\\:GetLocalString* AND powershell.file.script_block_text:*Invoke\\-Sqlcmd* AND powershell.file.script_block_text:*Veeam\\ Backup\\ and\\ Replication*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Administrators backup scripts (must be investigated)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}