{
  "rule_id": "9e07f6e7-83aa-45c6-998e-0af26efd0a85",
  "risk_score": 47,
  "description": "Adversaries may establish persistence and elevate privileges by executing malicious content triggered by a Windows Management Instrumentation (WMI) event subscription.",
  "name": "Powershell WMI Persistence",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(powershell.file.script_block_text:*New\\-CimInstance\\ * AND powershell.file.script_block_text:*\\-Namespace\\ root\\/subscription\\ * AND powershell.file.script_block_text:*\\-ClassName\\ __EventFilter\\ * AND powershell.file.script_block_text:*\\-Property\\ *) OR (powershell.file.script_block_text:*New\\-CimInstance\\ * AND powershell.file.script_block_text:*\\-Namespace\\ root\\/subscription\\ * AND powershell.file.script_block_text:*\\-ClassName\\ CommandLineEventConsumer\\ * AND powershell.file.script_block_text:*\\-Property\\ *)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation",
    "attack.t1546.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}