{
  "rule_id": "bd33d2aa-497e-4651-9893-5c5364646595",
  "risk_score": 47,
  "description": "Detects powershell scripts that creates sockets/listeners which could be indicative of tunneling activity",
  "name": "Suspicious TCP Tunnel Via PowerShell Script",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*\\[System.Net.HttpWebRequest\\]* AND powershell.file.script_block_text:*System.Net.Sockets.TcpListener* AND powershell.file.script_block_text:*AcceptTcpClient*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1090"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}