{
  "rule_id": "4a241dea-235b-4a7e-8d76-50d817b146c4",
  "risk_score": 99,
  "description": "Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports a mailbox to a remote or local share, as used in ProxyShell exploitations",
  "name": "Suspicious PowerShell Mailbox Export to Share - PS",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*New\\-MailboxExportRequest* AND powershell.file.script_block_text:*\\ \\-Mailbox\\ * AND powershell.file.script_block_text:*\\ \\-FilePath\\ \\\\\\\\*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.exfiltration"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}