{
  "rule_id": "3c7d1587-3b13-439f-9941-7d14313dbdfe",
  "risk_score": 47,
  "description": "Detects usage of COM objects that can be abused to download files in PowerShell by CLSID",
  "name": "Potential COM Objects Download Cradles Usage - PS Script",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*\\[Type\\]\\:\\:GetTypeFromCLSID\\(* AND (powershell.file.script_block_text:(*0002DF01\\-0000\\-0000\\-C000\\-000000000046* OR *F6D90F16\\-9C73\\-11D3\\-B32E\\-00C04F990BB4* OR *F5078F35\\-C551\\-11D3\\-89B9\\-0000F81FE221* OR *88d96a0a\\-f192\\-11d4\\-a65f\\-0040963251e5* OR *AFBA6B42\\-5692\\-48EA\\-8141\\-DC517DCF0EF1* OR *AFB40FFD\\-B609\\-40A3\\-9828\\-F88BBE11E4E3* OR *88d96a0b\\-f192\\-11d4\\-a65f\\-0040963251e5* OR *2087c2f4\\-2cef\\-4953\\-a8ab\\-66779b670495* OR *000209FF\\-0000\\-0000\\-C000\\-000000000046* OR *00024500\\-0000\\-0000\\-C000\\-000000000046*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1105"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Legitimate use of the library"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}