{
  "rule_id": "a699b30e-d010-46c8-bbd1-ee2e26765fe9",
  "risk_score": 47,
  "description": "Storing files in Alternate Data Stream (ADS) similar to Astaroth malware.",
  "name": "Powershell Store File In Alternate Data Stream",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*Start\\-Process* AND powershell.file.script_block_text:*\\-FilePath\\ \\\"$env\\:comspec\\\"\\ * AND powershell.file.script_block_text:*\\-ArgumentList\\ * AND powershell.file.script_block_text:*\\>*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1564.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}