{
  "rule_id": "9e620995-f2d8-4630-8430-4afd89f77604",
  "risk_score": 47,
  "description": "Detects usage of the \"Import-Module\" cmdlet to load the \"Microsoft.ActiveDirectory.Management.dl\" DLL. Which is often used by attackers to perform AD enumeration.",
  "name": "Potential Active Directory Enumeration Using AD Module - PsScript",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(powershell.file.script_block_text:*Import\\-Module\\ * AND powershell.file.script_block_text:*Microsoft.ActiveDirectory.Management.dll*) OR powershell.file.script_block_text:*ipmo\\ Microsoft.ActiveDirectory.Management.dll*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.reconnaissance",
    "attack.discovery",
    "attack.impact"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali"
  ],
  "false_positives": [
    "Legitimate use of the library for administrative activity"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}