{
  "rule_id": "21f9162c-5f5d-4b01-89a8-b705bd7d10ab",
  "risk_score": 47,
  "description": "Detects powershell scripts that import modules from suspicious directories",
  "name": "Import PowerShell Modules From Suspicious Directories",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:(*Import\\-Module\\ \\\"$Env\\:Temp\\\\* OR *Import\\-Module\\ '$Env\\:Temp\\\\* OR *Import\\-Module\\ $Env\\:Temp\\\\* OR *Import\\-Module\\ \\\"$Env\\:Appdata\\\\* OR *Import\\-Module\\ '$Env\\:Appdata\\\\* OR *Import\\-Module\\ $Env\\:Appdata\\\\* OR *Import\\-Module\\ C\\:\\\\Users\\\\Public\\\\* OR *ipmo\\ \\\"$Env\\:Temp\\\\* OR *ipmo\\ '$Env\\:Temp\\\\* OR *ipmo\\ $Env\\:Temp\\\\* OR *ipmo\\ \\\"$Env\\:Appdata\\\\* OR *ipmo\\ '$Env\\:Appdata\\\\* OR *ipmo\\ $Env\\:Appdata\\\\* OR *ipmo\\ C\\:\\\\Users\\\\Public\\\\*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}