{
  "rule_id": "953945c5-22fe-4a92-9f8a-a9edc1e522da",
  "risk_score": 73,
  "description": "Detects usage of the \"Set-Service\" powershell cmdlet to configure a new SecurityDescriptor that allows a service to be hidden from other utilities such as \"sc.exe\", \"Get-Service\"...etc. (Works only in powershell 7)",
  "name": "Abuse of Service Permissions to Hide Services Via Set-Service - PS",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(powershell.file.script_block_text:(*\\-SecurityDescriptorSddl\\ * OR *\\-sd\\ *)) AND (powershell.file.script_block_text:*Set\\-Service\\ * AND powershell.file.script_block_text:*DCLCWPDTSD*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1574.011"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Rare intended use of hidden services",
    "Rare FP could occur due to the non linearity of the ScriptBlockText log"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}