{
  "rule_id": "05b3e303-faf0-4f4a-9b30-46cc13e69152",
  "risk_score": 47,
  "description": "Detects calls to \"Add-Content\" cmdlet in order to modify the content of the user profile and potentially adding suspicious commands for persistence",
  "name": "Potential Persistence Via PowerShell User Profile Using Add-Content",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*Add\\-Content\\ $profile* AND (powershell.file.script_block_text:(*\\-Value\\ \\\"IEX\\ * OR *\\-Value\\ \\\"Invoke\\-Expression* OR *\\-Value\\ \\\"Invoke\\-WebRequest* OR *\\-Value\\ \\\"Start\\-Process* OR *\\-Value\\ 'IEX\\ * OR *\\-Value\\ 'Invoke\\-Expression* OR *\\-Value\\ 'Invoke\\-WebRequest* OR *\\-Value\\ 'Start\\-Process*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.t1546.013"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113, Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate administration and tuning scripts that aim to add functionality to a user PowerShell session"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}