{
  "rule_id": "03409c93-a7c7-49ba-9a4c-a00badf2a153",
  "risk_score": 47,
  "description": "Detects execution of \"TroubleshootingPack\" cmdlets to leverage CVE-2022-30190 or action similar to \"msdt\" lolbin (as described in LOLBAS)",
  "name": "Troubleshooting Pack Cmdlet Execution",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "powershell.file.script_block_text:*Invoke\\-TroubleshootingPack* AND powershell.file.script_block_text:*C\\:\\\\Windows\\\\Diagnostics\\\\System\\\\PCW* AND powershell.file.script_block_text:*\\-AnswerFile* AND powershell.file.script_block_text:*\\-Unattended*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1202"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate usage of \"TroubleshootingPack\" cmdlet for troubleshooting purposes"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}