{
  "rule_id": "603c6630-5225-49c1-8047-26c964553e0e",
  "risk_score": 47,
  "description": "Adversaries may search for common password storage locations to obtain user credentials.\nPasswords are stored in several places on a system, depending on the operating system or application holding the credentials.\n",
  "name": "Enumerate Credentials from Windows Credential Manager With PowerShell",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "(powershell.file.script_block_text:*vaultcmd* AND powershell.file.script_block_text:*\\/listcreds\\:*) AND (powershell.file.script_block_text:(*Windows\\ Credentials* OR *Web\\ Credentials*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1555"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}