id: 4df78d20-4091-4683-b407-1fbfa2ee7f05
status: test
description: Detects PowerShell download cradle using Net.WebClient
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - New-Object
    - Net.WebClient
    - DownloadString
    - AddArgumentList
    - Invoke
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell download cradle using Net.WebClient'
