id: f4fc6e70-887f-47ec-b00d-47342f016f98
status: test
description: Detects process access to lsass.exe by suspicious executables like procdump.exe
  or powershell.exe
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    SourceImage|endswith:
    - \procdump.exe
    - \powershell.exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects process access to lsass.exe by suspicious executables like
  procdump.exe or powershell.exe'
