author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\\\\*\\ADMIN$
    RelativeTargetName|contains:
    - WMIS
    - WMI
    - WinRM
  condition: selection
falsepositives:
- Unknown
level: high
id: 65c9606f-8564-4c3b-9523-333c7d84637f
title: '[AUTO] User: Generate a detection rule for Detect remote WMI execution.'
status: experimental
description: 'User: Generate a detection rule for Detect remote WMI execution.'
