tag: attack.lateral-movement
date: '2025-07-10'
modified: 2022-10-09
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    ObjectType: Process
    AccessMask: '0x14'
    ObjectName|endswith: \smbexec.exe
  condition: selection
falsepositives:
- Unknown
level: high
id: 42ede1b3-8f1a-4e76-bd63-baa72f3a02f6
author: AutoGenerated
title: '[AUTO] User: Generate a detection rule for Detect lateral movement using smbexec.'
status: experimental
description: 'User: Generate a detection rule for Detect lateral movement using smbexec.'
tags: []
