author: AutoGenerated
date: '2025-07-10'
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 3
    ProcessName|endswith: \mstsc.exe
  condition: selection
falsepositives:
- Unknown
level: high
id: 15aa20b5-1a16-4b11-bba6-1c388eab63d3
title: '[AUTO] User: Generate a detection rule for Detect RDP session hijacking.'
status: experimental
description: 'User: Generate a detection rule for Detect RDP session hijacking.'
