id: fd13925e-bbd0-424d-9710-399ab91909c4
status: test
description: Detects the creation of a hidden user account
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1136.001
logsource:
  product: windows
  service: security
  definition: 'The "Security" logging was enabled for one of the following events:
    Success/Failure/Audit. The event ID for successful events is 4727, for failure
    events is 4726 and for audit events is 4718. Note that the event IDs might be
    different when when using Sysmon or other logging tools. Check also the EID on
    the alert for the correct event ID.'
detection:
  selection:
    EventID:
    - 4727
    - 4726
    - 4718
    ObjectType: User
    ObjectName|contains: S-1-5-21-
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a hidden user account'
