{
  "rule_id": "b48492dc-c5ef-4572-8dff-32bc241c15c8",
  "risk_score": 73,
  "description": "Detects the load of RstrtMgr DLL (Restart Manager) by a suspicious process.\nThis library has been used during ransomware campaigns to kill processes that would prevent file encryption by locking them (e.g. Conti ransomware, Cactus ransomware). It has also recently been seen used by the BiBi wiper for Windows.\nIt could also be used for anti-analysis purposes by shut downing specific processes.\n",
  "name": "Load Of RstrtMgr.DLL By A Suspicious Process",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(file.path:*\\\\RstrtMgr.dll OR file.pe.original_file_name:RstrtMgr.dll) AND ((process.executable:(*\\:\\\\Perflogs\\\\* OR *\\:\\\\Users\\\\Public\\\\* OR *\\\\Temporary\\ Internet*)) OR ((process.executable:*\\:\\\\Users\\\\* AND process.executable:*\\\\Favorites\\\\*) OR (process.executable:*\\:\\\\Users\\\\* AND process.executable:*\\\\Favourites\\\\*) OR (process.executable:*\\:\\\\Users\\\\* AND process.executable:*\\\\Contacts\\\\*)))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.impact",
    "attack.defense-evasion",
    "attack.t1486",
    "attack.t1562.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Luc Génaux"
  ],
  "false_positives": [
    "Processes related to software installation"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}