{
  "rule_id": "71b31e99-9ad0-47d4-aeb5-c0ca3928eeeb",
  "risk_score": 73,
  "description": "Detects potential DLL sideloading of \"waveedit.dll\", which is part of the Nero WaveEditor audio editing software.",
  "name": "Potential Waveedit.DLL Sideloading",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\waveedit.dll AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Nero\\\\Nero\\ Apps\\\\Nero\\ WaveEditor\\\\waveedit.exe OR C\\:\\\\Program\\ Files\\\\Nero\\\\Nero\\ Apps\\\\Nero\\ WaveEditor\\\\waveedit.exe)) AND (file.path:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Nero\\\\Nero\\ Apps\\\\Nero\\ WaveEditor\\\\* OR C\\:\\\\Program\\ Files\\\\Nero\\\\Nero\\ Apps\\\\Nero\\ WaveEditor\\\\*))))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1574.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "X__Junior (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}