{
  "rule_id": "75c505b1-711d-4f68-a357-8c3fe37dbf2d",
  "risk_score": 73,
  "description": "Detects SILENTTRINITY stager dll loading activity",
  "name": "HackTool - SILENTTRINITY Stager DLL Load",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "file.pe.description:*st2stager*",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.command-and-control",
    "attack.t1071"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Aleksey Potapov, oscd.community"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}