{
  "rule_id": "68654bf0-4412-43d5-bfe8-5eaa393cd939",
  "risk_score": 47,
  "description": "Detects potential DLL sideloading using JUSTSYSTEMS Japanese word processor",
  "name": "Potential DLL Sideloading Via JsSchHlp",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\JSESPR.dll AND (NOT file.path:C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Justsystem\\\\JsSchHlp\\\\*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.persistence",
    "attack.privilege-escalation",
    "attack.t1574.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}