{
  "rule_id": "2092cacb-d77b-4f98-ab0d-32b32f99a054",
  "risk_score": 47,
  "description": "Detects potential DLL sideloading of \"vivaldi_elf.dll\"",
  "name": "Potential Vivaldi_elf.DLL Sideloading",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\vivaldi_elf.dll AND (NOT (file.path:*\\\\Vivaldi\\\\Application\\\\* AND process.executable:*\\\\Vivaldi\\\\Application\\\\vivaldi.exe))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.privilege-escalation",
    "attack.t1574.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "X__Junior (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}