id: d056a3b8-4374-4b1a-bec1-66a82cbf70aa
status: test
description: 'Detects large HTTP POST data transfer.

  This rule is looking for a POST request with a large amount of data being sent.

  This could be a sign of data exfiltration.

  '
author: AutoGenerated
date: '2025-07-13'
modified: 2023-02-04
tags:
- attack.exfiltration
- attack.t1567
logsource:
  category: proxy
detection:
  selection:
    c-method: POST
    cs-bytes|startswith: '10000000'
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects large HTTP POST data transfer.

  This rule is looking for a POST request with a large amount of data being sent.

  This could be a sign of data exfiltration.'
