id: cff9ece0-b870-454c-920a-d2962171b942
status: test
description: Detects a HTTP request to a raw IP address (no DNS resolution)
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1140
logsource:
  category: proxy
detection:
  selection:
    c-uri|contains: ://
    c-uri|endswith:
    - ':'
    - /
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects a HTTP request to a raw IP address (no DNS resolution)'
