id: e452fd13-aeb6-41a3-9716-04358159419e
status: test
description: Detects regular periodic HTTP beaconing to a domain
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-02
tags:
- attack.command-and-control
- attack.t1071.001
logsource:
  category: proxy
detection:
  selection:
    c-uri|contains: /api/v1/status
    c-uri|endswith:
    - /status
    - /status/
    cs-host|endswith:
    - .com
    - .net
    - .org
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects regular periodic HTTP beaconing to a domain'
