id: 59f1077f-bd64-460c-b94c-a5b782206f03
status: test
description: Detects unusual outgoing SMTP activity from a desktop. This could be
  a sign of mass emails sent programmatically or data exfiltration via email.
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.exfiltration
- attack.t1567
logsource:
  category: proxy
detection:
  selection:
    c-useragent|contains:
    - Windows Desktop
    - Windows 10
    - Windows 11
    c-uri|contains: smtp
    cs-method: POST
  condition: selection
falsepositives:
- Legitimate email clients
level: medium
title: '[AUTO] Detects unusual outgoing SMTP activity from a desktop. This could be
  a sign of mass emails sent programmatically or data exfiltration via email.'
