id: 376ac217-fe0d-4c77-a8b1-b645ed0aab32
status: test
description: Detects the termination of the LSASS process. This could be a sign of
  credential access attempts.
author: AutoGenerated
date: '2025-07-13'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_termination
  product: windows
detection:
  selection:
    Image|endswith: \lsass.exe
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the termination of the LSASS process. This could be a sign
  of credential access attempts.'
