id: 22b5845c-d56a-4bfc-be30-1d4d0e7e46a1
status: test
description: Detects multiple security-related processes terminating unexpectedly
  in a short period (possible malware mass kill attempt)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_termination
  product: windows
detection:
  selection:
    Image|endswith:
    - \eventvwr.exe
    - \explorer.exe
    - \lsass.exe
    - \msdt.exe
    - \regsvr32.exe
    - \svchost.exe
    - \taskmgr.exe
    - \wermgr.exe
    - \wmi.exe
  filter_main_parent:
    ParentImage|endswith:
    - \explorer.exe
    - \svchost.exe
  filter_main_generic:
    ParentImage|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects multiple security-related processes terminating unexpectedly
  in a short period (possible malware mass kill attempt)'
