id: 8fad67c5-3741-4bee-b3b0-c0d01d6726ff
status: test
description: Detects abnormal directory replication behavior from a non-DC host. This
  could be a sign of a DCShadow attack attempt.
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    ServiceName: NTDS
    LogonType: 9
    WorkstationName|endswith: $
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects abnormal directory replication behavior from a non-DC host.
  This could be a sign of a DCShadow attack attempt.'
