id: c24b89c3-b8e3-4240-b9f3-d24add27701a
status: test
description: Detects the replication of a directory from an unauthorized machine.
  This could be a sign of DCSync credential theft attempt.
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    ObjectType: DomainController
    ObjectName|contains: DC$
    SubjectUserName|contains: NT AUTHORITY\ANONYMOUS LOGON
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the replication of a directory from an unauthorized machine.
  This could be a sign of DCSync credential theft attempt.'
