id: 0d1a6e91-617e-42e9-8543-b586eb5f1989
status: test
description: 'Detects a Kerberos ticket with an unusually long lifetime or future
  expiration date.

  This could be a sign of potential Golden Ticket usage.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  product: okta
  service: okta detection
detection:
  selection:
    eventtype: Kerberos ticket with an unusually long lifetime or future expiration
      date
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects a Kerberos ticket with an unusually long lifetime or future
  expiration date.

  This could be a sign of potential Golden Ticket usage.'
