id: 8fa6f178-57c6-47bc-9125-176de2230ea9
status: test
description: Detects the creation of a new service via sc.exe
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.execution
- attack.t1569.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - create
    - binPath=
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the creation of a new service via sc.exe'
