author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
  selection_cli:
    CommandLine|contains:
    - ' -s '
    - ' -i '
  selection_lolbin:
    CommandLine|contains:
    - ' -s '
    - ' -i '
    - ' -e '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
id: b5791aff-c13a-466b-a7f7-c01301ba017c
title: '[AUTO] User: Generate a detection rule for Detect regsvr32 LOLBins execution.'
status: experimental
description: 'User: Generate a detection rule for Detect regsvr32 LOLBins execution.'
