id: 4879085b-bf3d-4869-a3eb-992f23c22f86
status: test
description: Detects the installation of a root certificate by a suspicious process
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \certutil.exe
    - \certreq.exe
  - OriginalFileName:
    - CertUtil.exe
    - Certreq.exe
  selection_cli:
    CommandLine|contains:
    - ' -addstore '
    - ' -addstoreroot '
  filter_main_generic:
    ParentImage|endswith:
    - \explorer.exe
    - \msedge.exe
    - \msedgewebview2.exe
    - \microsoftedge.exe
    - \powershell.exe
    - \regsvr32.exe
    - \schtasks.exe
    - \svchost.exe
    - \taskmgr.exe
    - \wmic.exe
    - \wscript.exe
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the installation of a root certificate by a suspicious process'
