tag:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \eventvwr.exe
  - OriginalFileName: eventvwr.exe
  selection_cli:
    CommandLine|contains|all:
    - ' /s '
    - ' /l '
  selection_path:
    CommandLine|contains:
    - Microsoft\Windows\CurrentVersion\Explorer\ShellServices\Run
    - Microsoft\Windows\CurrentVersion\Explorer\ShellServices\RunOnce
  condition: all of selection_*
falsepositives:
- Unknown
level: high
id: 475df451-7c0f-4c2a-b7a8-d59b6754c791
author: AutoGenerated
date: '2025-07-10'
title: '[AUTO] Detect Windows UAC bypass using eventvwr'
status: experimental
description: Detect Windows UAC bypass using eventvwr
tags: []
