id: 78ea07a7-500e-4395-8542-b91d2c03eba6
status: test
description: Detects the execution of msbuild with a suspicious command line flag
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \msbuild.exe
  - OriginalFileName: MSBuild.exe
  selection_cli:
    CommandLine|contains: ' /p:Configuration='
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of msbuild with a suspicious command line flag'
