id: 634338c9-f3c0-4bc4-8f25-9dd776c1fd06
status: test
description: Detects the usage of the Incognito mimikatz module to impersonate a token
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mimikatz.exe
  - OriginalFileName: mimikatz.exe
  selection_cli:
    CommandLine|contains|all:
    - incognito
    - token
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the usage of the Incognito mimikatz module to impersonate a
  token'
