id: 5672d15c-4312-4e83-8608-494ddbe0b62d
status: test
description: Detects suspicious renaming of system binaries
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - OriginalFileName:
    - Cmd.Exe
    - cscript.exe
    - mshta.exe
    - PowerShell.EXE
    - pwsh.dll
    - regsvr32.exe
    - RUNDLL32.EXE
    - wscript.exe
  selection_cli:
    CommandLine|contains:
    - 'copy '
    - 'move '
  selection_target:
    CommandLine|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious renaming of system binaries'
