id: 1aee4cb4-6b3c-4293-8d18-ccdce26ea916
status: test
description: Detects the execution of rundll32.exe with a suspicious DLL or non-DLL
  file
author: AutoGenerated
date: '2025-07-10'
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains:
    - .dll
    - .exe
    - .ocx
  filter_main_legit_ext:
    CommandLine|endswith:
    - .dll
    - .ocx
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the execution of rundll32.exe with a suspicious DLL or non-DLL
  file'
