id: 6fc9ad9d-df53-4ebd-b0c7-a3c656ed80f5
status: test
description: Detects suspicious DLL injection via CreateRemoteThread
author: AutoGenerated
date: '2025-07-10'
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains|all:
    - CreateRemoteThread
    - kernel32.dll
    - LoadLibrary
  filter_main_legit_dll:
    CommandLine|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    - :\Windows\WinSxS\
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious DLL injection via CreateRemoteThread'
