id: 85edca82-8654-4685-b657-20f5b622144a
status: test
description: Detects execution of encoded VBScript via cscript
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \cscript.exe
  - OriginalFileName: cscript.exe
  selection_cli:
    CommandLine|contains:
    - vbscript:A
    - vbscript:B
    - vbscript:C
    - vbscript:D
    - vbscript:E
    - vbscript:F
    - vbscript:G
    - vbscript:H
    - vbscript:I
    - vbscript:J
    - vbscript:K
    - vbscript:L
    - vbscript:M
    - vbscript:N
    - vbscript:O
    - vbscript:P
    - vbscript:Q
    - vbscript:R
    - vbscript:S
    - vbscript:T
    - vbscript:U
    - vbscript:V
    - vbscript:W
    - vbscript:X
    - vbscript:Y
    - vbscript:Z
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects execution of encoded VBScript via cscript'
