id: e819fa27-8bd1-4c3b-86ae-2a55e447cee9
status: test
description: Detects usage of powershell.exe encoded commands
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \powershell.exe
  - OriginalFileName: PowerShell.EXE
  selection_cli:
    CommandLine|contains: ' -EncodedCommand'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects usage of powershell.exe encoded commands'
