id: 2019bf3b-c6cd-4c75-9911-7e88610fd2f5
status: test
description: Detects suspicious PowerShell download cradle with iex
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - iex
    - Download
    - WebClient
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell download cradle with iex'
