id: 78d5b05b-8acb-450c-934b-af9b0ebecf3f
status: test
description: Detects PowerShell download cradle with Invoke-WebRequest
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218.011
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains:
    - Invoke-WebRequest
    - IWR
  selection_webrequest:
    CommandLine|contains:
    - http
    - https
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell download cradle with Invoke-WebRequest'
