id: a670d501-a607-4a2d-a245-05f08dbb6424
status: test
description: Detects suspicious use of sc.exe to stop security services
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - ' stop '
    - Security
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of sc.exe to stop security services'
