id: b742df80-b771-49ae-b69d-b055cc294d80
status: test
description: Detects PowerShell commands with IEX and WebClient/DownloadString that
  download suspicious content
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218
- attack.t1218.011
logsource:
  category: process_creation
  product: windows
detection:
  selection_iex:
    CommandLine|contains: IEX
  selection_webclient:
    CommandLine|contains:
    - WebClient
    - DownloadString
  selection_suspicious_paths:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects PowerShell commands with IEX and WebClient/DownloadString that
  download suspicious content'
