id: 6f54b58c-2480-41e4-b05a-42ac64ef41ea
status: test
description: Detects suspicious net localgroup administrators add commands
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1136.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_add:
    CommandLine|contains: ' localgroup '
  selection_group:
    CommandLine|contains: ' administrators '
  selection_add_add:
    CommandLine|contains: ' /add '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious net localgroup administrators add commands'
