id: a63b6f93-3756-45ac-b49d-28893d56ea8f
status: test
description: Detects suspicious PowerShell AMSI bypass techniques
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains|all:
    - New-Object
    - System.Net.WebClient
    - DownloadString
    - AddType
    - System.Management.Automation.PSScript
    - Invoke
  selection_2:
    CommandLine|contains|all:
    - New-Object
    - System.Net.WebClient
    - DownloadString
    - AddType
    - System.Management.Automation.PSScript
    - Invoke
    - System.Management.Automation.PSEvent
  selection_3:
    CommandLine|contains|all:
    - New-Object
    - System.Net.WebClient
    - DownloadString
    - AddType
    - System.Management.Automation.PSScript
    - Invoke
    - System.Management.Automation.PSEvent
    - Name
    - EventName
  selection_4:
    CommandLine|contains|all:
    - New-Object
    - System.Net.WebClient
    - DownloadString
    - AddType
    - System.Management.Automation.PSScript
    - Invoke
    - System.Management.Automation.PSEvent
    - Name
    - EventName
    - EventData
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell AMSI bypass techniques'
