id: 9a5c23a0-c834-4ee4-ba62-6bf84cfd0563
status: test
description: Detects the execution of rundll32.exe with a URL parameter
author: AutoGenerated
date: '2025-07-10'
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_cli:
    CommandLine|contains: http
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the execution of rundll32.exe with a URL parameter'
