id: 51e0a0d6-dbc3-4942-a867-20fbf642a28b
status: test
description: Detects suspicious sc.exe create commands for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.persistence
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains:
    - create
    - add
  selection_susp_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious sc.exe create commands for persistence'
