id: ad0b9103-112a-4459-a96c-24db7a2eb168
status: test
description: Detects suspicious usage of bitsadmin for malicious downloads
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.defense-evasion
- attack.t1197
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cli:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
  selection_http:
    CommandLine|contains:
    - http
    - https
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of bitsadmin for malicious downloads'
