id: 3a2fd620-c165-430b-a0fd-0a015c167132
status: test
description: Detects the use of reg.exe to modify the startup registry keys.
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_cli:
    CommandLine|contains:
    - ' HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run'
    - ' HKCU\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Run'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of reg.exe to modify the startup registry keys.'
