id: c77ff6ff-2621-4fb6-a098-070a9361ddc0
status: test
description: Detects suspicious usage of schtasks.exe to create persistence tasks
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains:
    - /create
    - /change
  selection_susp_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of schtasks.exe to create persistence tasks'
