id: 5918b443-41df-427b-ac17-a46e78ee78ba
status: test
description: Detects suspicious PowerShell download cradle with Invoke-WebRequest
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.execution
- attack.t1059.001
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains|all:
    - Invoke-WebRequest
    - ' -OutFile '
  selection_paths:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell download cradle with Invoke-WebRequest'
