id: 4bf6d873-6edd-4eed-a877-8516d0a1b5b7
status: test
description: Detects suspicious usage of certutil to download and decode files
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.defense-evasion
- attack.t1140
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
  selection_cli:
    CommandLine|contains|all:
    - 'urlcache '
    - ' -decode '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of certutil to download and decode files'
