id: cb63136a-550b-4f1b-bbfe-518351c47df6
status: test
description: Detects suspicious schtasks.exe create commands for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_cli:
    CommandLine|contains: ' /create '
  selection_susp_paths:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious schtasks.exe create commands for persistence'
