id: ebb18654-54bb-4f92-b423-eb3351bc74e1
status: test
description: Detects suspicious net user add commands for privilege escalation
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.privilege-escalation
- attack.t1068.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - user
    - add
  selection_user:
    CommandLine|contains:
    - administrator
    - admin
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious net user add commands for privilege escalation'
