id: 7bc05ea9-4795-45f8-9bd8-c13547ecdd40
status: test
description: Detects suspicious net localgroup administrators add commands for privilege
  escalation
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.privilege-escalation
- attack.t1068
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_add:
    CommandLine|contains: ' localgroup administrators '
  selection_add_add:
    CommandLine|contains:
    - ' /add '
    - '+ '
  selection_add_user:
    CommandLine|contains:
    - ' /user:'
    - ' /user:'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious net localgroup administrators add commands for privilege
  escalation'
