id: 21c7498b-6dbe-400a-896a-9421053faf95
status: test
description: Detects the use of the "net user" command to create a new user with administrative
  privileges
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1136.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - user
    - add
    CommandLine|contains:
    - /domain
    - /user
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "net user" command to create a new user with
  administrative privileges'
