id: 50929166-3940-4d68-b439-91021fd09319
status: test
description: Detects suspicious use of PowerShell Invoke-Obfuscation techniques
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains:
    - ' -e byp'
    - ' -e hsh'
    - ' -e inv'
    - ' -e jsb'
    - ' -e nk2'
    - ' -e pba'
    - ' -e pbi'
    - ' -e ppc'
    - ' -e rsl'
    - ' -e sch'
    - ' -e sct'
    - ' -e vb'
    - ' -e wm'
    - ' -e xml'
    - ' -w h'
    - ' -w hc'
    - ' -w hk'
    - ' -w hs'
    - ' -w hv'
    - ' -w hz'
    - ' -w o'
    - ' -w on'
    - ' -w os'
    - ' -w or'
    - ' -w osn'
    - ' -w osr'
    - ' -w osv'
    - ' -w ow'
    - ' -w owz'
    - ' -w r'
    - ' -w ra'
    - ' -w rb'
    - ' -w rc'
    - ' -w rd'
    - ' -w re'
    - ' -w rl'
    - ' -w rn'
    - ' -w ro'
    - ' -w rr'
    - ' -w rs'
    - ' -w rw'
    - ' -w rz'
    - ' -w z'
    - ' -w za'
    - ' -w zb'
    - ' -w zc'
    - ' -w zd'
    - ' -w ze'
    - ' -w zl'
    - ' -w zn'
    - ' -w zo'
    - ' -w zr'
    - ' -w zs'
    - ' -w zv'
    - ' -w zz'
  selection_2:
    CommandLine|contains|all:
    - ' -w h '
    - ' -enc '
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of PowerShell Invoke-Obfuscation techniques'
