id: 1a2b4eed-8d6d-47c4-b416-2b515114a445
status: test
description: Detects suspicious use of Certify for AD CS enumeration
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.discovery
- attack.t1012
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \certify.exe
  - OriginalFileName: Certify.exe
  selection_cli:
    CommandLine|contains|all:
    - ' -c '
    - ' -e '
    - ' -p '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of Certify for AD CS enumeration'
