id: b45bf255-b427-408f-a20c-9c1b892797d6
status: test
description: Detects suspicious modification of GPO scripts for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.persistence
- attack.t1136.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \gpedit.msc
  - OriginalFileName: gpedit.msc
  selection_cli:
    CommandLine|contains:
    - \\Policies\\
    - \\Machine\\
    - \\User\\
  filter_main_gpedit:
    ParentImage|endswith: \gpedit.msc
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious modification of GPO scripts for persistence'
