id: 84566c35-f55c-46bb-aa10-128188e83065
status: test
description: Detects suspicious usage of SharpDNS for ADIDNS enumeration
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \SharpDNS.exe
  - OriginalFileName: SharpDNS.exe
  selection_cli:
    CommandLine|contains|all:
    - ' -q=TXT'
    - ' -t=127.0.0.1'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of SharpDNS for ADIDNS enumeration'
