id: af22d4fe-9842-467e-9404-3abac5b6e5b8
status: test
description: Detects usage of the "net group" command to enumerate groups on a domain
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains: ' group /domain'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects usage of the "net group" command to enumerate groups on a domain'
