id: ad7be19a-9203-4d78-a3d9-800409093111
status: test
description: Detects the use of the "whoami" command with the "/groups" flag to enumerate
  privileges
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.discovery
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \whoami.exe
    - \whoami.com
  - OriginalFileName: whoami.exe
  selection_cli:
    CommandLine|contains: ' /groups'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "whoami" command with the "/groups" flag to
  enumerate privileges'
