id: b2b5f36c-2671-4182-a1f8-10da201f2cfe
status: test
description: Detects suspicious usage of RoguePotato for privilege escalation
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.privilege-escalation
- attack.t1546.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rogue.exe
  - OriginalFileName: rogue.exe
  selection_cli:
    CommandLine|contains:
    - ' -a '
    - ' -e '
    - ' -g '
    - ' -i '
    - ' -k '
    - ' -l '
    - ' -p '
    - ' -s '
    - ' -t '
    - ' -u '
    - ' -v '
    - ' -w '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of RoguePotato for privilege escalation'
