id: 9162c4d4-ae9a-4ca7-9231-e492feb58d41
status: test
description: Detects suspicious usage of sc.exe to configure services for persistence
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
  selection_cli:
    CommandLine|contains|all:
    - config
    - binPath=
  selection_susp_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of sc.exe to configure services for persistence'
