id: 214aa933-f53f-4c6d-a621-77b1566f9b0c
status: test
description: Detects suspicious PowerShell commands disabling real-time protection
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmdlet:
    CommandLine|contains:
    - Set-MpPreference
    - Set-MpPreference -
  selection_flag:
    CommandLine|contains:
    - DisableRealtimeMonitoring
    - DisableAntiVirus
    - DisableAntiSpyware
    - DisableIntrusionPrevention
    - DisableBehaviorMonitoring
    - DisableIOAVProtection
    - DisableNetworkProtection
    - DisableScriptBlockLogging
    - DisableSecurityCenter
    - DisableVirusScanOnSusp
    - DisableVirusScanOnSuspWeb
    - DisableVirusScanOnSuspMail
    - DisableVirusScanOnSuspFtp
    - DisableVirusScanOnSuspHttp
    - DisableVirusScanOnSuspHttps
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious PowerShell commands disabling real-time protection'
