id: 562b95f6-1412-437f-aaa0-47242e965939
status: test
description: Detects suspicious use of PowerShell Get-ADUser for user enumeration
author: AutoGenerated
date: '2025-07-10'
tags:
- attack.discovery
- attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_cli:
    CommandLine|contains: Get-ADUser
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of PowerShell Get-ADUser for user enumeration'
