id: ca22f6e4-0313-4c10-8f99-7931c8fee3e4
status: test
description: Detects the use of the "nltest" utility with the "/dsgetsite" flag to
  enumerate sites.
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-13
tags:
- attack.discovery
- attack.t1087
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \nltest.exe
  - OriginalFileName: nltest.exe
  selection_cli:
    CommandLine|contains: ' /dsgetsite '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of the "nltest" utility with the "/dsgetsite" flag
  to enumerate sites.'
