id: ec49cb26-b4e2-4a41-97d6-6c9ece3b6e09
status: test
description: Detects suspicious usage of net time for domain controller discovery
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
  selection_cli:
    CommandLine|contains|all:
    - ' time '
    - ' /domain'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious usage of net time for domain controller discovery'
