id: e5f20756-90b8-4f0a-9b6e-50c74bd497d4
status: test
description: Detects the use of bitsadmin to transfer files to C2 servers
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
  selection_cli:
    CommandLine|contains|all:
    - ' /transfer '
    - ' http'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the use of bitsadmin to transfer files to C2 servers'
