id: 413641ff-2810-465c-8d35-6b7abe321273
status: test
description: Detects suspicious use of impacket-smbexec for lateral movement
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.lateral-movement
- attack.t1021.002
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: /smbexec
    CommandLine|contains:
    - ' -u '
    - ' -p '
    - ' -H '
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious use of impacket-smbexec for lateral movement'
