id: 4fdb0832-7deb-48c1-b7a1-4c68e8db7de1
status: test
description: Detects suspicious usage of Mimikatz dpapi::masterkey for key extraction
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \mimikatz.exe
  - OriginalFileName: mimikatz.exe
  selection_cli:
    CommandLine|contains|all:
    - dpapi::masterkey
    - ::c
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious usage of Mimikatz dpapi::masterkey for key extraction'
