id: d16c417b-e2c5-401c-adae-59f0ddff21da
status: test
description: Detects suspicious use of nltest /parentdomain for trust enumeration
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-09
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \nltest.exe
  - OriginalFileName: nltest.exe
  selection_cli:
    CommandLine|contains: /parentdomain
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects suspicious use of nltest /parentdomain for trust enumeration'
