id: fd013be4-fdc6-4b5c-878d-7e9ac6b8dc8f
status: test
description: Detects the use of icacls to grant Everyone full control on sensitive
  folders
author: AutoGenerated
date: '2025-07-10'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1505.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \icacls.exe
  - OriginalFileName: ICACLS.EXE
  selection_cli:
    CommandLine|contains|all:
    - grant
    - Everyone
    - full
    - control
    - :/
  selection_folders:
    CommandLine|contains:
    - C:\Windows\
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\Users\Public\
    - C:\Temp\
    - C:\Windows\Temp\
    - C:\PerfLogs\
    - C:\Users\All Users\
    - C:\Users\Default\
    - C:\Users\Contacts\
    - C:\Users\Favorites\
    - C:\Users\Start Menu\
    - C:\Users\Templates\
    - C:\Users\Saved Games\
    - C:\Users\Music\
    - C:\Users\Pictures\
    - C:\Users\Videos\
    - C:\Users\Documents\
    - C:\Users\Desktop\
    - \$Recycle.bin\
    - \ADMIN$
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the use of icacls to grant Everyone full control on sensitive
  folders'
