{
  "rule_id": "c15e99a3-c474-48ab-b9a7-84549a7a9d16",
  "risk_score": 73,
  "description": "Detects a remote thread creation of Ttdinject.exe used as proxy",
  "name": "Remote Thread Creation Ttdinject.exe Proxy",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "process.executable:*\\\\ttdinject.exe",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1127"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "frack113"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}