{
  "rule_id": "77564cc2-7382-438b-a7f6-395c2ae53b9a",
  "risk_score": 73,
  "description": "Detects remote thread creation in \"KeePass.exe\" which could indicates potential password dumping activity",
  "name": "Remote Thread Created In KeePass.EXE",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.event_data.TargetImage:*\\\\KeePass.exe",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1555.005"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Timon Hackenjos"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}