{
  "rule_id": "6d444368-6da1-43fe-b2fc-44202430480e",
  "risk_score": 47,
  "description": "Detects when a DNS zone transfer failed.",
  "name": "Failed DNS Zone Transfer",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:DNS\\ Server AND event.code:6004",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.reconnaissance",
    "attack.t1590.002"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Zach Mathis"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}