{
  "rule_id": "cbe51394-cd93-4473-b555-edf0144952d9",
  "risk_score": 73,
  "description": "Detects a DNS server error in which a specified plugin DLL (in registry) could not be loaded",
  "name": "DNS Server Error Failed Loading the ServerLevelPluginDLL",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:DNS\\ Server AND (event.code:(150 OR 770 OR 771))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1574.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}