{
  "rule_id": "993c2665-e6ef-40e3-a62a-e1a97686af79",
  "risk_score": 47,
  "description": "Detects a user certificate that was valid but could not be mapped to a user in a strong way (such as via explicit mapping, key trust mapping, or a SID)\nThis could be a sign of exploitation of the elevation of privilege vulnerabilities (CVE-2022-34691, CVE-2022-26931, CVE-2022-26923) that can occur when the KDC allows certificate spoofing by not requiring a strong mapping.\nEvents where the AccountName and CN of the Subject do not match, or where the CN ends in a dollar sign indicating a machine, may indicate certificate spoofing.\n",
  "name": "Certificate Use With No Strong Mapping",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:System AND ((event.code:(39 OR 41)) AND winlog.provider_name:Kerberos\\-Key\\-Distribution\\-Center)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.privilege-escalation"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "@br4dy5"
  ],
  "false_positives": [
    "If prevalent in the environment, filter on events where the AccountName and CN of the Subject do not reference the same user",
    "If prevalent in the environment, filter on CNs that end in a dollar sign indicating it is a machine name"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}