{
  "rule_id": "e6e88853-5f20-4c4a-8d26-cd469fd8d31f",
  "risk_score": 47,
  "description": "Detects potential abuse of ntdsutil to dump ntds.dit database",
  "name": "Ntdsutil Abuse",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Application AND (winlog.event_data.Data:*ntds.dit* AND (event.code:(216 OR 325 OR 326 OR 327)) AND winlog.provider_name:ESENT)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1003.003"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate backup operation/creating shadow copies"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}