id: 5ce7fd9d-c2db-4270-8b47-87f63ece3c88
status: test
description: Detects the creation of a new local user account via net.exe or net1.exe
author: AutoGenerated
date: '2025-07-10'
modified: 2023-02-04
tags:
- attack.persistence
- attack.t1136.001
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: SYSCALL
    exe|endswith:
    - /net
    - /net1
    comm: user
    keywords:
    - adduser
    - newusers
  condition: selection
falsepositives:
- Legitimate administration activities
level: medium
title: '[AUTO] Detects the creation of a new local user account via net.exe or net1.exe'
