id: 71fd6ece-2190-4ab3-83e8-b24d7d24643b
status: test
description: Detects the creation of files with alternate data streams.
author: AutoGenerated
date: '2025-07-13'
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  product: linux
detection:
  keywords:
  - :shed_stream
  - :zone.identifier
  - :zombie
  - :eof
  - :vault
  - :index
  - :ext
  - :msoff
  - :msoff_stream
  - :msoff_index
  - :msoff_ext
  - :msoff_vault
  - :msoff_eof
  - :msoff_zombie
  condition: keywords
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of files with alternate data streams.'
