id: fef9c717-57c8-4712-9477-80d9eadf686e
status: test
description: Detects suspicious replication of directory services (DCSync attack attempt)
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    ServiceName: KDC
    ServiceType: '4'
    ServiceNameType: '1'
    ServiceNameDomain: domain
    ServiceNameDomainType: '1'
    ServiceNameDomainName: domain.tld
    ServiceNameDomainNameType: '1'
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects suspicious replication of directory services (DCSync attack
  attempt)'
