id: 621ed9d3-584b-4693-9cab-365c67ab5eff
status: test
description: Detects unauthorized RDP connection
author: AutoGenerated
date: '2025-07-13'
modified: 2023-01-02
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 3
    WorkstationName|endswith:
    - .local
    - .com
    - .net
    - .org
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects unauthorized RDP connection'
