id: 8f3d1803-5974-4e14-bcde-70cd38f60c15
status: test
description: Detects Windows RDP administrative logon
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-29
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 10
    LogonProcessName: RDP-Tcp
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects Windows RDP administrative logon'
