id: 0762fc11-8a3c-42a1-84d4-2d949a992f8f
status: test
description: Detects stopping of Windows Update Service (wuauserv)
author: AutoGenerated
date: '2025-07-13'
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: security
  definition: The "Microsoft-Windows-Sysmon/Operational" event logging must be enabled
    and configured to collect process command line information
detection:
  selection:
    EventID: 5
    ServiceFileName|endswith: \wuauserv.exe
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects stopping of Windows Update Service (wuauserv)'
