id: a46312d2-0296-468d-9453-86ca1a5adb3d
status: test
description: Detects the creation of a scheduled task with an encoded command
author: AutoGenerated
date: '2025-07-10'
modified: 2023-01-02
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  service: security
  definition: The "Audit Other Object Access" logging policy must be configured in
    order to receive events related to other objects. Audit other object access for
    the Schduled Tasks share is configured by default. Verify that the policy is configured
    for compliance. The "Audit Other Object Access" policy must be configured to a
    value of "Success" in order to receive events.
detection:
  selection:
    EventID: 5145
    ObjectType: ScheduledTask
    ObjectName|contains:
    - Task_
    - Task_1
    - Task_2
    - Task_3
    - Task_4
    - Task_5
    - Task_6
    - Task_7
    - Task_8
    - Task_9
    ObjectName|endswith: ' /Create /SC ONLOGON /TN '
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a scheduled task with an encoded command'
