id: a79777af-70ca-4b89-858d-3713ad2708c6
status: test
description: Detects the built-in Administrator account being enabled or used interactively
  (potential backdoor account activity)
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
  definition: The "Security" logging was enabled and configured
detection:
  selection_eid:
    EventID: 4739
  selection_user:
    SubjectUserName|contains: ADMINISTRATOR
  condition: all of selection_*
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects the built-in Administrator account being enabled or used interactively
  (potential backdoor account activity)'
