id: bd89f3ad-9462-4cd8-a20d-f798700f8c53
status: test
description: Detects clearing or truncation of Windows Firewall logs by a script or
  tool (evidence cleanup attempt)
author: AutoGenerated
date: '2025-07-12'
tags:
- attack.defense-evasion
- attack.t1070
logsource:
  product: windows
  service: firewall-event
detection:
  selection:
    EventID: 2015
    LogName: Windows Firewall with Advanced Security
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects clearing or truncation of Windows Firewall logs by a script
  or tool (evidence cleanup attempt)'
