id: 2a74b4c8-1d7d-4b01-9932-d0360431571e
status: test
description: 'Detects the creation of a scheduled task with an uncommon trigger (e.g.,
  on workstation unlock) by an unprivileged user.

  Adversaries may abuse scheduled tasks to execute malicious code at a later time.

  Scheduled tasks are a common method for persistence and execution.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2022-12-25
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: SYSLOG
    log_level: info
    msg: Adding scheduled task
  filter_main_system:
    user: system
  filter_main_root:
    user: root
  filter_main_valid_triggers:
  - at
  - crontab
  - d
  - e
  - every
  - hourly
  - hourly.allow
  - hourly.deny
  - monthly
  - monthly.allow
  - monthly.deny
  - reboot
  - reboot.allow
  - reboot.deny
  - runlevel
  - runlevel.allow
  - runlevel.deny
  - weekly
  - weekly.allow
  - weekly.deny
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the creation of a scheduled task with an uncommon trigger (e.g.,
  on workstation unlock) by an unprivileged user.

  Adversaries may abuse scheduled tasks to execute malicious code at a later time.

  Scheduled tasks are a common method for persistence and execution.'
