id: 44690f0b-df7d-4d84-b239-ca1942c18fc4
status: test
description: Detects a sudden surge in process handle requests to LSASS (possible
  attempt to dump or manipulate LSASS memory)
author: AutoGenerated
date: '2025-07-12'
modified: 2022-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  product: windows
  service: security
  definition: The "Security" logging service must be enabled in order to receive the
    events. This can be done via Registry (HKLM\System\CurrentControlSet\Services\Security\EventLogging\KM/Enabled
    = 1) or via auditpol (auditpol.exe set-audit-policy "ObjectAccess" -subcategory
    "Handle" -success 1 -contain "lsass" -logtype 5145)
detection:
  selection:
    EventID: 5145
    ProcessName|endswith: lsass.exe
  filter_main_generic:
    ProcessName|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  filter_optional_defender:
    ProcessName|startswith: C:\ProgramData\Microsoft\Windows Defender\
    ProcessName|endswith: \MsMpEng.exe
  filter_optional_windows_update:
    ProcessName|startswith: C:\Windows\SoftwareDistribution\Download\
    ProcessName|endswith: \wuauclt.exe
  filter_optional_windows_update_1903:
    ProcessName|startswith: C:\Windows\SoftwareDistribution\Download\
    ProcessName|endswith: \wuauclt.exe
    ProcessName|contains: \Windows10.0-
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects a sudden surge in process handle requests to LSASS (possible
  attempt to dump or manipulate LSASS memory)'
