{
  "rule_id": "2f211361-7dce-442d-b78a-c04039677378",
  "risk_score": 73,
  "description": "Detects all variations of obfuscated powershell IEX invocation code generated by Invoke-Obfuscation framework from the code block cited in the reference section below",
  "name": "Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell Module",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "Payload:/\\$PSHome\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$PSHome\\[/ OR Payload:/\\$ShellId\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$ShellId\\[/ OR Payload:/\\$env:Public\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$env:Public\\[/ OR Payload:/\\$env:ComSpec\\[(\\s*\\d{1,3}\\s*,){2}/ OR Payload:/\\*mdr\\*\\W\\s*\\)\\.Name/ OR Payload:/\\$VerbosePreference\\.ToString\\(/ OR Payload:/\\[String\\]\\s*\\$VerbosePreference/",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1027",
    "attack.execution",
    "attack.t1059.001"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Daniel Bohannon (@Mandiant/@FireEye), oscd.community"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}