id: 44c4a7f8-3ad4-4d1c-89c1-4a591385ada5
status: test
description: Detects DNS tunneling using iodine
author: AutoGenerated
date: '2025-07-10'
modified: 2022-11-27
tags:
- attack.command-and-control
- attack.t1090.001
logsource:
  category: dns
detection:
  selection:
    QueryName|contains:
    - 127.0.0.1
    - 192.168.0.0/16
    - 10.0.0.0/8
    - 172.16.0.0/12
    - ::1/128
    - fe80::/10
    - fc00::/7
  condition: selection
falsepositives:
- Unknown
level: high
title: '[AUTO] Detects DNS tunneling using iodine'
