{
  "rule_id": "550d3350-bb8a-4ff3-9533-2ba533f4a1c0",
  "risk_score": 99,
  "description": "Detects specific patterns found after a successful ProxyLogon exploitation in relation to a Commandlet invocation of Set-OabVirtualDirectory",
  "name": "ProxyLogon MSExchange OabVirtualDirectory",
  "severity": "critical",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:MSExchange\\ Management AND ((*OabVirtualDirectory* AND *\\ \\-ExternalUrl\\ *) AND (*eval\\(request* OR *http\\:\\/\\/f\\/\\<script* OR *\\\"unsafe\\\"\\};* OR *function\\ Page_Load\\(\\)*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.t1587.001",
    "attack.resource-development"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Unlikely"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}