{
  "rule_id": "ff301988-c231-4bd0-834c-ac9d73b86586",
  "risk_score": 47,
  "description": "Detects the deletion of the PowerShell console History logs which may indicate an attempt to destroy forensic evidence",
  "name": "PowerShell Console History Logs Deleted",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "file.path:*\\\\PSReadLine\\\\ConsoleHost_history.txt",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.t1070"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}