{
  "rule_id": "52182dfb-afb7-41db-b4bc-5336cb29b464",
  "risk_score": 73,
  "description": "Detects the download of suspicious file type from a well-known file and paste sharing domain",
  "name": "Suspicious File Download From File Sharing Websites -  File Stream",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "(winlog.event_data.Contents:(*.githubusercontent.com* OR *anonfiles.com* OR *cdn.discordapp.com* OR *ddns.net* OR *dl.dropboxusercontent.com* OR *ghostbin.co* OR *glitch.me* OR *gofile.io* OR *hastebin.com* OR *mediafire.com* OR *mega.nz* OR *onrender.com* OR *pages.dev* OR *paste.ee* OR *pastebin.com* OR *pastebin.pl* OR *pastetext.net* OR *pixeldrain.com* OR *privatlab.com* OR *privatlab.net* OR *send.exploit.in* OR *sendspace.com* OR *storage.googleapis.com* OR *storjshare.io* OR *supabase.co* OR *temp.sh* OR *transfer.sh* OR *trycloudflare.com* OR *ufile.io* OR *w3spaces.com* OR *workers.dev*)) AND (file.path:(*.cpl\\:Zone* OR *.dll\\:Zone* OR *.exe\\:Zone* OR *.hta\\:Zone* OR *.lnk\\:Zone* OR *.one\\:Zone* OR *.vbe\\:Zone* OR *.vbs\\:Zone* OR *.xll\\:Zone*))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.defense-evasion",
    "attack.s0139",
    "attack.t1564.004"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Florian Roth (Nextron Systems)"
  ],
  "false_positives": [
    "Some false positives might occur with binaries download via Github"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}