id: 61866b9a-b0e4-4abe-9eb0-5e44c783b443
status: test
description: 'Detects the addition of a custom Security Support Provider (SSP) in
  the registry for persistence.

  Adversaries may abuse SSPs to load malicious DLLs for persistence, privilege escalation,
  and defense evasion.

  This rule looks for the addition of a new value under HKLM\SYSTEM\CurrentControlSet\Control\Lsa\SspIniOrderList.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1546.007
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SYSTEM\CurrentControlSet\Control\Lsa\SspIniOrderList
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects the addition of a custom Security Support Provider (SSP) in
  the registry for persistence.

  Adversaries may abuse SSPs to load malicious DLLs for persistence, privilege escalation,
  and defense evasion.

  This rule looks for the addition of a new value under HKLM\SYSTEM\CurrentControlSet\Control\Lsa\SspIniOrderList.'
