id: ac4c337f-7257-48e4-bbeb-371aecef2d68
status: test
description: 'Detects changes to the "Notification" value in the "Winlogon" registry
  key.

  This value is used by Winlogon to load the DLL that will be called when the user
  logs in.

  Adversaries can abuse this value to load their own DLLs and execute them during
  logins.

  '
author: AutoGenerated
date: '2025-07-12'
modified: 2023-02-09
tags:
- attack.persistence
- attack.t1546.011
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\Notification
  condition: selection
falsepositives:
- Unknown
level: medium
title: '[AUTO] Detects changes to the "Notification" value in the "Winlogon" registry
  key.

  This value is used by Winlogon to load the DLL that will be called when the user
  logs in.

  Adversaries can abuse this value to load their own DLLs and execute them during
  logins.'
