{
  "rule_id": "ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d",
  "risk_score": 47,
  "description": "Detects failed logon attempts from clients with external network IP to an MSSQL server. This can be a sign of a bruteforce attack.",
  "name": "MSSQL Server Failed Logon From External Network",
  "severity": "medium",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Application AND ((event.code:18456 AND winlog.provider_name:*MSSQL*) AND (NOT (winlog.event_data.Data:(*CLIENT\\:\\ 10.* OR *CLIENT\\:\\ 172.16.* OR *CLIENT\\:\\ 172.17.* OR *CLIENT\\:\\ 172.18.* OR *CLIENT\\:\\ 172.19.* OR *CLIENT\\:\\ 172.20.* OR *CLIENT\\:\\ 172.21.* OR *CLIENT\\:\\ 172.22.* OR *CLIENT\\:\\ 172.23.* OR *CLIENT\\:\\ 172.24.* OR *CLIENT\\:\\ 172.25.* OR *CLIENT\\:\\ 172.26.* OR *CLIENT\\:\\ 172.27.* OR *CLIENT\\:\\ 172.28.* OR *CLIENT\\:\\ 172.29.* OR *CLIENT\\:\\ 172.30.* OR *CLIENT\\:\\ 172.31.* OR *CLIENT\\:\\ 192.168.* OR *CLIENT\\:\\ 127.* OR *CLIENT\\:\\ 169.254.*))))",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.credential-access",
    "attack.t1110"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "j4son"
  ],
  "false_positives": [
    "Unknown"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}