{
  "rule_id": "b3d57a5c-c92e-4b48-9a79-5f124b7cf964",
  "risk_score": 73,
  "description": "Detects when the a stored procedure is set or cleared for automatic execution in MSSQL. A stored procedure that is set to automatic execution runs every time an instance of SQL Server is started",
  "name": "MSSQL SPProcoption Set",
  "severity": "high",
  "type": "query",
  "language": "lucene",
  "query": "winlog.channel:Application AND ((winlog.event_data.Data:*object_name\\:sp_procoption* AND winlog.event_data.Data:*statement\\:EXEC*) AND event.code:33205 AND winlog.provider_name:*MSSQL*)",
  "filters": [],
  "enabled": true,
  "interval": "5m",
  "from": "now-70m",
  "max_signals": 100,
  "tags": [
    "attack.persistence"
  ],
  "to": "now",
  "references": [],
  "threat": [],
  "version": 1,
  "exceptions_list": [],
  "related_integrations": [],
  "required_fields": [],
  "setup": "",
  "author": [
    "Nasreddine Bencherchali (Nextron Systems)"
  ],
  "false_positives": [
    "Legitimate use of the feature by administrators (rare)"
  ],
  "license": "DRL",
  "output_index": "",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "meta": {
    "kibana_siem_app_url": ""
  },
  "actions": []
}